{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbsAvnE0un_wuP6_js41rm5y9O0_f87pat6wai8m_oUSOgASYQ8wamqlN0w3iKRJMQFdt1HrWHXrJ1OUj95tX1GdmgQkkGY50NHKxgWprF_poEIjpP5arOEi1fM%3D_V2&jobTitle=Security+Product+Manager%2C+Consumer+Hardware&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T11:31:44.472Z",
    "description": "<p>At Google, we build products that organize the world&#39;s information and make it universally accessible to our users. These products are the lifeblood of who we are. As part of the Product Management team, you work closely with our engineers to guide products from conception to launch. You connect the technical and with the business, working with teams across Engineering, Sales, Marketing and Finance. With your technical expertise, you identify a project’s setback and generate solutions for resolving them quickly. As a Product Manager, you help shape the future of Google products.</p>\n\n\n<p>As a Security Product Manager, you will drive deep Hardware/Software collaboration between the Consumer Hardware Engineering team and Software teams across the company. You will define custom consumer hardware that brings to life key features which distinguish our first party devices.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/141756305837564614",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-08T11:31:44.472Z",
    "publish_date": "2019-03-08T11:31:44.472Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS in Electrical Engineering, Computer Science, Physics or related technical field, or equivalent practical experience.</li>\n<li>5 years of Product Management experience in the development of security aspects consumer hardware.</li>\n<li>Experience in product development in the Android industry with clear understanding of OS security requirements.</li>\n<li>Experience with cryptography, trusted execution environments, certification requirements, evaluations, and secure manufacturing.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in the development of product roadmaps working with multiple stakeholders, use cases and conflicting priorities.</li>\n<li>Experience defining and launching consumer hardware.</li>\n<li>Experience with consumer hardware development life cycles and ODM/CM working models.</li>\n<li>Familiarity with computing and mobile operating systems and software application development life cycles.</li>\n<li>Developed analytical skills and business acumen.</li>\n<li>Developed communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive customer hardware roadmap strategy. Partner closely with product teams across Google to understand their vision, objectives and opportunities for strategic alignment.</li>\n<li>Evaluate new applications, use cases, proof-of-concepts, technologies and standards, and advocate for/against adoption based on consumer hardware and system-level considerations.</li>\n<li>Drive early and ongoing alignment between engineering and Product Management, Software and User Experience teams.</li>\n<li>Build consumer hardware business metrics into overall product/device plan to drive balanced P&amp;L, and scalability.</li>\n<li>Establish relationships with critical consumer hardware ecosystem partners to develop in-depth knowledge of capabilities and roadmaps.</li>\n</ul>",
    "title": "Security Product Manager, Consumer Hardware"
}