{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckd2mCKS8q5K8aMeQApWWS55RWtHoiR0bdjIij0LKuS0SOgCPMA3T8-Ws-O0_9PJ87om6K0m2n1PnEgIriLBVI0fGjZbi1mwt45HtT8SCv4EYD5ssENYmQM1m0QE%3D_V2&jobTitle=Health+IT+System+Engineer%2C+AI+Healthcare&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-05T15:01:39.756Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n\n<p>There is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. As part of the AI Healthcare team, our focus is on high impact problems that have recently become tractable with the advent of Deep Learning.\n</p>\n\n\n<p>As a Health IT System Engineer, you&#39;ll be an integral team member. Your understanding of the healthcare landscape, requirements, and challenges will enable you to work hand-in-hand with our product and research teams to design and develop scalable solutions and take them to market. The aim is to deliver advanced system engineering, standup, ETL, and implementation for the team’s studies. You will also be interfacing with our Google Cloud Platform team as a liaison with our product and research teams to enable high throughput dataflows.</p><p>There is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. We&#39;re constantly refining our signature search engine to provide better results, and developing offerings like Google Instant, Google Voice Search and Google Image Search to make it faster and more engaging. We&#39;re providing users around the world with great search results every day, but at Google, great just isn&#39;t good enough. We&#39;re just getting started.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4899519531778048",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:53:12.883Z",
    "publish_date": "2019-02-27T19:53:12.883Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in computer science or related technical field.</li>\n<li>15 years of work experience in a healthcare IT, academic medical center, Contract Research Organization (CRO), medical device, medical software or biopharmaceutical company.</li>\n<li>Expertise with LAMP (Linux/Apache/My/PL/SQL, Python/Perl), ODBC, JDBC, restful APIs, Authorization and Authentication. Experience with one or more programming languages such as Java, Python, Go, JavaScript, C++ or similar.</li>\n<li>Experience leading mission-critical system deployment pre and post-launch.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MA/BS degree preferred in Computer Science or related field.</li>\n<li>Experience working with a variety of technology systems, designing solutions, or developing applications in healthcare and/or life science environments.</li>\n<li>Understanding of current trends of healthcare and/or life sciences infrastructure (including databases, enterprise integration buses, protocols, APIs and formats), security, networking and cloud-based delivery models.</li>\n<li>Ability to certify in Google Cloud Platform, and specify new tools to enhance the enterprise tool chain.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide healthcare domain expertise in supporting the technical relationship with Google’s partners such as; product and solution roadmaps, proof-of-concept work, and the enablement of integrations allowing for a full deployment of products managing healthcare and/or life sciences data in Google Cloud.</li>\n<li>Recommend integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution using best practices. Work hands-on with partners to demonstrate and prototype product integrations in partner environments.</li>\n<li>Manage the technical relationship with Google’s partners, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources.</li>\n<li>Travel to partner sites, conferences and other related events up to 50% of the time as required.</li>\n</ul>",
    "title": "Health IT System Engineer, AI Healthcare"
}