{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbXuGyLXF7tEPBd3Qn8eY5l9nMZemY5KPKhiTR1yDUoSOgASYQ8wud9ryeH9sK-hIoNXYzeJnh30wcp5wYP1vtuyEXa5-5nfPfoZLM-GcSfMdoBWGbOHKsDdCI4%3D_V2&jobTitle=Business+Engagement+Lead%2C+Customer+Success&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-31T11:01:48.996Z",
    "description": "<p>The Cloud Business Transformation Organization is responsible for programs that enable Google Cloud to Go-to-Market, enterprise ready, at Google scale. Our team partners with Product, Sales, Engineering and other cross-functional partners to develop systems, tools, and processes. \n</p>\n\n<p>As a Business Engagement Lead you&#39;ll be responsible for the execution of a key workstream in an enterprise sized program focused on reimagining business processes and systems across the Google Cloud Sales Organization. The program is a 12 - 18 month (minimum) collaboration between the Google Cloud business, and IT teams, with a strong presence from systems implementation partners. \n</p>\n\n<p>You will work directly with Google Cloud Services and Support business, and leadership team to manage the key workstream and deliverables for the program. You&#39;ll also be responsible for leading the coordination of multiple teams, controlling and monitoring of the workstream timelines and deliverables, requirements gathering, measurement and the controlling of project within the workstream and managing stakeholders and project communication both within workstream and up to the program level.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82132027807015622",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-01T02:31:54.021Z",
    "publish_date": "2019-03-01T02:31:54.021Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>7 years experience working in management consulting, corporate strategy, or as a product/ program/portfolio manager, or equivalent practical experience</li>\n<li>Experience with SQL, data manipulation, reporting, and quantitative analysis.</li>\n<li>Experience in B2B customer support or services environment either as an operations contributor or directly in call center environments.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>ITIL and Six Sigma certifications.</li>\n<li>Experience working on systems-focused support strategy with a passion for technology and an ability to identify new opportunities for efficiency and productivity.</li>\n<li>Experience with Customer Relationship Management (CRM) systems.</li>\n<li>Demonstrated consultative skills as applied to technical problem solving, including good business understanding and the ability to develop consolidated understanding of requirements from multiple stakeholders.</li>\n<li>Excellent conflict resolution skills, with the ability resolve disagreements quickly and effectively.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Project manage the Customer Success work stream(s) effort independently while ensuring alignment to key program wide objectives, deliverables and milestones.</li>\n<li>Manage project and work stream dependencies and risks while optimizing for constraints. This includes monitoring the program status at workstream level and aggregating this into program management level dashboards and reports.</li>\n<li>Create weekly project status and executive reporting, lead regular workstream reviews with senior stakeholders from the business, technical and cross functional teams.</li>\n<li>Establish metrics, templates and governance for the program including KPIs, and track progress and dependencies.</li>\n<li>Create the workstream charter, developing project plan for this workstream, navigating/syndicating with key stakeholders for workshops, analyze and document business processes, unblocking/escalating to ensure weekly progress and track the weekly progress in a reporting chart with central project management.</li>\n</ul>",
    "title": "Business Engagement Lead, Customer Success"
}