{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYLPZTonGjcr4b64oPBh0iLh082rBZHjhR2RaQ9fP9ISOgCPMA3TC8biL-jl4RzGvXU7bncJJwK1hWpXPPQ5dFwpOHb3A5cqbIYByrPrwmqyS0df_92p9nTjSzo%3D_V2&jobTitle=UX+Program+Manager&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:48.436Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>User Experience (UX) Program Managers provide program management leadership and operational support throughout design organizations and across functional teams by increasing communication and connection points, streamlining the UX design process, and driving product excellence. \n</p>\n\n<p>You will coordinate the work of UX Designers, Researchers, Product Managers, and Engineers. In this role, you’ll combine expert project management skills with a passion for user experience to help your team improve the designs of products that are used by billions of users. You’ll work cross-functionally and collaborate with managers, designers and engineering teams to plan projects, define milestones, assign resources, assess risks, and help projects meet deadlines. \n</p>\n\n<p>As a UX Program Manager, you will also manage all project-related communications to team members, executives and other stakeholders. You are a master planner and a flexible project manager who can balance multiple projects.</p><p>Users come first at Google. Nowhere is this more important than on our Advertising &amp; Commerce team: we believe that ads and commercial information can be highly useful to our users if, and only if, that information is relevant to what our users wish to find or do. Advertisers worldwide use Google Ads to promote their products; publishers use AdSense to serve relevant ads on their website; and business around the world use our products (like Google Shopping, and Google Wallet) to support their online businesses and bring users into their offline stores. We build and maintain the platforms that have made Google what it is today, and are constantly innovating to deliver the most effective advertising and commerce opportunities of tomorrow.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5684744965783552",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T19:01:43.749Z",
    "publish_date": "2019-03-19T19:01:43.749Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of program management experience, with design teams or similar</li>\n<li>Experience establishing effective relationships, influence, driving consensus and collaborating internally and externally at all organizational levels.</li>\n<li>Experience with design, user research, and innovation processes and experience working with design, research, and engineering professionals.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Proven record of coordinating creative output.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with and support UX team leads in delivering the highest level of trust-building and strategic counsel through all project interactions.</li>\n<li>Act as a bridge between UX, Engineering, and Product Management (PM) teams, connecting all three groups and making sure interdependencies are understood and planned for.</li>\n<li>Identify team needs with regards to process, tools, documentation, and asset management, driving required changes to make sure designers are working at optimum efficiency.</li>\n<li>Lead or collaborate with UX team leadership in key project decision-making, including: requirements gathering, scheduling, resource allocation, and coordination of teams and approval processes.</li>\n<li>Orchestrate successful delivery for multiple projects simultaneously.</li>\n</ul>",
    "title": "UX Program Manager"
}