{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Kirkland, WA, USA; Seattle, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVpA4fWFXvPTiGFJ0hTnJwU8rIsP8NgRzQRXCi0QC2wSOACPMA3TtWdarFxeiVAWjeT1K3HmuAIxGlQj7JB9r2ADuslYsy_toqbiEbcciCFgpdoN5-EQoABD_V2&jobTitle=Software+Engineer%2C+Tools+and+Infrastructure&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:35:57.483Z",
    "description": "<p>A line of code can be many things - an amazing feature, a beautiful UI, a transformative algorithm. The faster this line of code reaches millions of users, the sooner it impacts their lives. As a Software Engineer, Tools and Infrastructure, you will be at the heart of Google’s engineering process building software that empowers engineering teams to develop and deliver high quality products quickly. We are focused on solving the hardest, most interesting challenges of developing software at scale without sacrificing stability, quality, velocity or code health.<br><br>We ensure Google&#39;s success by partnering with engineering teams and developing scalable tools and infrastructure that help engineers develop, test, debug and release software quickly. We impact thousands of Googlers and billions of users by increasing the pace of product development and ensuring our products are thoroughly tested. We are advocates for code health, testability, maintainability and best practices for development and testing.<br><br>Having access to all of Google&#39;s platforms and vast compute resources provides a unique opportunity to grow as an engineer. We typically work in small, nimble teams that collaborate on common problems across products and focus areas. As a result, the exposure to this broad set of problems provides diverse technical challenges as well as accelerated career growth.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4831833822003200",
    "location": {
        "address_lines": [
            "Seattle, WA, USA"
        ],
        "city": "Seattle",
        "country": "WA",
        "country_code": "US",
        "display": "Seattle, WA, USA",
        "lat": 47.6062095,
        "lon": -122.3320708
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=1168x324&zoom=12&signature=ps_sPvgcgFUcz72GpSwau1rebxc=",
        "large_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=1024x324&zoom=12&signature=LGHj2cxqA3QhLZJTwZmYSkwFGho=",
        "small_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=600x400&zoom=12&signature=D1jnhP7KcjQ4mOvW3HCzt_s7wc8=",
        "small_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=600x400&zoom=12&signature=LHlLQ_7VV0axWi1ctKvQwOcu_UM="
    },
    "modified": "2019-02-27T19:38:40.914Z",
    "publish_date": "2019-02-27T19:38:40.914Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS in Computer Science or related technical field or equivalent practical experience</li>\n<li>Software development experience in one or more general purpose programming languages</li>\n<li>Experience in at least one of the following: test automation, refactoring code, test-driven development, build infrastructure, optimizing software, debugging, building tools and testing frameworks</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s or PhD in Computer Science or related technical field</li>\n<li>Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or Go</li>\n<li>Scripting skills in Python, Perl, Shell or another common language</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead/contribute to engineering efforts from design to implementation, solving complex technical challenges around developer and engineering productivity and velocity</li>\n<li>Design and build advanced automated build, test and release infrastructure</li>\n<li>Drive adoption of best practices in code health, testing, and maintainability</li>\n<li>Analyze and decompose complex software systems and collaborate with cross-functional teams to influence design for testability</li>\n</ul>",
    "title": "Software Engineer, Tools and Infrastructure"
}