{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Sunnyvale, CA, USA; Kirkland, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYI1ukSADu4hLirzQwzhi_kPYkqA6-N1YdsM20OkcFsSOgASYQ8w4cobRsdiXBuO791rlbabzeoRJUqh-ZkqivXUSDd36QzwiYFG8rtehT2MUcW0PRPngw9-a5Q%3D_V2&jobTitle=Technical+Solutions+Engineer%2C+Cloud+Support+Production&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T17:01:57.934Z",
    "description": "<p>The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You swiftly problem-solve technical issues for customers to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Google Cloud business and in bringing our product portfolio into companies around the world.</p>\n\n\n<p>In this role, you will work closely with Engineering, Site Reliability, and Deployment teams to improve the critical tools and support process that enable Google Support Engineers and customers success. Applying your in-depth technical experience, you will develop a deep understanding of, and drive enhancements for, Google’s tooling architecture. You will build and implement a global service and tooling platform to ensure stability, reusability, testing, compliance and overall reliability.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/127942255152374470",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-03-12T17:01:57.934Z",
    "publish_date": "2019-03-12T17:01:57.934Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field involving coding (e.g., Physics or Mathematics), or equivalent practical experience.</li>\n<li>Industry experience in technical support, professional services, engineering, or systems engineering.</li>\n<li>Experience in network administration.</li>\n<li>Experience with developing and maintaining web-based applications.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Hands-on experience implementing, troubleshooting, and supporting Internet-based applications, and Linux/Unix operating systems.</li>\n<li>Experience with managing hosted services/SaaS. Familiarity with programming/scripting.</li>\n<li>Demonstrated network administration and troubleshooting skills with understanding of Linux/Unix system administration.</li>\n<li>Familiar with reliability analysis and metrics.</li>\n<li>Ability to keep pace with rapid changes in enterprise products.</li>\n<li>Excellent troubleshooting, follow-through and problem solving skills, resourcefulness, attention to detail, and communication skills, both verbal and written.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead efforts within Google Cloud Support, focusing on production maintenance of our Support internal tooling solutions and platforms.</li>\n<li>Apply Google best practices to define on-boarding requirements for monitoring, alerting, and measuring uptime.</li>\n<li>Lead and execute the creation of on-call best practices, playbooks, and procedures.</li>\n<li>Ensure proper documentation processes are followed after incidents, and execute critical reliability improvement tasks with the on-call team of solutions engineers.</li>\n<li>Work with Cloud support stakeholders to ensure that on-call shifts are staffed, along with collecting regular inputs and feedback from support engineers for further improvement actions. Demonstrate leadership as the primary contact for this effort.</li>\n</ul>",
    "title": "Technical Solutions Engineer, Cloud Support Production"
}