{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSjwfWdvmMHRdG2dKcLM6zU9-fvKsLwB8rvbtoEqEYUSOgCPMA3TxBluGOylUqx7FQCSjZpPhZDeKbGr0tXJEjis25E_YcB1IEQYdZT7jNgSn86oF42a58TxXfg%3D_V2&jobTitle=Program+Manager%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-10T15:02:02.392Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Program Manager in the Search team within Trust and Safety, you will work with cutting-edge technologies in order to keep users safe and improve the quality of Google&#39;s Search results. As part of this team, you will develop and manage cross-functional relationships with Engineering, Product, Legal, Sales, and Operations teams in a multifaceted effort to improve our processes for identifying and resolving policy and quality issues. You will be responsible for analyzing market trends, setting forward-looking strategy, and implementing scaled solutions to user safety and quality issues, ensuring a high-quality user experience across Search products.\n</p>\n\n<p>Google&#39;s brand is only as strong as our users&#39; trust--and their steadfast belief that our guiding principles are what&#39;s best for them. Our Trust and Safety team has the critical responsibility of protecting Google&#39;s users by ensuring online safety by fighting web abuse and fraud across Google products like Search, Maps, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic leader. You understand the user&#39;s point of view and are passionate about using your combined technical and customer service experience to protect our users. You will work globally and cross-functionally with Google developers and Product Managers to navigate challenging online safety situations and handle abuse and fraud cases quickly.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4719973741559808",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-05T14:31:49.008Z",
    "publish_date": "2019-03-05T14:31:49.008Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical or business field or equivalent practical experience</li>\n<li>3 years of program management experience</li>\n<li>3 years of trust and safety experience</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in one or more of the following areas: Coding (e.g., C/C++, Python, Java), databases and querying (e.g., SQL, MySQL, MapReduce, Hadoop), front-end development (e.g., HTML, JavaScript, CSS), statistical analysis (e.g., R, Stata, SPSS, SAS)</li>\n<li>Experience leading cross-functional projects across organizational boundaries with excellent stakeholder management skills</li>\n<li>Knowledge in Internet, web-research, online advertising, fraud detection, numerical analysis, search engine optimization, and e-commerce</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage multiple interdependent projects of moderate to high complexity and scope.</li>\n<li>Scope, define, and manage relevant workstreams in Trust and Safety across regions and teams.</li>\n<li>Set annual and quarterly goals and track ongoing progress, keeping a close eye on stakeholder needs and dependencies.</li>\n<li>Use technical judgment to drive project delivery, challenge proposals, and identify risks.</li>\n<li>Build effective cross-functional partnerships with Product, Policy, and Engineering teams to understand direction and make sure execution matches.</li>\n</ul>",
    "title": "Program Manager, Trust and Safety"
}