{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXW_le5mhJ2rSo0c7-y73i0KtwolMUJU7FivYlFXKI0SOgCPMA3TPqcru7ycjYdIOMTMfboydHztI7liEQ4NrTcfhweQhfyoEqIpOPEskNbRPkZZPsy8kd5o3b0%3D_V2&jobTitle=Supply+Planning+Program+Manager%2C+Infrastructure+Supply+Chain+Operations&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-26T18:31:46.673Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Supply Planning Program Manager, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Google&#39;s global infrastructure supply chain is at the core of preparing for continued growth. We focus on forecasting, planning, and integrating the latest technologies into the delivery of our data centers, networks, and servers across Google’s production environment. Our team works closely with partners worldwide to support the growth of Google&#39;s products and services and to provide infrastructure for the company.\n</p>\n\n<p>As a Supply Planning Program Manager, you&#39;ll lead projects related to material/supply planning, supply-demand matching, inventory management, and procurement. In this hands-on role, you will be responsible for developing and executing supply and inventory plans that will enable Google&#39;s technical infrastructure and our customers to meet objectives related to data center, networking, and server delivery. You&#39;ll work closely with demand planners, supply chain managers, engineering and supplier partners to implement processes and systems that directly support Google’s growing hardware infrastructure.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4675049805905920",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:50:55.396Z",
    "publish_date": "2019-02-27T19:42:33.290Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business Administration, Economics, Industrial Engineering or Operations Research or equivalent practical experience.</li>\n<li>6 years of work experience in the tech and/or consulting industry related to supply chain operations/manufacturing.</li>\n<li>2 years of experience with project management and experience handling daily activities to drive deliverables.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or MBA in Business Administration, Economics, Industrial Engineering or Operations Research.</li>\n<li>Experience leading cross-functional process improvements.</li>\n<li>Experience in management consulting with tech clients.</li>\n<li>Ability to collaborate and influence across multiple levels of an organization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish the supply plan to position material supplies to address different demand scenarios while meeting the financial objectives of the business.</li>\n<li>Develop short- and long-term supply and demand models that seek to minimize total costs and inventories while maintaining service levels to partners and customers worldwide.\nDevelop and justify inventory buffer strategies that optimize cost and flexibility.</li>\n<li>Drive cross-functional projects to implement new capabilities and improve existing ones across the organization.</li>\n<li>Establish and utilize methods (statistical models and software tools) in creating plans and respective inventory targets.</li>\n<li>Prepare, communicate and action success metrics. Drive plan approvals by management.</li>\n</ul>",
    "title": "Supply Planning Program Manager, Infrastructure Supply Chain Operations"
}