{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVZeexEMGckS6KBzOK2SwChgjizNricsWcxfwnvHu2cSOgCPMA3TiCAbk2yDbfu0R7S6U_YFQKZn0C3Sih7rW3uO_1hH8onwU0mttAzTttio-b2eP5H2JXbiAWg%3D_V2&jobTitle=UX+Director%2C+G+Suite&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:06.531Z",
    "description": "<p>G Suite seeks to give every team and person in the world the tools they need to do their best work. For G Suite to work well in large enterprises, we have to ensure our products are trusted, safe and secure and truly transform the workplace through collaborative and assistive (AI) capabilities. The Enterprise Core is the platform on which the G Suite sits, empowering businesses to maximize their use of the suite’s capabilities. </p>\n\n<p>As the UX Director for Enterprise Core Apps within G Suite, you will report to the VP of Apps UX and partner with Product and Engineering teams to develop amazing enterprise experiences. You will help define and drive the future of Google design and identify and set product strategy, envision UX ecosystems and inspire teams to push the boundaries of what is possible. You will set a vision of the future of user experience and have the courage to pursue forward-thinking design.\n</p>\n\n<p>In this role, you will help drive the future of the G Suite and Google Cloud, in close partnership with executives in Apps and Cloud UX, Product Management and Engineering. This is a global leadership role with a distributed team in Sunnyvale, Zurich, Bangalore and Stockholm. You will be an exceptional organizational lead, driving collaboration, transparency and clarity between multiple offices, teams and functions, while fostering a culture of user-centric design. You will lead with excellent communication skills, be astute at deciphering the nuances of technically complex problems and articulating and advocating UX viewpoints. Additionally, you will create simple, elegant solutions for complex, data-rich workflows with a sensibility for product design. You will also apply your passion for excellent user experiences to guide research and design processes, develop and grow talented members of your team and fully enable your teams to create the best possible experiences across all of G Suite.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5952409698500608",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:43:15.924Z",
    "publish_date": "2019-02-27T19:43:15.924Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Design, Human Computer Interaction, Interaction Design or equivalent practical experience.</li>\n<li>12 years of experience creating strategy and designing products in an C-level role.</li>\n<li>Experience contributing to the creation of new products.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience working collaboratively with skilled designers and executives in product management and engineering.</li><li>Distinctive UX portfolio, demonstrating leadership, innovation, problem solving and simple product solutions.</li><li>Excellent communication skills with the ability to listen, articulate positions and advocate designs.</li></ul>",
    "responsibilities": "<ul>\n<li>Drive a compelling product vision for the Enterprise Core team, working with Product Management, Engineering and cross-functional UX teams. Lead all phases of UX design including distilling research, design ideation, prototyping, final spec design and implementation.</li>\n<li>Contribute to strategic roadmaps with cross-functional leadership and manage multiple complex schedules to on-time delivery. Engage, build and grow an skilled design team.</li>\n<li>Provide leadership, direction and mentorship across a multi-disciplinary organization of interaction designers, visual designers, prototypers, writers, motion designers and program managers.</li>\n<li>Build effective relationships and operating rhythms with leaders inside and outside of Enterprise Core to drive user experiences that are cohesive, inclusive and well-informed. Foster Google’s culture and product quality principles within the group while setting new standards in executional excellence.</li>\n<li>Advocate for users in a creative, fast-paced environment, imparting day-to-day design leadership that fosters a shared understanding of the user-centric intersection between design, content, business and engineering.</li>\n</ul>",
    "title": "UX Director, G Suite"
}