{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRvJagNw3nCgpfYEu7Iyaon25svrhSd82Y3oaRIPhBISOgCPMA3TmqQFO_xRdHRg5egkLJtM9P2Klyek73D0FCcLoapvs3J5I3txJ54WYOIxLTygiCj4eubeuNM%3D_V2&jobTitle=Enterprise+Network+Security+Architect&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:22.240Z",
    "description": "<p>Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google&#39;s complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.<br><br>You encourage safe and efficient network operations by leading project teams that maintain and improve network operations. You propose projects that increase network reliability and analyze network technologies that assess implications for Google.</p><p>As Network Security Technology Architect, you&#39;ll be a key player in the security roadmap and consulting efforts that address Google&#39;s needs for network communications and connectivity.</p><p>Your focus will be on the long view and challenges, including integration of enterprise networking with cloud-based services, network segmentation, mobility in access networks, and a host of others. You&#39;ll have the opportunity to work with a wide variety of other teams beyond corporate network engineering, including security operations, systems engineering, hardware operations, backbone network engineering, and many others. </p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4768473467256832",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:40:34.470Z",
    "publish_date": "2019-02-27T19:40:34.470Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>MS degree in Mathematics, Statistics, Computer Science or Engineering or equivalent practical experience.</li><li>Experience with one or more of the following programming languages: Java, C/C++ and/or Python.</li></ul><br><p>Preferred qualifications:</p><ul><li>CISSP or similar industry security certification.</li><li>7 years of experience with network and application security architecture, with a demonstrated bias to early action and cutting edge technology.</li><li>Experience with security design for multi-service enterprises (e.g. Wi-Fi networks with multiple classes of users).</li><li>Understanding of IETF security protocol landscape and development practices.</li></ul>",
    "responsibilities": "<ul><li>Ensure that the Google enterprise network is secure.</li><li>Define and document a 3-5 year security technology vision for the Google enterprise network.</li><li>Participate in leading and defining security practices for enterprise networks consuming cloud services using systematic approach to security and anticipation of threat vectors.</li><li>Lead initiatives to ensure that the technology vision is realized including developing advance detection and monitoring capabilities for incident management, response planning and reaction to events.</li><li>Work with software engineers to develop network security related software. Use machine learning or advanced techniques to identify security risks.</li></ul>",
    "title": "Enterprise Network Security Architect"
}