{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVJmZR1pchGFrpWNLVrg6DQ2BgSuwNxivluHQ0RDN7YSOgCPMA3Ta_c5Y5pyOMbBMfDOzgiO4or8rp0DNfreuPLSVJ4CBmUvrMLrsejkXvI_TsNEPI-ehb5HJNk%3D_V2&jobTitle=Global+Workforce+Manager%2C+Outsourcing+Solutions+and+Vendor+Programs&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-09T23:01:41.203Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>The Engineering Support team in Google Cloud helps customers solve technical problems with a focus on them. We engage customers across the globe through online communities, social outreach, and 1:1 support. Our team is the face of Google to many customers, and we want their Google support experience to redefine support and reset the standards, just like Google’s products do, with an innovative approach to support. The Outsourcing Solutions and Vendor Programs team’s mission is to scale and simplify our operation to satisfy business needs by creating customer-focused solutions, while inspiring and enabling others to do the same. We’re focused and committed to evolving the way we outsource work to scale Engineering support to meet our customer’s demands. \n</p>\n\n<p>As a workforce program manager, you will lead and manage the process by which we ensure the right case goes to the right person every time. You will lead staffing, growth, and productivity conversations globally with vendor program managers and team managers. Your projects and impact often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5632180409008128",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T21:29:41.109Z",
    "publish_date": "2019-02-27T19:54:13.227Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in vendor management and/or global program management.</li>\n<li>2 years of experience in support or customer facing operations.</li>\n<li>Experience generating and analyzing analytical reports around operations, capacity planning, and/or scheduling.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree, or PhD.</li>\n<li>Experience in a consulting organization in technology practice.</li>\n<li>Experience setting up, managing, and optimizing staffing and resourcing in a globally outsourced workforce.</li>\n<li>Ability to comfortably work with large data sets and data modeling. Ability to take initiative and adapt quickly in a fast-paced, fast-changing, and collaborative environment.</li>\n<li>Ability to influence without direct authority and drive change at all levels within an organization.</li>\n<li>Excellent analytical, communication, and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop an understanding of Engineering Support’s business and workforce strategies, and combine that knowledge with an understanding of industry standards to develop and deliver on workforce key performance indicators (KPIs).</li>\n<li>Develop strategy, system, and infrastructure to manage global support queues across multiple channels and ensure optimal customer experience and operational efficiency for both outsourced and Googler support operations.</li>\n<li>Provide analytical support including capacity planning, scheduling, reporting, and trend analyses to drive decisions made in partnership with global vendor managers and technical leads. Provide insights to leadership to increase the percent of work outsourced within Engineering Support.</li>\n<li>Identify issues and shortcomings in the quality of data, and play a key role in the design and execution of initiatives to improve data quality in partnership with the Data Analytics team.</li>\n<li>Collaborate on the development and execution of the Engineering Support vendor management and outsourcing strategy, including cost and location strategy.</li>\n</ul>",
    "title": "Global Workforce Manager, Outsourcing Solutions and Vendor Programs"
}