{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdtVk_SnpBVLHT3pZfJzqBQQ5UFwumBG3iNECSqLeyoSOgASYQ8wPX7OEpkm9xgdSKYs7hAf8oUIY2b2Xd4mNZ3pU1vQJtduO11zaOBKno0u-79ay1zx70r_vgM%3D_V2&jobTitle=Analytical+Lead%2C+Telecom&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-13T16:02:13.560Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>Google’s sales teams work with a wide range of partners to power our business. As an Analytical Lead, you&#39;ll be a strategic analyst, advisor and consultant, providing data-supported insights to clients and agencies to help improve our business. You will partner with Account Managers and Account Executives to build and present integrated business and media opportunities based on industry trends and insights from data. You have demonstrated analytical expertise, attested business ability and are dedicated to solving complex business challenges.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/104907756059665094",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-13T16:02:13.560Z",
    "publish_date": "2019-03-13T16:02:13.560Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience in media analytics, advertising sales, digital media and marketing, consulting and/or financial analysis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience using search engine marketing (Google Ads), website analytics platforms (Google Analytics and other measurement suite products) and brand analysis techniques (upper funnel analysis).</li>\n<li>Experience using SQL or other programming/scripting languages, such as R, Python or C++, to extract and manipulate data.</li>\n<li>Demonstrated experience with spreadsheet software and presentation applications.</li>\n<li>Demonstrated analytical experience with marketing analytics, return on investment/financial modeling and statistical analysis.</li>\n<li>Ability to analyze large datasets and translate them to a few actionable insights.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop solutions for client business and marketing challenges while also uncovering opportunities. Collaborate with Sales and Sales Operations to innovate and develop scalable solutions cross industry challenges.</li>\n<li>Act as an industry advocate and analyst to surface key industry trends. Consult with clients on opportunities associated with trends and potential business impact.</li>\n<li>Advise client partners on methodologies for marketing and media analytics, measurement and attribution. Help customers navigate industry standards and alternatives.</li>\n<li>Identify key decision makers, challenge the status quo and influence decisions. Foster client relationships with others in the organization including marketing/advertising, analytics and corporate strategy.</li>\n<li>Partner with internal and external product, research, data and measurement teams to bring full analytical capabilities to customers.</li>\n</ul>",
    "title": "Analytical Lead, Telecom"
}