{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSnWvL0wDn5hELCX6MXKooEEa0S_ErJRn27QRvVR95ESOgCPMA3TJW9uluppHnMJ-h4J_vYiOT25_NjQj9GiQ2kE_MpTl7TRox0l6wfpEWBRFNtDgSsIBeQU1II%3D_V2&jobTitle=Project+Manager%2C+Real+Estate+Development&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:28.053Z",
    "description": "<p>In this role you will be a Project Manager on Google’s Real Estate Development team (DevCo), which leads the design and construction supervision of our offices. You will assist in managing the spatial requirements for our workforce, while maintaining Google&#39;s high standards for long-term sustainability and care for our world’s resources. You will also assist in the strategic planning, financial analysis/administration and the design and construction of our corporate offices.</p><p>Developing innovative products and services that improve the lives of as many people as possible has been core to Google from the beginning. The Real Estate Investment and Development team is focused on creating inspiring places that enable Google, our employees and communities to thrive. Through thoughtful collaborations and transformational investments, we’re on the front lines of facilitating the next wave of Google’s ground-up developments that embody our culture and inspire a new way of developing places. As an in-house development group, our team’s diversified real estate expertise spans asset and portfolio management, transactions, urban planning and design, entitlements, construction management and district infrastructure.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5414236056649728",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:45:53.585Z",
    "publish_date": "2019-02-27T19:45:53.585Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Engineering, Architecture, Real Estate, related field or equivalent practical experience.</li>\n<li>5 years of experience within the real estate and construction industry.</li>\n<li>5 years of experience in land use and development</li>\n<li>Experience in conceptualizing, project planning, design development and project management of corporate real estate assets. Direct corporate design/construction project management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree.</li>\n<li>LEED Accredited Professional.</li>\n<li>Experience in a high-tech, fast-paced environment.</li>\n<li>Ability to produce and deliver executive presentations, project status reports and communicate deliverables to all stakeholders and senior management.</li>\n<li>Ability to translate ideas and capabilities into effective initiatives.</li>\n<li>Excellent leadership and strategic skills in prioritizing evolving initiatives.</li>\n</ul>",
    "responsibilities": "<ul><li>Support development executives as an essential part of a small team leading large-scale development projects. Demonstrate the capacity for leadership and professional growth on the project and within DevCo, showing the ability to take on additional responsibilities and project leadership over time.</li><li>Assist in managing the strategy, execution and innovation of delivery of Google’s development projects while coordinating internal and external team project management, cost and schedule management and information management.</li><li>Help develop project charters for each development project, clearly articulating the project vision, base building requirements, performance metrics, design principles, workplace objectives, budgets, schedules and all other desired outcomes.</li><li>Manage and coordinate regular team meetings throughout pre-development period, development and construction time frames.</li><li>Support and manage internal communication and collaboration across DevCo and other Google stakeholders, through small working sessions, larger design workshops, senior leadership design reviews and weekly team coordination.</li></ul>",
    "title": "Project Manager, Real Estate Development"
}