{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVbeJeBO-bLMg3ksBZg92pBk7h2eYHtHArRtcTnmirQSOgASYQ8wiFpOc0gpzcBBdSZqT5yxvvZkIRdrwhr3P1tVFJZpcFEsncrcJSXM951U3gyB4lMAU6E7GfY%3D_V2&jobTitle=Head+of+Gaming+Creators%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-28T15:31:53.122Z",
    "description": "<p>YouTube works with video content producers to develop their online video businesses by combining their content creation and management experience with the audience, growth, and analytics prowess of YouTube’s distribution platform.</p>\n\n\n<p>As the Head of Gaming Creators in the Americas, you will be an effective communicator, thought leader, and innovator within the gaming industry with effective relationships amongst the top gamers, gaming publishers, gaming broadcasters, and gaming news/editorial companies. You will lead a team of strategic partner in building relationships with industry constituents, acquiring content partners, devising creative agreement structures, and managing the day-to-day account activities of our top Gaming Creators. Your in-depth knowledge of the industry, YouTube features and products, and competitive landscape will allow you to develop cross-functional strategic initiatives that result in growth for Gaming Content. \n</p>\n\n\n<p>In this role, you will rely on your experience with Google&#39;s products and our partners&#39; businesses to identify new opportunities for their growth, launch new products, and expand the impact of our clients&#39; work. You will represent our users, products, and programs and work effectively with Googlers and our partners, demonstrating excellent relationship-building skills.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/130500959101952710",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-07T20:01:57.989Z",
    "publish_date": "2019-03-07T20:01:57.989Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience in partner/account management within the video, media, or entertainment industry, with a core focus in the gaming space.</li>\n<li>3 years of experience in people management.</li>\n<li>Experience in business development with media or Internet agreements.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in YouTube content creation and management.</li><li>Ability to work with publishers and maintain business relationships.</li>\n<li>Passionate about and actively involved in the gaming space (e.g., using interactive features of games and game streaming).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide leadership to a group of partnership managers acquiring and managing content partners in all content categories. Innovate in a fast-paced environment, articulate a vision, and lead the team in implementing it.</li>\n<li>Provide insight, understanding, and leadership in order for the company to maximize the potential for its current and future product/service offerings.</li>\n<li>Negotiate agreements and manage the internal implementation of those agreements by coordinating the operations of Product Management, Legal, and the Business Development team.</li>\n<li>Establish and drive relationships within YouTube’s cross-functional Product Management, Engineering, Legal, Ad Sales, and Marketing organizations, with the goal of driving business growth and content catalog for the Partnerships team.</li>\n<li>Develop, plan, and implement projects and initiatives to enhance overall gaming creator experience.</li>\n</ul>",
    "title": "Head of Gaming Creators, YouTube"
}