{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Seattle, WA, USA; New York, NY, USA; Mountain View, CA, USA; Boulder, CO, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRYbl45HQbS-YOm3NjAYrSbYx8IaloWnPMu_1VeJF2ASOgCPMA3TDgGgzwV_lvNpYEesymHidzII-4h9o7Eh2yrZdE55qik1wUXG_Rzt3ekUquzU5lmVbXvmXnM%3D_V2&jobTitle=UX+Design+Manager&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:45:53.630Z",
    "description": "<p>As a User Experience (UX) leader, you help define and drive the future of Google design. You identify and set product strategy, envision complex UX ecosystems and inspire teams to push the boundaries of what’s possible. You possess a clear vision of the future of user experience and have the courage to pursue forward-thinking design.<br><br>In this role, you will apply your passion for brand, craft, and design fidelity to guide research and design processes, mentor talented members of your team, and collaborate with leaders of other UX and Engineering teams to create innovative experiences across all of Google’s products.</p>\n\n<p>You are a great design team leader, manager, systems-level design thinker, and visionary - with strong instincts and outstanding intuition - who will provide leadership and direction for a team of designers. Our ideal candidate has an uncanny sense for clean design, is a fierce advocate for the user, and is committed to creating elegantly simple user experiences from otherwise complex workflows. You also take the time to understand not just the execution side of design, but the business aspects of the products as well.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6550567876624384",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:39:15.229Z",
    "publish_date": "2019-02-27T19:39:15.229Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>12 years of experience in UX Design.</li>\n<li>3 years of experience managing or leading design teams.</li>\n<li>Portfolio of UX-focused work samples for web and mobile applications.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Effectiveness in working across organizational boundaries to define, manage, and prioritize work.</li>\n<li>Excellent communication, presentation, interpersonal, and analytical skills; the ability to communicate complex interaction concepts clearly and persuasively across different audiences and varying levels of the organization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide leadership, direction, and mentorship for a team of UX Designers; lead creative and holistic thinking across diverse product releases, platforms, and devices.</li>\n<li>Deliver a UX vision, along with a plan for evolutionary, iterative updates, that actualize the larger vision over time.</li>\n<li>Build strong relationships and operating rhythms with leaders inside and outside their core product team to efficiently implement user experiences that are cohesive, inclusive, and well-informed.</li>\n<li>Foster Google’s culture and principles within the group, while setting new standards in executional and operational excellence.</li>\n<li>Be responsible for and effectively advocate for users in a fast-paced, corporate climate, imparting day-to-day design leadership that fosters a shared understanding of the user-centric intersection between design, content, business, and engineering.</li>\n</ul>",
    "title": "UX Design Manager"
}