{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckToYnwCwp8oRUnT_eVMNZseBj4q9-jUsBz7r22EMv38SOgCPMA3T6fAYEO_3ITccBORNWc_R4X8SdDnBxnhSW2vxzhEhj73Sv3tPI2R2E-g-Sm20OSOG0DE69DE%3D_V2&jobTitle=Director+of+Treasury+Accounting&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-16T19:01:46.490Z",
    "description": "<p>As the Controller of Treasury Accounting, you will be responsible for all aspects of treasury accounting and reporting. You will be responsible for establishing a vision for Treasury Accounting and leading the organization in execution.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6120928483147776",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:21.237Z",
    "publish_date": "2019-02-27T19:54:21.237Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>CPA, CA or other professional accounting accreditation.</li>\n<li>15 years of experience in public accounting and industry with experience for financial instruments.</li>\n<li>8 years of people management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in a multinational company with complex foreign currency and interest rate hedging transactions.</li>\n<li>Technical and hands on expertise with financial instrument related accounting standards (e.g. ASC 815, ASC 820, ASC 860, ASC 320 and ASC 321).</li>\n<li>Strategic thinker with the ability to take initiative and adapt quickly to changing priorities through excellent decision-making, problem-solving, and analytical skills.</li>\n<li>Excellent leadership skills.</li>\n<li>Highly collaborative, excellent communication and interpersonal skills with the ability to effectively manage multiple complex cross functional projects simultaneously.</li>\n<li>Organized and thorough with the desire for continuous improvement.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead treasury accounting function with clear insights and build strategic partnerships with business partners. Oversee all aspects of treasury accounting functions including month end close process, SOX compliance, deal due diligence, technical accounting and new accounting standard and system implementations.</li>\n<li>Provide end-to-end support to key stakeholders and manage cross-functional teams (Treasury, Tax, Operating Accounting Teams, External Reporting, etc.).</li>\n<li>Drive professional development of your team members by providing opportunities and real time coaching on how to effectively manage and support business partners and enable them to excel in a high performing global Finance organization.</li>\n<li>Establish a long term vision for the treasury accounting team, develop priorities, allocate resources and execute to deliver on the vision. Be a Thought Leader and partner with treasury on future changes in the business, industry or regulation with potential accounting and financial reporting impact and proactively managing change throughout the organization and with senior leadership.</li>\n<li>Ensure controls over treasury accounting process are appropriately designed and operating effectively. Drive process operational effectiveness and efficiency in process, including automation of process.</li>\n</ul>",
    "title": "Director of Treasury Accounting"
}