{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQZg1_ZAKgMH5m2tnFWQAQl6H1QTM7gMdjOEKPUV_nsSOgASYQ8woGqzEDMBcs49rC4fUTriJdkti_Ah_y4EE1HLfLAQ6Vu6PGaZx85rhJILeEXZu3dp-aUDc-Y%3D_V2&jobTitle=Data+Center+Controls+Engineer%2C+Electrical&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T22:01:40.793Z",
    "description": "<p>Our thirst for technology is a part of everything we do. The Data Center Engineering team takes the physical design of our data centers into the future. Our lab mirrors a research and development department -- cutting-edge strategies are born, tested and tested again. Along with a team of great minds, you take on complex topics like how we use power or how to run state-of-the-art, environmentally-friendly facilities. You&#39;re a visionary who optimizes for efficiencies and never stops seeking improvements -- even small changes that can make a huge impact. You generate ideas, communicate recommendations to senior-level executives and drive implementation alongside facilities technicians.</p>\n\n\n<p>As a Data Center Controls Engineer, you will assist in design, specification, and definition of requirements as part of the Global Controls Engineering team. Project scopes will include solution definition per requirements, system design, and working with system integrator partners to implement and test these solutions across one or more locations. You will participate in the design and specification, establishment and maintenance of global standards and provide consulting, training, and global support to data center operations. \n</p>\n\n\n<p>In this role, you will have a working knowledge of various systems and equipment including protective relays, breaker trip units, network switches, data concentrators, HMI software packages, power quality meters, and Modbus and 61850 GOOSE/MMS protocols, switchgear, generators, UPS, digital and analog controls and feedback devices, PLC and HMI/SCADA. You will use your technical experience to ensure compliance with codes and standards, develop infrastructure improvements, and serve as an expert in protection, networking, and/or electrical. In addition to responding to and resolving complex system service outages and operational failures, you will also be responsible for leading the framing, planning, and design of large scale/complex projects.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142493969289224902",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:22.763Z",
    "publish_date": "2019-02-27T19:49:22.763Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>7 years of experience as a controls engineer working within project leadership roles in a critical/construction/high tech environment, data centers, or large utility industries.</li>\n<li>Experience in control systems design, network design, system administration, and security.</li>\n<li>Experience with electrical control systems, including relaying, PLCs, HMIs, instrumentation/metrology, and field bus protocols.</li>\n<li>Ability to travel nationally and internationally up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in facility electrical infrastructure control systems for data centers, including PLCs, Digital Relays, IEC 61850 protocols, SCADA systems, historians, industrial automation, and power monitoring.</li>\n<li>Experience in the compliance requirements of pertinent codes, regulations, and standards.</li>\n<li>Knowledge of meters, devices, sensors, and troubleshooting utilizing standard hand tools and diagnostic equipment.</li>\n<li>Understanding of industry standard electrical systems used in a data center environment and controls/monitoring systems.</li>\n<li>Ability to communicate effectively with contractors, engineers, operations, and global/site management to address issues, deliver projects, and roll out standards and trainings.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Represent the Controls team in multidisciplinary design efforts including significantly influencing and contributing to development or modification of control system practices and processes used by all facilities.</li>\n<li>Participate in project teams responsible for definition of the owner’s program requirements (OPR); and in the technical implementation of the global controls/monitoring skills enhancement program (training) for all assigned Data Center Operations (DCOps) systems.</li>\n<li>Provide technical consultancy and lead global standards for complex controls system programming, commissioning, documentation, turn-up, and facilities turnover.</li>\n<li>Lead local technical and commissioning teams in the performance of innovative project rollouts of control/monitoring systems, design improvements, analysis, and end-to-end testing.</li>\n<li>Independently lead complex troubleshooting and emergency situations at a datacenter and across sites for controls/monitoring domain of expertise. Maintain and manage changes to all controls and monitoring system design requirements and interface documents, including network design, in order to meet stringent security requirements while ensuring highly available systems.</li>\n</ul>",
    "title": "Data Center Controls Engineer, Electrical"
}