{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQtZmIgpDmyUmCuMCpS3j4EcvGoz7e-VIS_KfKVSFvcSOgASYQ8wnflxu6vIT8XptWE4dnSRGfHx4H6uSx7uZMXamz_dw9fzlCW9UxEZ3tdafokEYEO8CfENzcM%3D_V2&jobTitle=Trust+and+Safety+Engineer&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-13T03:31:52.591Z",
    "description": "<p>We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, with an eye for industry-wide solutions. As a Software Engineer at Trust and Safety, you will innovate and develop software-based solutions for complex business problems. With an interest in automation, scalable solutions, and data insights and a passion for developing systems that prevent spam and abuse at scale, you will pursue the highest quality and safety standards for users across Google products and make the Internet a better place for everyone</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/89521994573193926",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T18:31:45.695Z",
    "publish_date": "2019-03-18T18:31:45.695Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Math, Statistics, related technical field, or equivalent experience</li><li>Software development experience in one or more programming languages: C/C++, Java, JavaScript, or Python.</li>\n<li>Experience designing, implementing, testing, and maintaining web applications or subsystems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in web UI development with HTML, JavaScript, TypeScript, CSS, and front-end design frameworks, e.g., Angular, Polymer, or Wiz.</li>\n<li>Experience in one or more of the following: Unix/Linux, relational/non-relational databases, mobile application development, API development, data pipelines.</li>\n<li>Experience programming in Java, C/C++, JavaScript, Python, and Go.</li>\n<li>Familiarity with Computer Science concepts, with strong competencies in numerical analysis, data structures, algorithms, end-to-end application development, system integration, and software design optimized for large-scale distributed software systems.</li>\n<li>Strong project management and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design and implement technical solutions to solve critical business problems, often with automation, including rapid development and prototyping of internal tools, front-end and back-end services, and web applications.</li>\n<li>Own and drive complex technical projects from the planning stage through to execution, including task breakdown, coding, testing, ongoing support and maintenance.</li>\n<li>Collaborate with Operations Analysts to detect and prevent spam, fraud, and abuse trends, advocate changes to protect Google’s customers and users, and increase efficiency through automation, workflow streamlining, and system optimization.</li>\n<li>Write and review technical documents, including design, development, and collaborative code reviews.</li>\n</ul>",
    "title": "Trust and Safety Engineer"
}