{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTyqF5qu06v8Ry2TjdEh1-VFHqK_5OqKNDKbrWsIhMoSOgCPMA3TI8oaRYoIiYIlFvRNkpwRNd5-IURZfyWyJrvUdJWDXKlPY9W9hzs8j0Kn9t-82knzvsMBfb8%3D_V2&jobTitle=Ads+Content+Process+and+Operations+Lead%2C+Product+and+Tools+Operations&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-22T17:01:46.337Z",
    "description": "<p>gTech’s Product and Tools Operations team (gPTO) leverages deep user, operational, and technical insights to innovate Google&#39;s Ads products into customer experiences that are so intuitive (or automated) that they require no support at all. gPTO partners closely with gTech’s Support, Professional Services, Product Management, and Engineering teams to innovate and simplify our Ads products and build the productivity tools ecosystem for gTech users.</p>\n\n<p>The gTech Knowledge, Infrastructure and Tools (gKIT) team’s mission is to drive and optimize one ads support ecosystem. The Ads Content Strategy Team is the team that is focused on creating quality help center content experiences that educate and empower our advertisers. We develop and maintain high quality, up to date, and impactful content by partnering closely with Product and SMEs to understand how our products work and understanding the needs of our internal and external audiences.\n</p>\n\n<p>As the Ads Content Process and Operations Lead, you will be at the core of our strategic effort to provide a consistent and effective user experience, drive self help and customer capabilities across the full spectrum of the user journey. You will be in charge of building and optimizing processes and tools that enable our team to do their job effectively. You will also pull, visualize and analyse data on-demand from various sources, with the objective of providing actionable insights and clear business recommendations.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5669442274131968",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:33:17.292Z",
    "publish_date": "2019-02-27T19:52:46.781Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Math, Business, Statistics or other related quantitative discipline, or equivalent practical experience</li>\n<li>4 years of experience in a process role with content management affinity.</li>\n<li>Experience with process and workflow design, implementation and optimization.</li>\n<li>Analytical experience, comfortable managing large datasets.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Consulting experience.</li>\n<li>Experience in SQL and/or other programming languages (Python, Shell scripting, VBA, Java, PHP, JavaScript, C, etc).</li>\n<li>Understanding of Google’s customer support ecosystem and industry landscape.</li>\n<li>A passion for ads and content management.</li>\n<li>Developed communication, collaboration and presentation skills, comfortable engaging with technical and business stakeholders at all levels.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide weekly and monthly reporting to ACS groups to to inform content development and project work. Create automated reports and dashboards to support content workflows and initiatives.</li>\n<li>Help develop new processes and workflows to create efficiency, drive quality standards and successfully balance workloads.</li>\n<li>Contribute to shaping the future of ads content and self-help methodologies.</li>\n<li>Manage multiple analytics and process improvement projects as well as ad-hoc requests with great flexibility.</li>\n<li>Develop quantitative and qualitative methods to come up with actionable insights that will help us maintain a high-quality content set and measure the impact of our work.</li>\n</ul>",
    "title": "Ads Content Process and Operations Lead, Product and Tools Operations"
}