{
    "application_instruction": "<p><b>Please include URLs for an online portfolio in addition to resume. Submissions without a portfolio included will not be considered.</b></p><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; San Bruno, CA, USA; Mountain View, CA, USA; New York, NY, USA; Los Angeles, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaC5Z575wM5LJRTCtsCit4QOjy0d6YT9lgsMQhWRWzASOQCPMA3TnZFhzdJIlqjYbeOYJNCi5mhJGkvTXqjboCCax_dHWyrlpph31TGhVLfgeDKD-eK9wsV1NQ%3D%3D_V2&jobTitle=Visual+Designer&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:35:02.310Z",
    "description": "<p>At Google, Visual Designers weave iconography, typography, color, space and texture together to help our users successfully navigate our products. We believe that all of our products should be beautiful and accessible. As a Visual Designer, you’ll delight users with designs that inspire, engage and excite them. You’ll rely on user-centered design principles to produce high-quality visuals—from concept to execution—across many platforms. Like all of our UX jobs, you’ll collaborate with your fellow designers to constantly refine the Google design language and create innovative, great-looking products that people love to use.</p>\n\n<p>We follow a simple but vital premise in the UX group: &quot;Focus on the user and all else will follow.&quot; We&#39;re interested in our users and strive to learn everything we can about their behaviors, attitudes and emotions to help define the products and experiences we create. The UX team plays an integral part in gathering these insights and then using them to inspire and inform design. We are a multi-disciplinary team of interaction designers, visual designers, user researchers, content strategists and web developers who collaborate closely with each other and with engineering and product management to create innovative, usable, great-looking products that people love to use.\n</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5726947972939776",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-18T23:31:33.158Z",
    "publish_date": "2019-03-18T23:31:33.158Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Design (e.g., interaction, graphic, visual communications, product, industrial), HCI, CS, or a related field or equivalent practical experience.</li>\n<li>Experience collaborating with multidisciplinary UX and/or product teams (motion, interaction, UX research, engineering, UX writer) on technical implementation</li>\n<li>Experience implementing visual design systems across a range of platforms in an iterative software development environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of relevant work experience.</li><li>Proficient with industry standard design tools (e.g. Photoshop, Illustrator, Sketch).</li>\n<li>Excellent problem-solving skills and familiarity with technical constraints and limitations as they apply to designing for platforms such as desktop and mobile, Android and iOS.</li>\n<li>Proven ability to act as a leader in communicating conceptual ideas and design rationale, all within a user-centered design process.</li>\n<li>Must be self-motivated to prioritize and manage workload and meet critical project deadlines.</li>\n<li>Excellent interpersonal skills and the ability to build good working relationships.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design one or more of Google&#39;s consumer facing products.</li>\n<li>Create a look consistent with all of Google while pleasing our users.</li>\n<li>Communicate effectively in a cross-functional product development team and present ideas and designs effectively.</li>\n<li>Present the user interface visually so information is easy to read, easy to understand and easy to find.</li>\n<li>Market and promote products and features so users understand what they&#39;re getting and what the benefits are.</li>\n</ul>",
    "title": "Visual Designer"
}