{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckV1EWVZTJri5Q8AR1J2qiK-oqwr8vG0sX9Soxsw3_bYSOgCPMA3TY6jKYSGcbBJlFGP_mC4aSeSBoAa1CSzMew9zQSqVXRtgoKWg2SAeTLQ2alwP-5lPUR3dYCM%3D_V2&jobTitle=Data+Solutions+Architect%2C+Finance+Systems+and+Integrations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-12T12:01:51.614Z",
    "description": "<p>Finance Project Managers drive critical priorities for Google by leading and assisting in projects of all sizes. Drawing from your strong financial background, you work with a diverse team to manage projects from concept to implementation and keep Google-wide stakeholders informed as you go. You get down into the details of complex analyses without losing sight of the overall objective. When working on multiple projects at once, you intuitively know which issues to highlight and can bring key decision makers together to come up with effective solutions. Once a project is completed, you&#39;re able to clearly communicate the results and draw the key learnings for senior management. You are efficient and organized, making the most of everyone&#39;s abilities and holding the team to a high standard.<br><br>As a Project Analyst you will work to define and launch strategic and operational initiatives to help the business scale globally, collaborate with Google teams, and embed an external market point-of view into the strategic direction of the group and company. You will own and manage projects or parts of larger initiatives, both on an on-going basis and on an ad-hoc basis, successfully supporting strategic decision-making through analysis and presentation of findings to senior management and the broader organization. You have mastered the cycle of project planning to delivery and associated techniques, and use this knowledge to develop team work plans and manage workloads and deadlines.</p>\n\n\n<p>As a Data Solutions Architect, you&#39;ll be responsible for developing and streamlining Finance data security processes, data governance, and policy development. You will work closely with Finance leads as well as Product and Corporate Engineering to execute on the data security strategy.\n</p>\n\n\n<p>By partnering with Functional Leads across the organization, you will play a key role in implementing the delivery of business-enabling systems and processes. Specifically, you will be responsible for providing expert-level business process guidance to define Enterprise Resource Planning (ERP) transformation requirements and drive ERP design decisions across all finance functions, including, but not limited to; Planning and Budgeting, Financial/Managerial Accounting and Reporting, General Ledger, Fixed Assets Accounting, Treasury, Accounts Receivable, Accounts Payable, and Employee Expenses.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5561829088755712",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:53:23.111Z",
    "publish_date": "2019-02-27T19:53:23.111Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>Proven Project Management experience overseeing large scale, cross-functional ERP systems and data transformations.</li>\n<li>Experience in applying Master Data Management principles to deliver robust ERP Finance solutions.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience with ERP Data Warehousing concepts, including, but not limited to; reporting and analytics, Data Governance, and statutory compliance.</li>\n<li>Advanced technical skills, including proficiency in SQL and advanced spreadsheet skills.</li>\n<li>Experience with Python, R and/or an Object Oriented programming language.</li>\n<li>Ability to advise on how to effectively leverage standard ERP functionality to satisfy business requirements while optimizing return on investment.</li><li>Effective team player, with the ability to influence across all levels of the organization and to partner effectively with cross-functional teams.</li><li>Effective problem solving, process improvement and analytical skills and the ability to work effectively with change.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage and partner with Finance leads to define scope and gather business requirements, provide technical direction to Product and Corporate Engineering teams, and collaborate with all relevant stakeholders to drive/execute on our overall ERP strategy.</li>\n<li>Engage in project/release scoping discussions with internal customers to understand business requirements and complexities to ensure the appropriate ERP services and capabilities are delivered.</li>\n<li>Drive and articulate the ERP transformation systems roadmap, driving business value by influencing internal customers to adopt new procedures and processes.</li>\n<li>Manage release (cutover) planning, articulate and resolve timelines for various cutover activities, and serve as technical and functional SME liaison for ERP deployments.</li>\n<li>Oversee the design and implementation of solutions across business units for a variety of ERP modules. Partner closely with internal teams and suppliers on systems design, application upgrades, release and project implementations, and system performance.</li>\n</ul>",
    "title": "Data Solutions Architect, Finance Systems and Integrations"
}