{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Reston, VA, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQ1Gm5-HsYClxwXc63mNyC0Li4zvYxW1yWXUv1TMWTcSOgASYQ8wF4RKxSQZTuUU04_HkvKDO9uejcFlF0H-IG1Kaqx8_boPjEsHFdenEbLn2k-aS7E3lh99tfg%3D_V2&jobTitle=Government+Strategic+Account+Specialist%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T11:31:44.710Z",
    "description": "<p>The Google Cloud division brings the power of cloud computing to businesses around the globe. You know how to craft a compelling case for sticking with Google products like G Suite, Search and Chrome. You work with companies of various types--local and international, big and small, answering both their technical and high-level questions. Our salesforce finds them, you keep them happy by problem-solving and adjusting to their needs. You love your customer-facing role, jumping at the chance to engage with customers, provide them seamless support, and keep them with Google.</p>\n\n\n<p>In this role, you will provide sales excellence in the Google Cloud division, focused initially on the G Suite family, strategizing with field sales reps and sales partners to increase account and territory business growth. You will work directly with customers, coordinate internal resources, and construct successful up-sell strategies at the account and territory level. You will champion the innovative power of our products to make organizations more productive, collaborative, and mobile. Using your passion for Google products, as a G Suite Strategic Account Specialist, you&#39;ll help spread the magic of Google to the public sector.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/140464723272311494",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-03-18T21:01:52.045Z",
    "publish_date": "2019-03-18T21:01:52.045Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in Software-as-a-Service (SaaS)/cloud computing sales, with a focus on Federal and State and Local government clients.</li>\n<li>2 years of public sector experience with either Federal and/or State and Local customers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of sales experience.</li>\n<li>Ability to build influential relationships and deliver results in a cross-functional/matrixed environment.</li>\n<li>Ability to work effectively as part of a team.</li>\n<li>Excellent written and verbal communication and presentation skills, and strategic and analytical thinking skills, with the ability to plan and execute a territory sales strategy.</li>\n<li>Ability and willingness to travel as required.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with wider Google teams on a territory strategy to generate and develop business results in the territory and open up opportunities with government customers.</li>\n<li>Build strategies to trigger and drive cross-sell opportunities of Google Cloud Platform (GCP), Chrome, Hire, and Maps and more into existing G Suite customers.</li>\n<li>Provide quotes to customers and partners for G Suite renewals and upsells.</li>\n<li>Develop fluency around the G Suite renewal and upsell quoting process, including daily interaction with billing and quoting systems for G Suite upgrades, professional services and support.</li>\n<li>Engage and coordinate internal groups as well as partners, as needed, to meet transformation goals of these key stakeholders to maximize customer retention and business growth.</li>\n</ul>",
    "title": "Government Strategic Account Specialist, Google Cloud"
}