{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckediTWHZ63vpYnQDGBxBTsi5M9xbBrDSf9_hnK_BBmESOgCPMA3TYzOg6U9kULOLqrYH_kPvP7Q_tEfwLjxAwJoYUkbWDXZKcU3PB8A9PCz5feQbbYJQb51yCxk%3D_V2&jobTitle=Data+Solutions+Consultant%2C+Emerging+Products&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-15T17:31:41.873Z",
    "description": "<p>At Google, we organize and change around our users and customers. As Google&#39;s Partnerships Go-to-Market team, our goal to develop relevant solutions that meet our partners&#39; changing distribution, content development, and growth needs. Our mission is to help partners adapt to market trends by providing product solutions and actionable thought leadership.\n</p>\n\n<p>As part of the Americas Go-to-Market team, you will be primarily responsible for helping the Partnerships team in the U.S., Canada, and Latin America build and sustain strategic relationships with the largest publishers in these regions. On the Emerging Products team in particular, you and your teammates will work on long-term, high-impact, leading-edge initiatives that help publishers transform their businesses, bringing about change by providing strategic thought leadership, cross-product solutions, and ecosystem change. \n</p>\n\n<p>In this role, you will focus on guiding publishers in their planning, understanding, and execution of a data strategy to drive increased user engagement and growth. You’ll show how publishers can connect Google solutions (e.g., Analytics, Ad Manager, Google Cloud) by prototyping use cases, crafting best practices, documenting technical instructions, and consulting directly with select publishers. You will also act as a critical technical bridge, helping Sales and Marketing identify market opportunity and need.</p><p>Global Solutions is the link between Google products and business. Your focus is to help turn innovation into complete, packaged tools that allow our customers to get the most that they need from our suite of products. As part of the Global Solutions team, you&#39;ll help to ensure that Google has adopted the right strategy for our products. Working in one of three specialized areas – Performance, Brand, or Publisher &amp; Platform – you&#39;ll use your expertise to help front-line Sales partners to work their magic quickly and effectively. Above all, you are passionate about all things digital, and want to help shape the ever-changing world of online advertising.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4943767810277376",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T20:49:55.004Z",
    "publish_date": "2019-03-01T15:02:02.203Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in a client facing role within tech or a similar field.</li>\n<li>Experience with SQL and any Cloud Platform.</li>\n<li>Experience creating deliverables and presenting to executives, users, stakeholders, and/or partners. Experience working cross-functionally including teams of engineers and data scientists.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with Google Analytics system integrators.</li>\n<li>Experience with Google Ad Manager.</li>\n<li>Knowledge of publisher digital business models.</li>\n<li>Ability to work well in ambiguous environments.</li>\n<li>Ability to make data-driven decisions with excellent project management and analytical skills.</li>\n<li>Ability to clearly communicate visually and verbally to a variety of audiences (e.g., internal, external, technical, executive, and operational).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage with Partnerships teams and external Partners as a product expert to support and lead data solution opportunities.</li>\n<li>Guide technical integrations of Google Analytics, Ad Manager, and Google Cloud through direct consulting with client counterparts.</li>\n<li>Analyze and optimize for publishers to ensure that they make the most of Google’s advertising, analytics, and Cloud-based products</li>\n<li>Provide thought leadership for new product development by synthesizing local market knowledge, partner perspective and business growth vision. Work cross-functionally with Product, Global Strategy, Tech, and Partnerships teams to shape new product development strategy.</li>\n<li>Advocate new product features to Product and Engineering teams and ensure the prompt and proper resolution of technical challenges. Present to internal and external stakeholder groups, and simplify complex concepts for non-technical and executive audiences.</li>\n</ul>",
    "title": "Data Solutions Consultant, Emerging Products"
}