{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Lithia Springs, GA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbyuNJEGH8FJH0EBWJ0vjCWsTo6QBPrK2Tog0T_O1j0SOgCPMA3T7d0nth_BQEedorXUohVmaKSC1bEfoEtGdzQx1uLqgaywdhK18jRXQ32_pP8_NYrXV2PxjCs%3D_V2&jobTitle=Data+Center+Construction+Quality+Program+Manager&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:48.883Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Data Center Construction Quality Program Manager, you&#39;ll work directly with our portfolio of general contractors, electrical/mechanical trades organizations, key integrators, fabricators, and commissioning agents to improve our quality in our construction projects. You will engage in pre-qualification evaluations of potential vendors, update the project manual, communicate quality standards and expectations. You&#39;ll be involved in project planning/tracking, risk mitigation and on-time delivery. You will also serve as an interface to the process excellence and information technology teams who will depend on your project portfolio for best practices, establishing data feeds, fashioning metrics, and capturing lessons learned to help the organization scale efficiently.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5173689814548480",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:05:42.768Z",
    "publish_date": "2019-02-27T19:43:06.875Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Civil/Electrical/ Mechanical/Industrial Engineering, Architecture, Organizational Design, other related field or equivalent practical experience.</li>\n<li>10 years of experience managing the end to end project/product lifecycle (e.g., process developments, implementation and improvement).</li>\n<li>Experience in the operation and construction of datacenter, semiconductor, pharmaceutical, power, nuclear or other 24X7 mission critical facilities.</li>\n<li>Experience leading cross-functional process improvements.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Business Management, Industrial Engineering or Construction.</li>\n<li>Experience with SQL, Tableau, Metrics Dashboards, Data Visualization and Google G Suite Apps.</li>\n<li>Experience working with PMP, Six Sigma (Green or Black), Lean (Lean Construction), DMAIC, Value Stream Mapping, SIPOC, Pull Planning, A3, etc.), 8D, CAPA, 5 Why’s, Ishikawa and other quality tools.</li>\n<li>Knowledge of data center structural, electrical, mechanical and controls equipment.</li>\n<li>Knowledge of operational metrics reporting (e.g., availability, reliability, time to market, productivity, safety, security, quality, cost management, performance, energy use, water use and predictability).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage all construction quality processes with our general contractors, electrical/mechanical trades and commissioning agents.</li>\n<li>Establish metrics to quantitatively characterize quality status for the full life cycle of the construction project.</li>\n<li>Drive a quality culture that embraces both a “right first time” and continuous learning approach that improves project efficiency and quality.</li>\n<li>Incorporate quality techniques such as Six Sigma, Lean, DMAIC, VSM, SIPOC, FMEA, and risk management to reduce variations/deviations in key performance indicators.</li>\n</ul>",
    "title": "Data Center Construction Quality Program Manager"
}