{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSAjui773qcGttfikjGz-znPLMcNRrvEC6LhR22i444SOgASYQ8w8VxE7tX31UBJlnnLADS2m9VZCePji2wgDdkDGP5Lgas0HKzERMofkszUQdwLYk_8arwL-io%3D_V2&jobTitle=Partner+Sales+Manager%2C+SMB%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T21:01:50.095Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>Within Google Cloud, the SMB Partnerships team drives G Suite and Google Cloud Platform growth to SMBs via our global partner network. You&#39;ll work to drive SMB sales within LATAM market, by working collaboratively with our LATAM partner team, direct sales teams and our extensive partner network. You&#39;ll work with key SMB-focused partners to develop their Google Cloud business via sales and marketing campaigns, trainings and enablement. You’ll be the point of contact for our SMB partners in LATAM market, developing an understanding of partner growth drivers and identifying creative solutions to increase sales across several categories of Google Cloud partners.\n</p>\n\n\n<p>You&#39;re collaborative, creative and able to drive sales at scale through our partner ecosystem. You have experience selling Cloud solutions or working with SaaS partners, and understand how to measure and grow SMB business. You have the ability to manage a diverse ecosystem of partners, both directly and at scale, and can partner with our direct sales team to build and execute growth initiatives. Your drive, focus, leadership and collaborative nature will be an excellent positive contribution to our overall team culture.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128738782607221446",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-12T21:01:50.095Z",
    "publish_date": "2019-03-12T21:01:50.095Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of technology sales or partner management experience.</li>\n<li>Ability to speak and write in English, Spanish and Portuguese fluently and idiomatically.</li>\n<li>Ability to travel 40% of the time in LATAM market countries.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>SaaS or cloud IT infrastructure sales, partner management or technical experience. Track record of achieving sales goals and familiarity with sales reporting tools.</li>\n<li>Experience with the cloud partner ecosystem, including System Integrators/Service Providers, Independent Software Vendors, telcos and web or other partners, such as web hosting companies, serving SMBs at scale.</li>\n<li>Experience developing growth initiatives, running experiments and developing conclusions based on data.</li>\n<li>Excellent attention to detail, entrepreneurial, creative, persistent, highly collaborative, with an understanding of Google products.</li>\n<li>Demonstrated analytical and problem-solving skills, capable of translating analysis into actionable plans. Demonstrated organizational, project management and execution capabilities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage business performance of partners and develop strategies to meet/exceed goals in LATAM market.</li>\n<li>Work closely with and support the SMB Sales team to craft and develop programs to grow the LATAM market for G Suite and Google Cloud Platform business.</li>\n<li>Define and execute sales strategies, including lead routing, partner sales training, marketing and other growth initiatives.</li>\n<li>Collaborate with Partner Sales Operations on reporting and metrics for LATAM market, drive process improvements to enhance operational efficiency and develop quarterly business reviews for partners.</li>\n<li>Work with our partners and the SMB Sales team, develop plans for business growth in select markets for small- and mid-sized businesses. Identify, test, analyze and execute on new sales initiatives.</li>\n</ul>",
    "title": "Partner Sales Manager, SMB, Google Cloud"
}