{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUXJ7awKldej3W5y3I-ue6aTO3WiKU-kIOL4Y0rh2HsSOgASYQ8wouekAuLP2GUq-FMwPVQRVU-0z78Y68TNdFhArVkRp0yCNYsYb_JlgERB_CAo5sQj-RAJexU%3D_V2&jobTitle=Policy+and+Documentation+Manager%2C+Stadia&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T17:31:52.555Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Policy and Documentation Manager, you’ll work alongside Operations, Marketing, Product, and Engineering teams to manage and drive all policy and documentation requirements for the platform. From a policy perspective, you’ll manage relationships with other internal policy groups and work with Legal, Product Management, and other groups to help facilitate and communicate requirements and ensure the business runs smoothly.\n</p>\n\n\n<p>In this role, you will be responsible for tracking, producing, and maintaining internal and external-facing operations documentation, coordinating with other groups as needed. \nYou will drive recommendations and solutions to build, operationalize, and scale the business, demonstrating experience across a broad range of technologies, an interest in building and evolving operational capabilities, and a drive towards delivery and execution.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/135232099385778886",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T17:31:52.555Z",
    "publish_date": "2019-03-19T17:31:52.555Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in planning, business operations, or a related role.</li>\n<li>Experience working with internal and external stakeholders.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with and/or passion for video games and the video game industry.</li>\n<li>Experience in business operations or project management, managing multiple work streams of moderate complexity and scope.</li>\n<li>Experience with policy-setting and policy-enforcement functions. Experience with operations organizations.</li>\n<li>Ability to lead and handle multiple time-sensitive projects. Ability to keep multiple critical stakeholders aligned and informed.</li>\n<li>Ability to zoom from strategy to execution and work collaboratively, creatively, and with a drive for results.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage and drive all policy-related matters, working closely with internal policy groups (e.g., Trust and Safety, Google Play Protect) to ensure compliance.</li>\n<li>Work closely and collaboratively with Product Management, Operations, Legal, and other internal stakeholder groups to help define and evolve internal and external policies.</li>\n<li>Drive creation, evolution, maintenance, and tracking of operations-related internal and external documentation necessary to manage partners and internal efforts.</li>\n<li>Manage and drive operations-related planning work streams as needed.</li>\n</ul>",
    "title": "Policy and Documentation Manager, Stadia"
}