{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVHJh8B8sIwGVSYH2rqUpEuFVSV93iMHecbXDyq-TCwSOgASYQ8w7bU1Ibh0tzpxO3Fvld-TYlwNSd_13pyw7eZjOZjNJ8CqlQVcyRTdJSYUQRrtGtr7FkuZFtE%3D_V2&jobTitle=Hardware+Operations+Lead%2C+Stadia&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T17:31:50.944Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Hardware Operations Lead, you’ll work closely with a cross functional team spanning Hardware to execute and deliver high-quality, on time, and within budget Hardware Product solutions for use on Stadia. In this role, you will work with the Home/Nest Operations team to deliver hardware products currently in flight and drive future products on the roadmap while navigating complex product transitions. Working collaboratively across functions, you will establish effective working relationships with peers in the organization while helping to drive recommendations and solutions that scale and adapt across our hardware initiatives.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/73339696505070278",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T18:01:55.356Z",
    "publish_date": "2019-03-19T18:01:55.356Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Industrial Engineering, an engineering discipline, or equivalent practical experience.</li>\n<li>7 years of experience in manufacturing operations, program management, new product introduction, or a related field;</li>\n<li>Experience managing consumer hardware development programs.</li>\n<li>Experience across all phases of a product, including prototype, mass production, and end of life.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Industrial Engineering, Supply Chain, Operations Research, Operations Engineering, or other relevant field.</li>\n<li>Experience in OEM, CM/ODM, and third-party supplier management and negotiations.</li>\n<li>Experience in the consumer technology market. Experience working with global, cross-functional teams.</li>\n<li>Ability to work well under pressure and persistently towards goals.</li>\n<li>Excellent analytical, quantitative reasoning, problem-solving, creativity, and strategic skills.</li>\n<li>Excellent written and verbal communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead cross-functional teams within Google and with external partners to prepare for production ramp and product transitions.</li>\n<li>Drive cross-functional teams to optimize the supply chain for specific strategic reasons, while accounting for risks and changes in schedule or demand.</li>\n<li>Drive manufacturing operational readiness, leveraging internal partner resources as well as ongoing efficiency and improvement across factories from ramp to end of life (EOL).</li>\n<li>Work with internal Hardware partners and OEM/ODM partners to ensure performance goals for quality, turn around time (TAT), and throughput (I/O/S) are met or exceeded from ramp to EOL.</li>\n<li>Anticipate production and operational risk and communicate and mitigate work in collaboration with internal teams and CM/ODMs. to mitigate.</li>\n</ul>",
    "title": "Hardware Operations Lead, Stadia"
}