{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQeOE5FgdhCaCzuFLjAItCSjs4HZ6EnbnpAqZvGFIz8SOgCPMA3TSKznP5xTKrBUa4Y9lHpnX7dT-qjAjlm0R28YA-RxQs8F74lK1IMAXSvX-_Hu3sB7nvyI6D0%3D_V2&jobTitle=Technology+Solutions+Delivery+Manager%2C+Construction+Project+Management+Tools&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:09.841Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Technology Solutions Delivery Manager, you&#39;ll play a key role in the strategy and execution of Google&#39;s data center hosting business and foster alignment across all lines of business within GDC and partners. You will work with our data center business stakeholders to understand their technology needs and work with the internal or external technology providers to build and implement and deliver solutions to meet the business requirements. \n</p>\n\n<p>You will also be responsible for identifying the most lean solution to match business requirements, accountable for driving creation of all necessary project artifacts, and ensuring team members carry out their project tasks throughout the software development lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. \n</p>\n\n<p>Additionally, you&#39;ll be working cross-functionally with stakeholders such as Data Center Delivery and Engineering, Operations, Environmental Health and Safety, Physical Security, Data Center Quality, and Sustainability to build and integrate the next wave of technical solutions to increase operational efficiency, lower cost, and shorten lead times.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4680491200610304",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:51:55.025Z",
    "publish_date": "2019-02-27T19:51:55.025Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science, Business, Engineering, Construction Management, or equivalent practical experience.</li>\n<li>5 years of experience with construction project management; handling daily activities in a dynamic environment to drive deliverables and using various construction project management software.</li>\n<li>5 years of experience as a key contributor in building and enhancing enterprise-class technology systems through the entire Software Development Lifecycle (SDLC).</li>\n<li>Experience with construction project lifecycle processes, from design management, cost estimation, construction planning, cost and schedule tracking, change management/RFIs, supplier resourcing and portfolio management</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience in leading complex software implementations across global and cross-functional teams, particularly around Construction Project Management Technology.</li>\n<li>Experience with implementing Construction Project Management Software (e.g. SAP, JD Edwards, Oracle, Primavera, Textura software) and/or other construction management software.</li>\n<li>Knowledge of data centers, cloud operations, facilities management, engineering and construction.</li>\n<li>Ability to work with IT in product implementation to successfully deliver business tools and systems in a dynamic environment.</li>\n<li>Ability to prioritize and manage across multiple, often time-sensitive initiatives and work collaboratively with numerous stakeholders in multiple geographic locations.</li>\n<li>Ability to travel up to 25% of the time globally.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the delivery, implementation, and business change management of construction project management tools for the global Google Data Center organization.</li>\n<li>Gather and prioritize requirements, manage scope, schedule, and delivery of technology solutions for construction management tools, from initial design and estimates, cost tracking, deployment and construction handover.</li>\n<li>Drive process and technology change management, act as a conduit between business and IT to plan and drive an integrated construction management architecture and roadmap to support the GDC construction lifecycle.</li>\n<li>Work cross-department, cross-project and cross the globe to develop and cultivate relationships with Subject Matter Experts (SME) and stakeholders by facilitating workshops with SMEs/stakeholders to gain an understanding of business needs and priorities, and to get buy-in from the functional units.</li>\n<li>Drive creation of artifacts for a typical Software Development Lifecycle (SDLC) program such as requirement documents, business benefits, design document, project plan, risk assessment, scope, timeline, resourcing, budget, change management, and communication plan.</li>\n</ul>",
    "title": "Technology Solutions Delivery Manager, Construction Project Management Tools"
}