{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeqMWUpctuDxwVrGZPk_l24nG-7yx_6SOonaHWob_ocSOQCPMA3TGfVNrk0hePIB6pcJbTYO0BBmT90xWXoRO9RmpzGjL_Fc4pl88ccZmBObnIr0pltAWWe84g%3D%3D_V2&jobTitle=UX+Program+Manager+and+Researcher%2C+External+Knowledge+Platforms&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_SOLUTIONS",
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:43.407Z",
    "description": "<p>gTech’s Product and Tools Operations team (gPTO) leverages deep user, operational, and technical insights to innovate Google&#39;s Ads products into customer experiences that are so intuitive (or automated) that they require no support at all. gPTO partners closely with gTech’s Support, Professional Services, Product Management, and Engineering teams to innovate and simplify our Ads products and build the productivity tools ecosystem for gTech users.</p>\n\n<p>As a UX Program Manager and Researcher you will be responsible for understanding user behaviors, attitudes and experiences and ultimately translating these insights into actionable initiatives and strategies for the team and our Engineering and Product partners that improve online and offline Google Ads services. You will design and execute qualitative user experience research as foundation of your work.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5019727502180352",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:54:23.394Z",
    "publish_date": "2019-02-27T19:43:37.940Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Human-Computer Interaction, Cognitive Science, Experimental Psychology, a related field or equivalent practical experience.</li>\n<li>6 years of relevant work experience.</li>\n<li>3 years of experience in applied research.</li>\n<li>Experience leading initiatives and delivering results in a client-facing or consulting role.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>1 year of experience in academic research.</li>\n<li>Experience in support and service design.</li>\n<li>Experience with Google&#39;s core products for businesses, including Google Ads, Adsense and Analytics.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Contribute to the vision and strategy of the UX team.</li>\n<li>Propose, design and execute applied UX research.</li>\n<li>Deliver research insights to team members, Engineering, Project Management partners and other research teams.</li>\n<li>Design and lead programs to promote user-first approaches.</li>\n<li>Manage research infrastructure needs for UX team.</li>\n</ul>",
    "title": "UX Program Manager and Researcher, External Knowledge Platforms"
}