{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Reston, VA, USA; New York, NY, USA; Lithia Springs, GA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeYgODkqpHzvwK792Uy0oJwU1e_uZ5lGLsO0To-zUJUSOgCPMA3T2mzcM4q9uhPmzhFV-3uGJyXS8wSt0MVgUtjXxwY7CpKZobdjNPRBbnVn_inQeVRg7JE_J2s%3D_V2&jobTitle=Project+Controls+Group+Lead%2C+Google+Data+Centers&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:39.689Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Project Controls Group Lead at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p><p>As a Project Controls Group Lead, you&#39;ll be part of Google’s Data Center Engineering and Operations team. You will serve in a key role to develop and implement best practice cost and schedule control processes through collaboration with many stakeholders. Your key function will be to drive the efficient delivery of Google’s Data Center Portfolio by the organization of data, implementation of scalable processes and the use of professional tools. In this role, you&#39;ll lead, collaborate, manage and communicate to identify areas for improvement, development of plans, processes and execute changes. This includes managing project budgets and schedules, identifying risks and clearly communicating them to project stakeholders. You will also be support decision making analysis, using objective data to support recommendations that are in line with Google’s objectives.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4885626139901952",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-03-18T20:45:01.746Z",
    "publish_date": "2019-02-27T19:45:11.271Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Construction Management, Quantity Surveying, Industrial Engineering or related field, or equivalent practical experience.</li>\n<li>5 years of experience managing multinational technical programs/projects in a mission critical environment</li>\n<li>Experience with providing information for management reporting and presenting information to management.</li>\n<li>Experience with cost management, cost planning and estimating, planning and scheduling platforms.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree with a technical emphasis.</li>\n<li>Experience with capital and capacity planning, launching Internet software/services, planning data center infrastructure, and/or managing large scale distributed systems.</li>\n<li>Experience leading cross-functional process improvements and holding project leads accountable to the greater project goals.</li>\n<li>Knowledge of the tools and elements of project management.</li>\n<li>Ability to shift between hands-on detailed analysis and big picture thinking and customizing communication based on the audience. Ability to collaborate and consult across multiple levels of an organization.</li>\n<li>Demonstrated analytical skills, with attention to detail, problem-solving and verbal/written communication skills.</li>\n</ul>",
    "responsibilities": "<ul><li>Work with Google’s Data Centers Partner teams and Engineering groups to understand resource needs and create plans related to delivery and management.</li><li>Assist Partner teams in converting future project needs into resource requirements, taking into account supply plans as well as future technology insertions and helping them understand the impact of project implementation in a live data center environment.</li><li>Manage subject matter experts (SMEs) in cost management and project planning/scheduling fields to ensure objectives are met. Support Data Center Project Managers with their projects, change order review, scope of work review, review and approval of proposals, invoicing, pay applications, risk management, value management and value engineering.</li><li>Perform a variety of cost engineering functions encompassing estimating, cost control, budget preparations, forecasting and cost reporting with limited supervision.</li><li>Drive continuous improvement within a specified domain and apply data to support continuous improvement in the wider organization, conduct financial analysis at the project level and across the portfolio to identify trends, opportunities and risks and define and implement the use of effective leading indicators.</li></ul>",
    "title": "Project Controls Group Lead, Google Data Centers"
}