{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckW-lGe-WeGk7RZllTZMRXCi1cKTGjJ_8dhJbHX2YZHMSOgASYQ8w-UXiIfrJi1yzL5QwVOsZftdoO16yUgd_kUGEnwhsMVQNOudv0CDYLpOWwE1M7P7ZLkz3Gys%3D_V2&jobTitle=Performance+Product+Specialist%2C+Agency+Team&loc=US",
    "categories": [
        "ADMINISTRATIVE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T16:31:40.625Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>The Performance Specialist group is the link between Product and Agency Sales at Google. The team helps take product innovations and turns them into client solutions that enable our customers to get the most out of their spend with Google. Team members ensure we have the right commercial strategy for our products and bring product expertise to Agency Sales, enabling front-line Agency Sales partners to sell effectively and quickly. We are passionate about all things digital and want to shape the ever-changing world of online advertising. \n</p>\n\n<p>The Performance Specialist team partners with performance agencies and front-line sellers, helping them apply the strategies developed by the US Product Sales team overall. Performance Specialists are responsible for ensuring the successful employment of strategies for the focus product (Audience, Automation and Creative Excellence) through the respective agency engagements.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5013499062288384",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T20:54:00.458Z",
    "publish_date": "2019-02-27T19:48:54.612Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of digital media, sales, marketing and/or product experience.</li>\n<li>Experience working in a client-facing capacity with a focus on working to quotas.</li>\n<li>Experience in working with cross-functional teams and manage stakeholders across different parts of Large Customer Sales (LCS) and Operations.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Expertise with Google Ads and Performance Marketing.</li>\n<li>Experience with advertising products/services, along with an understanding of online advertising technology including working closely with Product teams.</li>\n<li>Excellent communication and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Solely focus on improving the use of our search products with our customers focusing on; Smart Bidding, Audience and Creative Excellence.</li>\n<li>Act as a performance expert and resource to the performance agency team and personally prep and execute agency presentations to support our goals.</li>\n<li>Offer not only consulting services but also an “end-to-end experience” for customers, relieving pods of much of the prep and delivery burden associated with executing a search strategy.</li>\n<li>Ensure improvements in overall search metrics, provide contribution to metric improvement/growth for agencies touched and deliver the creation and execution of scalable programs that support the above.</li>\n<li>Measure and report on product adoption performance.</li>\n</ul>",
    "title": "Performance Product Specialist, Agency Team"
}