{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZDfkCeW7B1EL9so_uKmDAXcw3N9suztnK-p6Kb2Et8SOgASYQ8waIf34wwOJ00oezlModzzeLwd9I1i9ww4zghGFc301gUKrvoipsmnopBiw4GisP1oxu6mKAs%3D_V2&jobTitle=International+Business+Affairs+Manager%2C+YouTube+Originals&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-07T11:01:46.990Z",
    "description": "<p>The YouTube Originals Business Affairs team works directly with domestic and international studios, production companies, creators and other relevant ecosystem stakeholders in connection with the development, production and acquisition of select original programs. All programming is intended for YouTube’s global platform and include scripted/non-scripted series, specials, live events and features. \n</p>\n\n\n<p>As an International Business Affairs executive, you will assist in handling international business affairs matters for complex license and acquisition agreements including overseeing the negotiation of agreements with producers, writers, actors and production companies in all international markets.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "ASSOCIATES_OR_EQUIVALENT",
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80427441320796870",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-07T11:01:46.990Z",
    "publish_date": "2019-03-07T11:01:46.990Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>8 years of related experience.</li>\n<li>6 years of experience in business affairs with a focus on media and entertainment.</li>\n<li>Experience analyzing and reasoning with respect to technical, contractual and financial issues.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>JD degree.</li>\n<li>Experience interacting and building relationships with senior-level executives.</li>\n<li>Experience negotiating content license and acquisition agreements as well as talent agreements.</li>\n<li>Well organized, analytical, and capable of handling multiple ad hoc requests simultaneously.</li>\n<li>Developed oral communication and interpersonal skills.</li>\n<li>Demonstrated analytical and reasoning skills with respect to technical, contractual and financial issues.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide business affairs support in connection with YouTube Original’s international and domestic development and production slates.</li>\n<li>Assist in defining international agreement structures, and negotiating a variety of agreements of varying sizes, and formats, both reality and scripted. Assist in financial analysis and approval of budgets for all YouTube Original’s international productions.</li>\n<li>Provide input for international licensing, co-production agreements, advertising, integrated marketing, live events and guild agreements.</li>\n<li>Work in a highly cross-functional environment with the YouTube Product and Engineering leadership to build initiatives and propositions.</li>\n<li>Travel to YouTube global offices to work cross-functionally with regional legal counsel and other cross functional members to execute global content strategy.</li>\n</ul>",
    "title": "International Business Affairs Manager, YouTube Originals"
}