{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRKXPwugYUwmtzeXS4yfSDrZ38X9kR_WOYnxvCRenscSOgCPMA3Tz_mO_EG0MqCh4tUWUiRb-Lcfh3HPZx0Ek6n6_p9qQOjBg6ugKpr-9S4y-wLzgO06GjnPq9s%3D_V2&jobTitle=Vendor+Programs+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-13T20:31:33.071Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n<p>As a Vendor Programs Manager on the G Suite Customer Support team, you will work on enhancing the quality and efficiency of a variety of support programs, ensuring that businesses who use Google Cloud products have a great experience. You will lead a team that is devoted to continuously finding relevant support service solutions that meet our customers needs and implementing solutions that work at scale.\n</p>\n\n<p>You will work closely with teams that manage frontline support, technical support engineering, support compliance, data analytics, partner operations and product supportability to measure and ensure the success of our customers when they contact support. We are looking for an experienced team leader who will be responsible for building, maintaining and optimizing Support Programs that deliver bespoke customer outcomes for predetermined subsets of our customer base.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6007086427340800",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:53:20.114Z",
    "publish_date": "2019-02-27T19:53:20.114Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Operations, Management, related technical field or equivalent practical experience.</li>\n<li>7 years of experience leading a regionally or globally distributed team.</li>\n<li>Experience working in strategy, consulting, professional services or on a global operations team with a focus on business and operations strategy, process improvement and analytics.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with data analytics and working knowledge of SQL and structured data sets.</li>\n<li>Experience working in global technical support organizations with vendor outsource operations.</li>\n<li>Experience with understanding, designing and implementing workflow and process improvements, systems or tools.</li>\n<li>Experience with influencing engineering, shared services and sales support in developing value propositions. Cross-functional leadership and collaboration skills.</li>\n<li>Understanding of AI principles, creation of training data sets and identification of ML use cases.</li>\n<li>Ability to consistently deliver business transformation programs in a fast-paced and dynamic environment. Ability to work through ambiguity across multiple technology partners.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Have an understanding of G Suite products, business landscape and technical support procedures.</li>\n<li>Perform data analysis and evaluate opportunities to improve program performance based on newly identified patterns and signals.</li>\n<li>Manage the performance of the vendor sites in your region, serving as the regional escalation point between the vendor and business teams related to product issues.</li>\n<li>Manage the performance and personal development of your direct reports, foster a customer based culture and ensure they are equipped with the skills that G Suite Support will need to meet future challenges.</li>\n<li>Contribute to the performance of the wider G Suite Support organization through setting, scoring and assessment of objective key results. Identify workflow improvements and training opportunities that enhance customer experience through better case handling and faster case resolution.</li>\n</ul>",
    "title": "Vendor Programs Manager, Google Cloud"
}