{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA; Chicago, IL, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdjDU6_6BtGSUOi31e3fsdrAYDwfa1xl-XZkJW25BV8SOgASYQ8wIbIqdqStdYB6_TL8UkD_SjakuB0OHHNl9vqZbTyDsQvJdfjI9S9rDJS9S3VBVJdlejDyJzo%3D_V2&jobTitle=Business+Activation+Lead%2C+Go-to-Market+Operations&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T21:01:51.943Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>As Business Activation Lead, you will activate and manage the omnichannel strategy of 6 retailers. You will collaborate with other workstreams to ensure the success of our customers. Using \nyour analytical background and experience in strategy consulting, marketing analytics, financial modeling, or statistical analysis, you will help retailers adopt best practices in data integration, attribution, lifetime value activation, and omnichannel campaigns and devise marketing strategies that drive successful results.\n</p>\n\n\n<p>In this role, you will work directly with customers and manage relationships with decision makers and leadership within strategy and analytics, demonstrating an effective business judgment and working comfortably in ambiguity. Additionally, you will contribute experience navigating cross-functional teams and influencing without authority.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/110079462545990342",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-08T21:01:51.943Z",
    "publish_date": "2019-03-08T21:01:51.943Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in project management, business or media analytics, consulting, financial analysis, or another quantitative field.</li>\n<li>Experience working with advertisers, agencies, and/or customers.</li>\n<li>Experience activating omnichannel strategies and working with Google platforms (e.g., Google Analytics 360).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in marketing measurement techniques and/or tools (e.g., Google Ads, Google Analytics, etc.).</li>\n<li>Experience in a customer-facing role, advising across levels on performance improvements.</li>\n<li>Experience with spreadsheet and presentation software.</li>\n<li>Ability to analyze large datasets and distill them into actionable insights and compelling stories.</li>\n<li>Ability to travel.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop relationships with client stakeholders to successfully implement recommendations.</li>\n<li>Analyze internal and external data to quantify opportunities, anticipate risks, develop solutions to customer challenges, and measure success.</li>\n<li>Tell stories with data, both visually and verbally.</li>\n<li>Advise on omnichannel marketing, including attribution, lifetime value, customer segmentation, behavior insights, data integration, and measurement.</li>\n<li>Lead the full lifecycle of initiatives, from idea to implementation.</li>\n</ul>",
    "title": "Business Activation Lead, Go-to-Market Operations"
}