{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Raleigh, NC, USA; Durham, NC, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXhorJJHw1CIiiAYeLC6Ywo2JaNqQcjd7ho3YRcFK9ASOgASYQ8wH-wAhrwENu--hd2X-SSpU46kRpBJ87Y7o1F1khHyMXqix-17wtgvYl9OAkOE376Xk0i6eyM%3D_V2&jobTitle=Head+of+Digital+Sales&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T21:02:05.150Z",
    "description": "<p>The Access Operations Team uses Google&#39;s data-driven approach to provide critical business insight. In this role, you&#39;ll use analytics in order to ensure Google&#39;s goals are met in product areas across the company. You strive to help teams push strategic partnerships and new initiatives forward. Your work helps to knit together the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>In this role, you are a fully dedicated business leader, shaping the future of one of our many Google products. Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>At Access, our mission is to create abundant internet on networks that are always fast and always open. Google Fiber provides superfast Internet to homes across the U.S. We want to bring Google Fiber to customers even faster, so we’re focused on making deployment more efficient and less intrusive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/134304909898982086",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-11T21:02:05.150Z",
    "publish_date": "2019-03-11T21:02:05.150Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience managing SEO and SEM digital machines.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>6 years of eCommerce sales experience managing customer growth through websites and digital marketing.</li>\n<li>Demonstrable technical skills and a strong point of view on how to best leverage the following against your campaign goals: Biddable platforms to acquire your target audience at scale with efficiency; mobile tracking and attribution methodologies and other 3rd party digital and mobile ad serving and tracking platforms.</li>\n<li>Strong project management skills and experience leading cross-functional projects with product, engineering and analytics team.</li>\n<li>Outstanding problem solving skills, resourcefulness, and attention to detail. Strong leadership, communication, and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be a Sales leader for website and digital marketing driving customer growth across our sales channel.</li>\n<li>Manage a team to grow and optimize our sales marketing programs.</li>\n<li>Develop scalable campaigns to drive subscriber acquisitions. Launch new performance campaigns and channels, pushing the boundaries for ad and media innovations.</li>\n<li>Lead campaign testing and optimizations throughout the customer journey (ad creative, ad placement, landing page experience, funnel optimization, A/B and multivariate testing, etc).</li>\n<li>Work closely with our agency partners, analytics team, Marketing Finance and PMMs to forecast targets, define measurement plans, analyze campaign performance, optimize, and repeat.</li>\n</ul>",
    "title": "Head of Digital Sales"
}