{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZCOqjwGJtNqzHBRHYjEiIZ4DrDjG2vMoIvzRfDm8gQSOgCPMA3T9Y5EMEIBkUE_pJPpoiZoT-icnff4Uza2qijCsnNOAZDM6gzey_6Orfmib4LWc-3He4IUk30%3D_V2&jobTitle=Retail+Partner+Marketing+Manager%2C+Carriers&loc=US",
    "categories": [
        "ADMINISTRATIVE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:32.624Z",
    "description": "<p>As part of the Retail Marketing team, you will join a team of retail specialists, creatives, experience designers, producers, product marketers, go-to-market strategists and brand managers whose mission it is to fundamentally change how people shop. Guiding your team&#39;s search for how to bring innovation and fresh thinking to retail environments is the question: &quot;What if Google was a place?&quot;. You may be responsible for managing retail executions, both online and offline, for Google products such as Pixel, Google Home, Google wearables and more. Regularly, you provide guidance to retail partners on how to best bring Google ecosystems to life in retail environments.<br></p>\n\n<p>As the Retail Partner Marketing Manager for US Carriers, you will be lead the retail marketing partnerships for Made by Google products in the mobility and carrier space. You will create and execute strategic retail marketing plans to grow the channel and elevate the brand through innovative in store merchandising, demos and channel marketing. You will manage various projects and work closely with cross-functional teams, including Design, Production, Sales, Sales Operations and creative and production agencies. Additionally, you will manage US carrier retail marketing initiatives and creative and production teams, working with carrier partners to develop 2D and 3D production programs, ensuring cross-functional teams, at Google and at carriers, are aware and on track for deadlines and deliverables.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5527475683786752",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:45:08.426Z",
    "publish_date": "2019-02-27T19:45:08.426Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent experience.</li>\n<li>6 years of experience in project management or channel marketing.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>6 years of experience in in-store/online merchandising, channel marketing and execution</li>\n<li>Experience in retail marketing, visual merchandising and store planning in the mobile space.</li>\n<li>Experience in partner marketing/management with US carriers and OEMs.</li>\n<li>Ability to take initiative, adapt quickly to changing priorities and manage projects independently.</li>\n<li>Excellent leadership and organizational skills with good attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Plan, develop and execute in store and online retail merchandising with cross-functional teams from end-to-end.</li>\n<li>Gain alignment with cross-functional stakeholders, briefing creative and production teams, coordinating agencies, leading brand reviews with brand managers and project management of all partner retail marketing plans and executions.</li>\n<li>Establish and execute successful channel marketing plans and co-marketing initiatives through strategic planning with cross-functional teams and stakeholders.</li>\n<li>Lead the team and be the key point of contact for creative approvals for carriers, creative producers and brand managers.</li>\n<li>Develop weekly execution reports, document executions via slide decks and spreadsheets and manage program budgets.</li>\n</ul>",
    "title": "Retail Partner Marketing Manager, Carriers"
}