{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSrICodZ14bRMZb-16YINx0Nfmwl1lL9mDvMrqSQtLASOgCPMA3TTMNDQG3IlcXYAjAWl0xUHCx1V5LBML0XVGeh6F2tsn8Vb-ba-nv_0_8VAdgHqvH2npo4tAk%3D_V2&jobTitle=Data+Center+Facilities+Manager%2C+Global+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:33.771Z",
    "description": "<p>The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.<br><br>You develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.</p>\n\n<p>As a Data Center Facilities Manager, you will be responsible for leading a team in 24/7 Data Center operations. You&#39;ll be responsible for working towards Service Level Agreements (SLAs) with internal teams on uptime, efficiencies and cost. Additionally, you will grow the campus team to meet the needs of the business, and leverage technical talent across the campus and identify key hiring needs for regional data centers.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5774405563252736",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-02-27T19:42:07.045Z",
    "publish_date": "2019-02-27T19:42:07.045Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience working as a Facilities Manager or Chief Engineer.</li>\n<li>Experience in critical facilities management, including facility, technical and team management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in a related Engineering field.</li>\n<li>Experience collaborating with other business units to meet company goals and standards.</li>\n<li>Knowledge of electrical and mechanical systems in a data center environment.</li>\n<li>Effective people management and leadership skills, with the ability to influence at all levels.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Plan and execute campus operational budgets, expense forecasting and manage established budgets.</li>\n<li>Set strategy and plan deployments across multiple sites.</li>\n<li>Lead efforts to integrate Google-wide strategy and execution with internal and external business partners.</li>\n<li>Create strategy for cost effective operations, focused on total cost of ownership.</li>\n<li>Demonstrate critical thinking and innovation in approaching traditional data center and emergent challenges.</li>\n</ul>",
    "title": "Data Center Facilities Manager, Global Data Centers"
}