{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZkC2sBX_MZph9iLVenV9EOqyfwCP1Otc-qyQ4hokRoSOgASYQ8wXFmEzwfX4UHzlLyvgpjkqcHJJ1z1Z3InWr_KyNXacUulmnzaBAAFehJp2eNNtc50tIeyT3I%3D_V2&jobTitle=Software+Engineer%2C+Deep+Static+Analysis%2C+Google+Cloud+Platform&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T17:31:59.067Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br><br>With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n\n<p>We are forming a new team within Google Cloud Platform Tech Infrastructure and Developer Operations with a strategic priority and global impact. The team will develop deep static analysis tools and deploy them in production. \n</p>\n\n\n<p>As a Software Engineer on this team, you’ll be working in a collaborative environment with Engineers that thrive on computationally hard problems with impact, developing cutting-edge development tools for finding issues early in the development process.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/92694617926836934",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:56:27.542Z",
    "publish_date": "2019-02-27T19:56:27.542Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>PhD in Computer Science or a related technical field or equivalent practice experience.</li>\n<li>Professional coding experience in C/C++, Java, Python or Go, combined with 1 year of relevant work experience in software development.</li>\n<li>Experience with Static Code Analysis and program analysis.</li>\n<li>Experience with data structures and algorithms used in static analysis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience architecting and developing large scale distributed systems, concurrency, multithreading and synchronization.</li>\n<li>Experience with programming languages, formal methods, abstract interpretation and/or compilers.</li>\n<li>Proven experience of finding bugs and vulnerabilities with automated tools.</li>\n<li>Proficiency with C++.</li>\n<li>Demonstrated ability to develop program analysis tools.</li>\n<li>Effective written and verbal communication.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Conceive, research, implement, evaluate, productionize new analyses, and detect security vulnerabilities and other errors in code.</li>\n<li>Integrate the developed analyses into the development workflow.</li>\n<li>Maintain, debug, optimize, and refactor code.</li>\n<li>Architect new systems, frameworks, write tests, and documentation.</li>\n<li>Support the developers-facing teams who run our tools in production.</li>\n</ul>",
    "title": "Software Engineer, Deep Static Analysis, Google Cloud Platform"
}