{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZtjDg3px733gqOBZl5_8m79EtvmHdn2M3qN1ZTm270SOgASYQ8wklfaAgl2zuoy_NGvYredcSz6LYGTwoaecSDk9aWWjARi-yWvP-k03_rDZlHyYF86XCliywk%3D_V2&jobTitle=Account+Executive%2C+Digital+Ad+Sales+%28Consumer%2C+Government+and+Entertainment%29&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T17:01:53.557Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p><b>Large Customer Sales:</b> Our teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age.\n</p>\n\n<p>Please note, by applying to this position you will be considered for roles in the following domains: Government &amp; Advocacy, Branded Apparel &amp; Durables, Automotive, Media &amp; Entertainment, Home &amp; Personal Care, Food, Beverages, Restaurants.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/105599789376119494",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-07T17:01:53.557Z",
    "publish_date": "2019-03-07T17:01:53.557Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>8 years of business development experience in digital advertising, mobile, video, or programmatic sales.</li>\n<li>Experience in developing relationships with customers and serving as a consultant.</li>\n<li>Experience working towards goals.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or advanced degree in related field.</li>\n<li>Expertise in managing digital advertising campaigns with Google Ads or a similar product.</li>\n<li>Proven success working with cross-functional teams and building strong relationships internally and externally.</li>\n<li>A deep understanding of the industry’s issues, a vision for its growth and a commitment to advance Google&#39;s forward-looking strategies within the marketplace.</li>\n<li>Knowledge of, and established relationships within, a relevant industry.</li>\n<li>Established credibility with senior-level executives (often in the C-suite) and demonstrated ability to serve as a trusted consultant to optimize and expand advertising investment through cross-device measurement and attribution engagements.</li></ul>",
    "responsibilities": "<ul>\n<li>Work collaboratively with a team to drive growth with new accounts.</li>\n<li>Develop high-level relationships to serve as a trusted consultant with major customers to optimize their advertising.</li>\n<li>Generate and manage business plans to define strategies and tactics for long-term sustained success.</li>\n<li>Understand and adapt to Google&#39;s ongoing product and technology developments.</li>\n<li>Be an effective team player with strong customer service, communication, presentation and creative problem-solving skills.</li>\n</ul>",
    "title": "Account Executive, Digital Ad Sales (Consumer, Government and Entertainment)"
}