{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSH7LVFmZSl1z4PJJhBp-q-Mkt5Q-QYQRWssTEXg-0QSOgCPMA3ThSKlsBebVdOup67FFiD-WYFfaNgOqxSJUoF9a9Gti0svvh6ZXa-ojft59w_lGVHNNOr7kZw%3D_V2&jobTitle=Facilities+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-16T17:31:39.001Z",
    "description": "<p>At Google, we aim to foster Googley work environments that are collaborative, efficient, friendly and fun. The Real Estate Workplace Services (REWS) Facilities team brings our spaces to life and oversees the daily operations of our buildings. You will be responsible for connecting resources across REWS to create amazing environments and experiences for our senior leaders and their extended teams. You facilitate strategic discussions across REWS business areas, including real estate, operations, finance, public affairs and culture. You must build trust in difficult situations, get buy-in and consensus from leaders with diverse opinions, drive decision making where trade-offs are required and keep information circulating so that REWS can grow as Google expands. \n</p>\n\n<p>You&#39;re comfortable in a fast-paced environment with the highest standards of excellence. You aren&#39;t afraid to have fun with your job and bring an enthusiasm, dedication and a collaborative spirit to build and maintain office spaces that facilitate some of the world&#39;s most cutting edge innovation.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6198963928498176",
    "location": {
        "address_lines": [
            "Pittsburgh, PA, USA"
        ],
        "city": "Pittsburgh",
        "country": "PA",
        "country_code": "US",
        "display": "Pittsburgh, PA, USA",
        "lat": 40.44062479999999,
        "lon": -79.9958864
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&size=1168x324&zoom=12&signature=bML2TGs1mgqZUrRr4AbUGft114I=",
        "large_2x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&scale=2&size=1024x324&zoom=12&signature=yYDwtb4snIKR5aq5kGb0m8lAHdQ=",
        "small_1x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&size=600x400&zoom=12&signature=w1iNbGf2icUDv9rzW2JCq5rI-RA=",
        "small_2x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&scale=2&size=600x400&zoom=12&signature=zy8WswLAzKtXGWV1PfX3HzTcfVU="
    },
    "modified": "2019-02-27T19:48:32.054Z",
    "publish_date": "2019-02-27T19:48:32.054Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of relevant experience with an emphasis on facilities, hospitality, corporate services, event management, property management or equivalent office management experience.</li>\n<li>Ability to travel 20% of the time to sites within portfolio and for regional meetings, trainings and summits.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience managing a facilities/operations team with basic experience of mechanical systems (HVAC, Lighting and BMS systems).</li>\n<li>Ability to handle multiple requests, work in a fast-paced environment and be responsive to customer requests/service issues. Ability to navigate ambiguity in a rapidly changing environment.</li>\n<li>Ability to think “outside the box” and bring creative, nonstandard and innovative solutions to the table. Ability to meet deadlines and make sound decisions.</li>\n<li>Ability to manipulate data and see beyond the numbers. Ability to be strategic and draw business conclusions. Excellent analytical and problem-solving skills.</li>\n<li>Ability to communicate effectively in written format, oral presentations and proficient in the use of common business software programs. Familiarity with Google applications.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Influence the customer, client and other internal organizations. Drive consensus and compromise when needed. Communicate program information and updates to Googlers using various forms of Google tools.</li>\n<li>Support a variety of critical business functions, including finance, procurement, vendor management, agreement management, transportation programs and general office services. Find innovative ways to streamline and enhance service delivery while keeping an eye on the bottom line.</li>\n<li>Partner with outsourced facilities services vendor. Ensure best practices are being created by using and testing Google products while also having general oversight of daily operations of offices in all areas of workplace services including reception, security, mail and ticketing system.</li>\n<li>Collaborate with REWS peers to implement yearly initiatives and programs that will benefit the lives of the Google teams that you support. Work with leadership teams to communicate upcoming initiatives and manage the change to ensure success.</li>\n<li>Provide a pivotal role in facility service operations, including new office builds and expansions, capacity and space planning and implementation of new processes and procedures. Collaborate with teams to ensure an efficient, productive integration for such things as regional initiative, fiscal responsibilities, data analysis, new program implementation and M&amp;A activities.</li>\n</ul>",
    "title": "Facilities Manager"
}