{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Kirkland, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYgBA6WzTalwTM8EQxfGAr7x_FLcRueOhhPzkQcojoQSOgCPMA3T1I198LsslVb8Na6UEic5A46r3wQZvOTjce6g5hZY8sDnrTppFmH1utpntY4p_YM4LUD519M%3D_V2&jobTitle=AI+Engineer%2C+Google+Professional+Services&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:17.875Z",
    "description": "<p>As an AI Engineer, you will contribute to Google’s innovations on the delivery of AI and Machine Learning (ML) solutions for our customers and Partners. You will design new and innovative AI and Machine Learning solutions to enable digital transformation for our customers and Partners. You will co-develop AI and Machine Learning solutions with Google Partners, including Independent Software Vendors (ISVs), SaaS vendors and System Integrators (SIs). You will maintain close partnership with Google’s Cloud AI Engineering teams to build and constantly drive excellence in our products. \n</p>\n\n<p>In addition, you will apply your new AI solutions by working with Google’s most strategic Cloud customers. To this end you will design and implement AI and Machine Learning solutions for customers using core Google products including TensorFlow, DataFlow, and Cloud ML Engine. You will work with customers to identify opportunities to identify and apply AI and Machine Learning in their business. This involves travel to customer sites to implement solutions and deliver workshops to educate and empower customers. \n</p>\n\n<p>Together with the team you will support customer implementation of Google Cloud products through: architecture guidance, best practices, data migration, capacity planning, implementation, troubleshooting, monitoring and more.</p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5133130559324160",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-02-27T19:41:17.684Z",
    "publish_date": "2019-02-27T19:41:17.684Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science, Mathematics or related technical field, or equivalent practical experience.</li>\n<li>Experience writing software in one or more languages such as Python, Scala, R and/or similar. Experience working with data structures, algorithms and software design.</li>\n<li>Hands-on experience building machine learning solutions.</li>\n<li>Experience working with technical customers and senior management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with deep learning frameworks (such as TensorFlow, Keras, Torch, Caffe, Theano, H20, etc.)</li>\n<li>Experience working across organizational boundaries, and relevant experience in technical consulting.</li>\n<li>Experience working with recommendation engines, data pipelines and/or distributed Machine Learning.</li>\n<li>Knowledge of data warehousing concepts, including data warehouse technical architectures, infrastructure components, ETL/ELT and reporting/analytic tools and environments (such as Apache Beam, Hadoop, Spark, Pig, Hive, MapReduce, Flume).</li>\n<li>Effective leadership and influencing skills in the application of AI or Machine Learning.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be a trusted technical advisor to customers and solve complex Machine Learning challenges.</li>\n<li>Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders.</li>\n<li>Design innovative AI and Machine Learning solutions for Google customers and Partners. Deliver high quality solutions in the face of ambiguity.</li>\n<li>Manage thought leadership and influence on AI and Machine Learning. Develop process improvements for delivery of AI and Machine Learning models.</li>\n<li>Travel globally up to 60% of the time.</li>\n</ul>",
    "title": "AI Engineer, Google Professional Services"
}