{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Cambridge, MA, USA; Kirkland, WA, USA; New York, NY, USA; Pittsburgh, PA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVFeuy1XWrb7fldQLjw20qegVUY1I6AyBrz0DgNuNNESOQCPMA3TkYMpZ5sBXuqG3VDp-6ImWRmB4539P_5zkRgH7HwJ5H_OSQEPT9JmsTaJRXkrCd_LlgTUYw%3D%3D_V2&jobTitle=Product+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:03.786Z",
    "description": "<p>At Google, we put our users first. From innovative software products like Gmail, YouTube, Chrome, Street View to pioneering mobile devices like the Android, we build products that organize the world&#39;s information and make it universally accessible to our users. The Product Management team works closely with our engineers to guide products from conception to launch. As part of the Product Management team, you bridge the technical and business worlds as you design services that our customers love. You&#39;ll work with Googlers from Engineering, Sales, Marketing, and Finance, to name just a few. You have a bias toward action and can break down complex problems into steps that drive product development at Google speed. As a Product Manager, you will be part of shaping Google&#39;s next moonshot.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability; running the full stack from infrastructure to applications to devices and hardware. Our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p><p>In this role, you will contribute to the mission of delivering innovative cloud services at scale. Whether building on the Cloud platform, working with our technical infrastructure team, building our apps suite, or working closely with executives of key vertical customers and prospects, you&#39;ll drive product strategy and partner closely with cross-functional teams to define and deliver on the next phase of dynamic cloud services. You will develop product solutions, M&amp;A, Go-to-Market, and significant business relationships to execute on the huge market potential and benefits possible from applying Google’s technologies in the enterprise market.</p><p>By applying to this role, you&#39;ll be considered for all teams working on Enterprise, including Google Cloud Platform, G Suite, Developer Product Group and Internal Tools.</p><p>One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. With eyes focused squarely on the future, our team works closely with creative and prolific engineers to help design and develop technologies that improve access to the world&#39;s information. We&#39;re responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting and tailoring our solutions to all the markets where Google does business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5936645103878144",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T22:47:23.481Z",
    "publish_date": "2019-02-27T19:41:02.799Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree in Computer Science, Electrical Engineering, Mathematics, Statistics, or a related technical field, or equivalent practical experience.</li><li>3 years of experience in a Product Management, Engineering or Technology Strategy role.</li><li>Experience working within Cloud, SaaS, emerging cloud use-cases for web/mobile and enterprise companies, or complex supply chain networks.</li><li>Experience working on enterprise products.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA or advanced technical degree.</li><li>Demonstrated ability to achieve strategic goals in an innovative and fast-paced environment, and to evolve product strategy based on research, data and industry trends.</li><li>Excellent problem-solving, organizational, analytical and influencing skills, with proven ability to take initiative and build strong, productive relationships.</li></ul>",
    "responsibilities": "<ul><li>Understand markets, competition and customer/user requirements in depth.</li><li>Identify market opportunities, build business cases, and define product vision and strategy for Google Cloud Platform, APIs, and key verticals.</li><li>Work collaboratively with engineers and cutting edge technologies.</li><li>Define, lead, and execute a cohesive global “One Google Cloud” strategy related to a specific product or set of products, collaborating as needed across regions, product areas, and functions.</li></ul>",
    "title": "Product Manager, Google Cloud"
}