{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYrrqEqijyjeSquF2grP2fCswJE1vCxNG5ovB9HyLUwSOgASYQ8wQ2XcfuijL4NwwqBkYY9lokLfIt88c_jia0TTCUP2sWMxoYNiGROjdr4PKbX9gjhaSbbwWnI%3D_V2&jobTitle=Programs+Manager%2C+Cloud+Sales&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T22:01:51.394Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As a Programs Manager on the Cloud Sales team, you will drive strategy and operational execution in delivering scaled sales campaigns to our Cloud sales team globally. You&#39;ll own the design and execution for a set of global sales programs helping our sales teams generate new business for our full range of products including Google Cloud Platform, G Suite, and Chrome/Android devices to achieve our growth objectives.\n</p>\n\n\n<p>Our team is made up of motivated self-starters that have experience in sales execution, business strategy, and understand the dynamics of the rapidly-evolving cloud computing market across platforms, applications and end-clients. This is an opportunity to shape strategy and execution in a fast growing business.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/72983054768841414",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-12T22:01:51.394Z",
    "publish_date": "2019-03-12T22:01:51.394Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in sales, sales development, sales operations, corporate strategy, or equivalent project management experience in a technology/media company.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience as part of an enterprise sales organization.</li>\n<li>Analytical experience, with the ability to query large datasets and develop analysis/insights to drive decisions and inform strategy.</li>\n<li>Experience working with technical teams to drive new feature requests, create reports, develop processes, and drive data quality.</li>\n<li>Track record of leading cross-functional projects and delivering business impact, with demonstrated business acumen and ability to successfully navigate and influence within a complex business environment.</li>\n<li>Excellent communication and facilitation skills, proven track record of building relationships with senior stakeholders.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Execute sales campaigns from the ideation stage, through content creation, contact/account targeting, quantitative measurement design, enablement, execution by sales teams, and delivering reporting and insights.</li>\n<li>Partner with regional Cloud sales, Sales Operations and other executive stakeholders across strategy, enablement, marketing, and partners to align cross-functional team efforts on the campaign plans.</li>\n<li>Adapt and problem solve various incentive, data, and technical issues to consistently and rapidly improve processes to make it easy for our sellers to work with key customers.</li>\n<li>Conduct detailed quantitative analyses using SQL to inform strategy and assess program success.</li>\n</ul>",
    "title": "Programs Manager, Cloud Sales"
}