{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Austin, TX, USA; New York, NY, USA; Redwood City, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckV_sQlmkLMQsD_8L2DNbSLa73OSZ4MLsUb4esQG1wVASOgASYQ8wTVbd1WEtNrqrHiqqx5xJ8JF7_iQSoztF51z4Gs33_Lj2OojweWj3Nt1Bf2Ni0egfkbfq39U%3D_V2&jobTitle=Acceleration+Strategic+Partner+Manager%2C+Channel+Sales&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-15T20:31:48.170Z",
    "description": "<p>Our clients&#39; needs are constantly changing, and so our products need to change with them. Strategic Partner Developers serve as our consultants to our customers, using research and analytics to build long-lasting relationship with our partners. Your expertise of Google&#39;s products and our partners&#39; businesses allow you to identify new opportunities for their growth, launch new products, and expand the impact of our clients&#39; work. You possess strong relationship-building skills and are apt to work effectively with Google&#39;s partners, in order to best represent our users, products and programs and drive growth.</p>\n\n<p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/136713700431012550",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-19T20:01:58.049Z",
    "publish_date": "2019-03-19T20:01:58.049Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience working in product management, product marketing, operations and/or consulting in the technology industry.</li>\n<li>Experience working in a digital marketing, e-commerce, or marketing automation capacity.</li>\n<li>Experience in leading and managing multiple internal and external projects simultaneously.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Demonstrated ability to think strategically about complex challenges and develop thoughtful recommendations and action plans.</li>\n<li>Experience working with API integration and design.</li></ul>",
    "responsibilities": "<ul>\n<li>Help Google Partners develop go to market strategies for partners who may or may not have an existing Google Ads product offering, and implement processes for managing, engaging, and expanding partnerships.</li><li>Manage relationships with Google’s channel partners and develop strategic account plans with eye toward identifying creative growth opportunities.</li>\n<li>Lead a cross-functional team, and work closely with Marketing, Sales Engineering, Training, Editorial/Optimization, Business Development, and Product teams to optimize partnerships.</li>\n<li>Forecast and report key metrics and growth and lead ad hoc projects focused on the strategic growth of the program.</li>\n<li>Deliver excellent client service through regular strategy meetings and quarterly business reviews with C-level audiences; traveling up to 20% of the time.</li>\n</ul>",
    "title": "Acceleration Strategic Partner Manager, Channel Sales"
}