{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZujpe7c8sZvKZ1JnFcwNxKX01wnGowfS_3xJ4P4aGQSOgCPMA3T1RReQr8dKVUX3-JI7swCxXJ3A8Oad3is6t9eQRc8RiaykivZPIYHjH5r9mu2tC4L6bkSaRw%3D_V2&jobTitle=Quality+Engineer%2C+Manufacturing&loc=US",
    "categories": [
        "MANUFACTURING_SUPPLY_CHAIN"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:09.820Z",
    "description": "<p>Google&#39;s custom-designed equipment makes up one of the largest and most powerful computing infrastructures in the world. The Manufacturing Operations team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure. As a Manufacturing Engineer, you evaluate the product designs and create the processes, tools and procedures behind Google’s powerful search technology. When vendors build parts for our infrastructure, you’re right there alongside ensuring manufacturing processes are repeatable and controlled. You collaborate with Commodity Managers and Design Engineers to determine Google’s infrastructure needs and product specifications. Your work ensures the various pieces of Google’s infrastructure fit together perfectly and keep our systems humming along smoothly for a seamless user experience.</p>\n\n<p>As a Quality Engineer, you will join the team responsible for setting and managing the quality and reliability standards for Google&#39;s servers, storage and networking equipment. You are a quality expert with a track record of establishing quality programs from the ground up. You are hands-on and have extensive involvement in the tools and techniques used to introduce dynamic new storage products.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4812333916553216",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:38:34.968Z",
    "publish_date": "2019-02-27T19:46:02.828Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Mechanical Engineering, Electrical Engineering, Industrial Engineering or equivalent practical experience.</li>\n<li>3 years of experience in PCBA or Microelectronics Assembly.</li>\n<li>American Society for Quality certification (CQE, CRE or CQA) OR experience with Lean Manufacturing and Six Sigma.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience in Quality/Reliability.</li>\n<li>1 year of experience in statistical data analysis.</li>\n<li>Experience programming in python, SQL or R.</li>\n<li>Experience in ISO process setup.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish product quality and reliability standards for Google&#39;s servers and storage equipment. Manage cost of quality and manage throughout the life of the product.</li>\n<li>Build quality models for new products; use models to predict product quality and reliability performance and drive design improvements. Evaluate and improve product quality and reliability performance using various techniques.</li>\n<li>Work with various teams to ensure new products and supporting systems are being designed to provide the data required to manage the quality and reliability of Google&#39;s fleet. Establish dashboards and metrics and use a data-driven approach to problem identification and resolution.</li>\n<li>Provide consultation to Design, Manufacturing and Commodity teams in the selection, sourcing, qualification, and application of components and suppliers used in Google&#39;s equipment.</li>\n<li>Investigate failures and coordinate failure analysis, determining root causes, categorizing failures and driving corrective action through Google’s supply chain and design team.</li>\n</ul>",
    "title": "Quality Engineer, Manufacturing"
}