{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeEMy9HVYOegDOBFy7zWbsaNfG-_liyovJltXRNufTESOQASYQ8wgc_iqK8UHR0-J_D7Fcv-0-AKdeGVPEbW98cEZ-0ACfQpmbw1wVJNFO_W8DpHxxRTV5BlPQ%3D%3D_V2&jobTitle=Product+Strategy+and+Operations+Lead%2FPrincipal%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-01T21:32:01.908Z",
    "description": "<p>YouTube’s ecosystem is constantly growing and evolving, and it is key to deploy resources efficiently to best serve YouTube’s users, creators and advertisers globally. We believe it&#39;s critical to use data to run our business and drive the decisions we make. Our Product Strategy and Operations team (“ProdOps”) partners with Product and Engineering leaders to help them run each major part of our business. \n</p>\n\n<p>As a ProdOps Lead/Principal, you’ll be embedded in YouTube Product Areas and are responsible for helping manage the day to day business cadence, overseeing and communicating business performance, and driving how we use data each and every day to ensure faster, better decisions that will help responsibly and sustainably grow our business. You’ll also be a close business partner to our teams of Data Scientists, combining your business insight and judgment with their deep analytical knowledge. You will ensure that we have the right tools, data visualization and processes to deliver analytical insights to the organization that drive product decisions.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/88793629457294022",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T00:31:57.583Z",
    "publish_date": "2019-03-07T00:31:57.583Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience in management consulting, investment banking, business intelligence, data science, or corporate strategy.</li>\n<li>Experience with data analysis, modeling, SQL and presentations.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>10 years of experience in an analytical role, such as management consulting, investment banking, business intelligence, data science or corporate strategy.</li><li>Experience building software products as a product manager or engineer.</li><li>Experience communicating and influencing through data.</li><li>Background in computer science, statistics, machine learning or financial analysis.</li></ul>",
    "responsibilities": "<ul>\n<li>Help define the performance metrics and goals for your product area.</li>\n<li>Own metric reporting for your product area to leadership across YouTube and Google.</li>\n<li>Collaborate with our Product and Strategy teams to understand how performance relates to the broader industry and our competition.</li>\n<li>Drive the design for our internal data tools that are used to communicate data and work closely with Product Managers and Engineers as they develop tools.</li>\n<li>Partner with our Data Science team to prioritize and execute quantitative analyses and advanced modeling that deliver actionable insights to our Product and Engineering teams.</li>\n</ul>",
    "title": "Product Strategy and Operations Lead/Principal, YouTube"
}