{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWmqdee3_bURsyln1Vf6bUwUYY2n4Q-5doPnW_E-fiESOgCPMA3TShjvAb3z2NJZNZJaK8IWg_H5_K0MqSB5loB4aA7epiArkDcYO8mXSa4V8CDjtteRhKWIDoo%3D_V2&jobTitle=Mobile+Solutions+Architect%2C+Google+Play&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:44:30.435Z",
    "description": "<p>Google Play Apps and Games Business Development (Play BD) is a team dedicated to helping developers build successful businesses using Android and Google Play. As an integral part of Play BD, the Technology Solutions Consulting team (TechOps) works closely with developers globally to build high quality, innovative and locally relevant apps that drive business success on Play/Android.</p><p>Google Play offers music, movies, books, apps and games for your devices, powered by the cloud. It’s a Google approach to entertainment, syncing magically across your devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping the product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team helps strengthen the overall Android ecosystem by giving developers and partners a premium store where they can reach millions of users.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5752789202173952",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:06.866Z",
    "publish_date": "2019-02-27T19:52:06.866Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field, or equivalent practical experience.</li>\n<li>7 years of experience in a development and/or quality assurance role for mobile apps and games. 2 years of people management experience.</li>\n<li>Experience in development cycle of mobile apps and games running across multiple device form factors.</li>\n<li>Experience in identifying, reproducing and reporting bugs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Customer support and/or partner relationship experience.</li>\n<li>Experience in mobile app/game testing, such as using Android Vitals, Crashlytics, Firebase Test Lab, Play Console Pre-launch Reports, and/or other tools.</li>\n<li>Experience working within cross-functional teams to scope requirements.</li>\n<li>Knowledge of and interest in mobile app development and related topics.</li>\n<li>Ability to analyze data, generate and report insights to improve processes.</li>\n<li>Developed leadership skills, with ability to both nurture creativity and drive operational process and discipline.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Help define and update app quality guidelines for Android apps running on different form factors (e.g., VR, Wear, TV) and Google Play services. Ensure such guidelines provide clear and actionable items for developers.</li>\n<li>Perform in-depth, 1:1 consultations with developers to improve business metrics.</li>\n<li>Work with internal Google product teams to adopt app quality guidelines as part of launch process.</li>\n<li>Work with vendor review teams to scale app quality reviews for Play BD managed developers globally.</li>\n<li>Communicate latest updates on app quality guidelines to Play BD Managers, vendors and other related cross-functional teams.</li>\n</ul>",
    "title": "Mobile Solutions Architect, Google Play"
}