{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke9myU5GRQljJVMWA9R2oIe9dqPO5prYvn85A6TM_BISOgASYQ8wBfqPWQbyx-IIze41A9fLX7DQQ6qWS1ZCDlDAXgWh-CLWdmTU7iC1b4ww_T-t6WjyDyCeMWE%3D_V2&jobTitle=Program+Manager%2C+Music+and+Subscription+Operations%2C+YouTube&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-07T15:31:56.273Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p><p>The recently relaunched YouTube Music app brings the best of Google Play Music to YouTube, and delivers a premium music streaming experience to our users. The YouTube Music team works with music publishers, record labels, collection societies and artists on growing their businesses while also enabling our users to enjoy their content via our platform. In this role, you&#39;ll work at the intersection of music and technology.</p><p>You&#39;ll work with Music and Subscriptions Operations, Business, Product and Engineering teams to discover, construct, drive, execute and land programs that solve operational challenges for the YouTube Music business. </p><p>You&#39;ll help define and monitor the progress of key milestones, and drive launches of new features and initiatives cross-functionally. You&#39;ll anticipate roadblocks in advance, resolve action items, create reporting for cross-functional teams, communicate program status, risks and next steps, and lead the team to be more operationally effective. You have a positive, can-do attitude with a desire to do what it takes to contribute to the overall success of a program.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82617453734961862",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T15:31:56.273Z",
    "publish_date": "2019-03-07T15:31:56.273Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>4 years of experience in program management, project management, product management and/or technical partner management/operations.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience working across cross-functional teams (e.g., engineering, product, marketing, sales, policy) towards data-driven goals.</li><li>Experience with G Suite and project management tools/frameworks (e.g., Agile, Waterfall, etc.), and passion for technology.</li><li>Demonstrated ability to take initiative, lead and make continuous improvements. Ability to see the big picture with excellent attention to detail.</li><li>Ability to manage time-sensitive projects in a changing environment, and quickly resolve issues.</li><li>Excellent organizational, people and project management skills, with ability to convey information to team members in a timely, concise manner and delegate.</li><li>Demonstrated problem solving and analysis skills with excellent business judgment.</li></ul>",
    "responsibilities": "<ul><li>Define and meet launch and quality milestones for complex YouTube Music programs. Design and implement end-to-end processes focused on driving team efficiency and solving program management needs.</li><li>Coordinate upcoming features and initiatives for smooth on-time launches with the cross-functional team. Network with a diverse set of stakeholders, generate buy-in and navigate conflicting priorities to ensure on-time project delivery.</li><li>Identify strategic opportunities for the Operations teams to add value to new and existing features. Maximize program successes through effective project organization, accurate prioritization and trade-off management.</li><li>Scale existing processes for growing and/or changing needs. Leverage technical and analytical abilities to automate tasks.</li><li>Evaluate progress and communicate program status, risks, and next steps to internal stakeholder teams. Facilitate seamless communication within teams and throughout the organization.</li></ul>",
    "title": "Program Manager, Music and Subscription Operations, YouTube"
}