{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSgeq0oOC9xlSFC5Sg5isYeTNDuSqLos5EPE1hWTO-MSOgASYQ8wXEem6WREmS6RUOP-WD9el6stB1ZVBlQ81-Tg4Txpkfiu3nVDfWJbUY7kwPeUR3jrg_Jfd2o%3D_V2&jobTitle=Engineering+Director%2C+Chip+Design+Verification&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T22:31:46.416Z",
    "description": "<p>Our computational challenges are so big, complex, and unique, we can&#39;t just purchase off-the-shelf hardware. We&#39;ve got to make it ourselves. As an Engineering Director, you’ll lead teams that design and build the systems that are the heart of the world&#39;s largest and most powerful computing infrastructure. From circuits to large systems, you’ll see projects from design all the way through to high-volume manufacturing. Your work will shape the machinery that goes into our cutting-edge data centers, affecting millions of Google users.</p><p>As a Director of Chip Design Verification within the Technical Infrastructure team, you will help deliver products that have a substantive impact on Google’s technical infrastructure. You will provide leadership to a group of Hardware Engineers in an innovative and fast-paced environment, with a focus on chip design verification, utilizing simulation, formal property verification, and acceleration techniques. You&#39;ll bring out the best in your team to deliver designs that work in a number of different application areas.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/108565293166404294",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:55:00.629Z",
    "publish_date": "2019-02-27T19:55:00.629Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in Electrical Engineering or a related field, or equivalent practical experience.</li>\n<li>10 years of experience working with hardware description languages (e.g., SystemVerilog), design verification methodologies (e.g., UVM), and chip design flow.</li>\n<li>Experience in design verification of digital designs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree in Electrical Engineering or a related field.</li>\n<li>Experience with technical innovation and solving verification issues.</li>\n<li>Experience leading design verification teams through the full cycle, from concept to delivery.</li>\n<li>Expertise leading teams towards business goals.</li>\n<li>Effective leadership capabilities, and ability to motivate a team.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of hardware engineers; plan tasks, and hold code and design reviews.</li>\n<li>Understand architecture and design specifications with the larger team, and define verification strategies to work towards business goals. Lead the evaluation of novel verification methodologies and tools.</li>\n<li>Work closely with architecture, design, and implementation stakeholders to provide status, iterative milestones, and make design decisions throughout the development process.</li>\n<li>Conduct resource planning and allocation to deliver against a plan, including schedule and resource dependencies within and between projects.</li>\n<li>Communicate progress and setbacks to upper management, and identify and respond to issues with schedule, quality, or teamwork.</li>\n</ul>",
    "title": "Engineering Director, Chip Design Verification"
}