{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU1FHL7V55Pdk3M3W4QTAEMakDb3om0WtTVmk5dLE60SOgASYQ8w_MfFqugPbrNk6l890VHxOmm5axcMMIUN5aGwMPWnNB4gOmc1AC5rjXOC0GSZMEMmAC4kNrw%3D_V2&jobTitle=Quantitative+Revenue+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T17:31:43.128Z",
    "description": "<p>Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.<br><br>As someone who knows the workings of the core Finance team inside and out, you&#39;ll lead individual projects to transform planning, tracking and control processes. You&#39;ll provide senior level management with insightful recommendations, planning and reporting support.</p>\n\n<p>As part of this team, you will have a unique perspective on Google’s core businesses, services and the ecosystems that they operate within.\n</p>\n\n<p>As a Quantitative Revenue Analyst, you are experienced with and passionate about using data to solve complex business questions and drive strategy recommendations. You will be an integral part of a working group of Search Ads Quality Product Managers, Engineers and Quantitative Analysts.\n</p>\n\n<p>You are a self-starter and are equally comfortable with writing code to mine insights out of Google’s internal ads logs, analyzing external data to understand the motivations and decision-making process of Google’s users and advertisers, and communicating findings to senior executives</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/140359434162315974",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:55:03.078Z",
    "publish_date": "2019-02-27T19:55:03.078Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience</li>\n<li>4 years of relevant work experience involving quantitative data analysis</li>\n<li>Experience with SQL, programming and/or advanced spreadsheet modeling</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or Mathematics</li>\n<li>6 years of experience related to online advertising</li>\n<li>Ability to draw conclusions from data and present results / recommendations to executive audiences</li>\n<li>Willingness to both teach others and constantly learn new analytical techniques, coding frameworks, etc.</li>\n<li>Strong analytical and communication skills</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Proactively research new ways of analyzing data to unlock actionable insights.</li>\n<li>Distill and communicate the essence of your technical work to audiences of all levels and across multiple functional areas while formulating robust, actionable recommendations.</li>\n<li>Contribute to the development of the analytical frameworks, tools, skills, culture which drive impact for Finance and Google.</li>\n<li>Work with a team of Product Managers, Engineers and analysts responsible for advancing Search Ads monetization.</li>\n</ul>",
    "title": "Quantitative Revenue Analyst"
}