{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUBCn2YIkZ9EclyJV14BDsIjV5IkPlGwpmsIWjVUujESOgCPMA3Tk9D0MLf36JwuDBdNWcLvbsO7GSK_5GEwVQC8VjHhqUsneuGm3l60Zhxajo3rdLiDv3_zMrg%3D_V2&jobTitle=Agency+Development+Manager%2C+Agency+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-10T20:31:39.571Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer. \nAs the Agency Development Manager, you will provide the management, analytical and leadership skills required to drive overall business growth of our managed Google Customer Solutions agencies. You will focus on strengthening long-term relationships with our GCS agencies, driving scalable product adoption and growth across the broader portfolio of agency-managed accounts. You will also develop the acquisition capabilities of your assigned agencies in order to achieve business growth. Your knowledge of online media combined with your communication skills and analytical abilities shapes how your agencies’ new and existing businesses grow.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5913503673548800",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:41:49.113Z",
    "publish_date": "2019-02-27T19:41:49.113Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of agency experience. Experience building and managing executive relationships.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n<li>Ability to travel up to 20% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience meeting strategic goals within a sales portfolio, and employing sales techniques, including effective questioning, objection handling, competitive selling.</li>\n<li>Demonstrated ability to lead and manage multiple projects with a broad range of internal and external constituents simultaneously.</li>\n<li>Demonstrated ability to think strategically about complex issues, develop recommendations and action plans</li>\n<li>Demonstrated ability to influence others, especially agency partners, through relationship building, thought leadership, and reliable solution recommendation.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver against assigned strategic goals on new and existing business consistently, while prioritizing and delivering outstanding experiences to Google&#39;s agency partners.</li>\n<li>Manage and strengthen primary agency relationships, including Media Planners and Buyers. Focus on long-term growth through strategic agency-wide projects.</li>\n<li>Synchronize agency plans with your assigned agency team and internal cross-functional teams to further develop our managed agencies including New Business Sales (NBS) counterparts.</li>\n<li>Shape the agency program by being a thought partner for the Agency Lead on strategic initiatives and agency-level planning.</li>\n<li>Grow agency business by driving scalable product adoption and growth across a broader portfolio of accounts.</li>\n</ul>",
    "title": "Agency Development Manager, Agency Sales, Google Customer Solutions"
}