{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcuuWyMte0x_0Fv9xHA2PoH9FrXlqGnu5O55U0LHXI8SOgCPMA3T36u6LKKu3g2gouDOqSMromrBi0IWsY__QYOf0UTHMzg-XXyQi5k08MLq_xJWJvXvhPnvcTQ%3D_V2&jobTitle=Incentives+Program+Manager%2C+Cross-Programs+Strategy+and+Operations&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:44:12.738Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Google Customer Solutions (GCS) Revenue Programs team is responsible for driving global insights and recommendations that unlock business growth for Google’s advertising business. The team leads the design, planning, and implementation of global business growth programs with cross-functional collaboration among Sales leadership, Marketing, Product and Engineering. As a central team, we provide business critical insights to shape the engagement strategy of our global salesforce and ensure alignment of goals and execution as we grow the business. Team members share experience in business strategy and operations and are analytical and strategic, yet highly pragmatic and results-oriented.\n</p>\n\n<p>In this role, you will be responsible for driving continuous improvement throughout the business by re-imagining every aspect of it. You&#39;ll combine analytical experience and thought leadership to drive improvements in incentives, customer segmentation and prioritization, engagement strategy, product penetration, and organization design. You will have exposure and visibility to executives as you present your proposals and demonstrate their impact, and will be sought out as an advisor by leaders across the organization. Additionally, you will work in a rapidly changing industry, handling ambiguity and stakeholders with effective problem-solving leadership and limited oversight.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5834141708648448",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-14T10:01:40.406Z",
    "publish_date": "2019-03-14T10:01:40.406Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, quantitative field, or equivalent practical experience.</li>\n<li>3 years of experience in a project management role at a management consulting firm or investment bank, or equivalent experience in a corporate role focused on strategic advisory.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience manipulating large data sets using SQL.</li>\n<li>Experience with sales or Sales teams at high-growth technology clients.</li>\n<li>Experience partnering with data science teams, developing predictive models and managing large data sets.</li>\n<li>Track record of successfully managing strategic and operationally complex projects with cross-functional teams.</li>\n<li>Excellent business judgment, along with a natural inclination to formulate hypotheses, design tests, and use problem-solving techniques to evaluate solutions.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive key changes to programs, including detailed design and execution of changes required to achieve future state objectives.</li>\n<li>Work with business analyst to drive key analyses to support or refute design choices and measure overall business impact of proposed changes.</li>\n<li>Design pilots and experiments to test various design choices.</li>\n<li>Execute pilot tests including onboarding testers, monitoring progress, troubleshooting issues, and evaluating outcomes against success metrics.</li>\n<li>Create and adapt communications and training related to any design changes.</li>\n</ul>",
    "title": "Incentives Program Manager, Cross-Programs Strategy and Operations"
}