{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Boulder, CO, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUf9DEQlZcaQKhmvHboAS5T8tgkKlQ9WXbj6Jxe2n2sSOgASYQ8wBpA70cXAAsTVmmYNUBB8j-AwiHjsJRJ6ySiYhc1xWIw1059jswJ2nwdaUw3gc9YqQpCkKxY%3D_V2&jobTitle=Analytics+Program+Manager&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T17:31:51.441Z",
    "description": "<p>The Google Food team is responsible for creating food experiences that promote collaboration and engage and energize Googlers each and every day. Our team works with a variety of partners and suppliers to provide delicious, nutritious food and innovative experiences, and to fuel Google’s culture of innovation.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/119953089043014342",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-07T17:31:51.441Z",
    "publish_date": "2019-03-07T17:31:51.441Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in project management and data analysis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience with SQL and Google Dashboard.</li>\n<li>Experience with system implementation projects, from requirements gathering, design, build, testing, implementation, through user training.</li>\n<li>Track record of leveraging data, analyses, and insights to drive business outcomes.</li>\n<li>Ability to motivate colleagues and collaborate effectively to help influence leadership and excellent business judgment.</li>\n<li>Ability to take initiative and drive ambiguous projects across multiple stakeholder groups to resolution, without guidance and oversight.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define and build data collection, analysis, and reporting capabilities and develop and maintain reports, dashboards, and other tools. Manage data infrastructure development and reporting projects for Google Food, developing options to solve for data challenges.</li>\n<li>Seek out data, system, and process related to the needs of the Food team. Develop projects to solve for data related challenges, and prioritize efforts.</li>\n<li>Develop a project plan/timeline, resourcing plan, and obtain alignment from stakeholders. Find and motivate colleagues within and outside of Food team to collaborate on projects and manage and execute on deliverables, while providing clear and timely communications to stakeholders and working independently to develop options and recommendations and implement solutions.</li>\n<li>Perform ad-hoc reporting requests using existing reports, writing SQL, or working with Finance/REWS business intelligence (BI) to obtain data. Support Google Food team leadership with key insights, as well as how to operationalize data and insights.</li>\n<li>Partner with a range of stakeholders, including Food team leadership, the Global Program team, regional Operations teams, and food service vendor partners. Adapt and customize your approach to a wide variety of audiences and be a strategic thought partner, understanding business needs and developing effective and scalable recommendations.</li>\n</ul>",
    "title": "Analytics Program Manager"
}