{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYThyR-Rb_9B1gZnGJ1ihSSh4noPAasM5JkV2J_de1oSOgASYQ8wHFquvF09amNjIHhDVwO8-vLxcKph4IV8EkfnoOckULNNy6VEN_8nBo590xmPf2ItMNyEndU%3D_V2&jobTitle=Incident+Manager%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-30T19:31:42.919Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n<p>As an Incident Manager in Trust and Safety, you’ll be part of a global team working to ensure that sensitive incidents in the realm of user protection are managed effectively, with the least amount of impact on our business, users, or brand. You will support cross-product teams throughout the entire incident response process, from identification to escalation, through to communications, resolution, and follow up. Within our model, you will help monitor geopolitical events to determine if they present a risk, and escalate to the appropriate teams if needed. \n</p>\n\n<p>In this role, you will manage the response to incidents globally, and use a variety of incident management tools, communications, and facilitation methods to ensure issues are identified and the right stakeholders are involved in resolution. You’ll conduct postmortems after an incident is closed to ensure lessons learned are gathered and mitigations put in place. Additionally, you will dig into the data around incidents and searching for trends, impact, and possible improvements, comfortably analyzing and understanding complex, non-standard situations and providing solutions and recommendations. In this role, you will join a fairly new team, helping us test-drive new processes, systems, and infrastructure to manage incidents and have input into where we put our efforts next.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80045028035961542",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:55:24.862Z",
    "publish_date": "2019-02-27T19:55:24.862Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in incident response or program management.</li>\n<li>Experience conducting risk-based analysis of events and recommending actions or solutions.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Google products and infrastructures and different types of online abuse.</li>\n<li>Understanding of international and geopolitical events and how they may impact a global company.</li>\n<li>Ability to work successfully in cross-functional teams, including stakeholders and executives.</li>\n<li>Ability to address complex challenge resolutions with a data-driven analytical approach, demonstrating excellent technical competencies.</li>\n<li>Ability to function well in high-pressure situations and smoothly take the lead if necessary. Ability to occasionally work outside normal business hours to support an incident.</li>\n<li>Excellent analytical and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and help manage incidents as part of the global 24/7 Incident Management team in the Trust and Safety organization.</li>\n<li>Monitor news and internal/external sources for events that may need escalation to prevent risks related to fraud, abuse, and user trust. Follow a set prioritization model to determine if event needs escalation and ensure enforcement teams or executives are engaged as appropriate.</li>\n<li>Ensure that all incidents are triaged, tracked, investigated, resolved, and communicated accurately using internal incident management tools and systems. Manage or assist in conducting reviews to capture lessons-learned and ensure regular follow-up for any items identified.</li>\n<li>Conduct trend analyses on past incidents to understand any gaps in coverage and help identify possible incidents before they occur.</li>\n<li>Help expand the incident management program globally. Refine our process, systems and tools, and help expand our support and awareness of emerging product escalations as they occur.</li>\n</ul>",
    "title": "Incident Manager, Trust and Safety"
}