{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Chicago, IL, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWNGePxekFpwdf5zv891uq_5gBB5TF3PYHTgRMZJ_oYSOgASYQ8wiP_FovGW7UlLBi5iQXVwoHCtY8Qrv3Wu4C3arNqya8w1SLstwtCkiJ9XezBc_2AEhIGBr4Q%3D_V2&jobTitle=Partner+Engineering+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T19:31:40.095Z",
    "description": "<p>When leading companies choose Google Cloud it&#39;s a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p>\n\n\n<p>As a Partner Engineering Manager, your goal will be to help build a robust and self-sufficient partner ecosystem capable of driving a significant portion of our business through an indirect channel. We believe that ultimate scale is achieved by investing in and developing our channel business. As educational institutions, government agencies, and other businesses increasingly adopt public and hybrid cloud computing, more than ever they need partners to help enterprises understand and quantify the business and technical benefits. These enterprises also depend on partners to understand the cost and risk of moving to cloud, helping them develop governance models to mitigate for the unexpected.\nPartner Engineering managers possess expert communication, collaboration, and business skills enabling them to develop trusted relationships with the key decision-makers at partners. These relationships will be leveraged to build and drive business plans that expand the reach of Google Cloud.</p><p>From startups building their first app to billion-user consumer companies crunching big data, the Google Cloud Platform gives developers and businesses the most advanced data and analytics solution on the market, along with Google&#39;s secure, high performance infrastructure. Our team of technical account managers and software engineers work with partners across all functions to develop solutions that harness Google&#39;s planet-wide platform to solve the world&#39;s most challenging problems.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/111140923447878342",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-19T19:31:40.095Z",
    "publish_date": "2019-03-19T19:31:40.095Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>10 years of experience serving in the capacity of a Technical Sales Engineer in a cloud computing environment or equivalent experience in a partner facing role (including working as a member of a professional services or systems engineering team).</li>\n<li>Experience in people management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science.</li>\n<li>Experience of web/Internet related technologies, architecture across SaaS, PaaS and IaaS and cloud productivity suites. Understanding of solution architecture within web and mobile environments.</li>\n<li>Understanding of the technology and cloud computing market, and a passion for Google Cloud products.</li>\n<li>Ability to learn, understand, and work with new emerging technologies, methodologies, and solutions in the cloud/IT technology space.</li>\n<li>Ability to present to both technical and non-technical audiences, engaging C-Level in business and technology transformation.</li>\n<li>Ability to inspire and grow teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Hire, coach, and drive a high performance team to enable channel partners to deliver against goals.</li>\n<li>Lead internal planning efforts that prioritize the alignment of people and resources toward qualified activities and toward key go-to-market partners.</li>\n<li>Collaborate with Google Cloud Partner Development Managers to build business plans with partners that define how they will grow their business with Google.</li>\n<li>Work with decision-makers at key partners to increase the adoption of Google Cloud services by investing in building out their Google Cloud capability and readiness.</li>\n<li>Engage with CTOs and other technical leads at key partners to share technology roadmaps as well as the latest innovations, showing the path toward expanding the partnership further.</li>\n</ul>",
    "title": "Partner Engineering Manager, Google Cloud"
}