{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; San Bruno, CA, USA; Sunnyvale, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeYAIfWzeJuaqKyxRmiS3PnM_K5OZ4hzTIUrwX9p1VISOgCPMA3TdqEEwMPNHXGQm9yJ5qVsaZY9AJuJwVspRwSj3N4sHkA5RKexv2BKYIViL-Lc0nsOzSHbKKQ%3D_V2&jobTitle=User+Experience+Researcher&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:45.366Z",
    "description": "<p>At Google, User Experience Researchers (UXRs) help everyone focus on the user. In this role, you will create understanding and empathy around user needs, stated and unstated, for your entire product team including designers, product managers, and engineers. You will do so by conducting primary research, exploring the behaviors and motivations of our users through methods like field visits, ethnography, surveys, usability testing, and logs analysis. Your research will help us create useful, usable, and delightful new products and features for people as well as continually innovating on our existing products. You’ll inspire change at all stages of product development by delivering compelling, written, in-person and visual presentations on your findings.<br><br>The UXR community at Google is unique. As part of our group, you will have the chance to work not only with the other UXRs on your immediate team but to work and learn from UXRs across the company through regular in-person meetups, established mentorship programs, access to our internal research tools, and 20% projects. Google is a place where UXRs can do their best work.</p><div>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</div><div><br></div>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4918453329920000",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-18T20:47:50.779Z",
    "publish_date": "2019-02-27T19:38:56.663Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Anthropology, Human Factors, Psychology, HCI/Computer Science, related field or equivalent practical experience.</li>\n<li>Experience conducting semi-structured interviews, contextual field visits, usability studies either live or remote (e.g. Userzoom or usertesting.com).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or PhD in a related field.</li>\n<li>4 years of relevant work experience.</li>\n<li>Experience integrating user research into product designs and design practices.</li>\n<li>Experience in survey design (e.g. Qualtrics). Working knowledge of statistics and experimental design.</li>\n<li>Strong understanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process.</li>\n<li>Effective interpersonal, communication, negotiation and collaboration skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Conduct independent research on multiple aspects of products and experiences.</li>\n<li>Collect and analyze user behavior through lab studies, field visits, ethnography, surveys, benchmark studies, server logs and online experiments (A/B testing).</li>\n<li>Work with Designers, Product Managers, Engineers and other UXRs to prioritize research opportunities in a fast-paced, rapidly changing environment.</li>\n<li>Understand and incorporate complex technical and business requirements into research.</li>\n<li>Advocate research findings to diverse audiences through written reports and in-person presentations.</li>\n</ul>",
    "title": "User Experience Researcher"
}