{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckV2Q2LWqnWXA7ZsBIxkGASHAVxhT7dMsLVI3OR4XJukSOgASYQ8w8AiyF9NNVKpI-V3tXFjJJ2KQ4WOK-ZtbwWxcvw2dPJQXjb9FxnWhK4HfODT0TmFGoTqMOvI%3D_V2&jobTitle=Commercial+Operations+Program+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T18:32:40.360Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p><p>As a Commercial Operations Program Manager, you&#39;ll be responsible for designing processes that improve customer outcomes and drive customer success with Google Cloud. You will drive enhancements within sales and support processes to improve the customer experience as well as vendor performance.</p><p>You&#39;ll build relationships across teams to find opportunities and build consensus to execute on operational initiatives, and drive those cross-functional teams to success. You have excellent communication, organizational and time management skills and are comfortable working on multiple tasks while meeting strict deadlines. At the same time, you have a bias for execution and a high-level of drive and creativity to constantly improve an area of responsibility.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/119500558403805894",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-13T17:31:40.725Z",
    "publish_date": "2019-03-13T17:31:40.725Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Business or related field, or equivalent practical experience.</li><li>3 years of experience in program management, sales order management or customer service operations in the technology industry.</li><li>Experience with analyzing data, modeling scenarios and drawing conclusions to solve problems.</li><li>Experience managing global and cross-functional projects.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA and/or Master’s degree.</li><li>Project management (PMI, PMP) or process improvement (Six Sigma) certification.</li><li>Experience in identifying business opportunities and defining and measuring success of proposed initiatives.</li><li>Knowledge in Google Cloud Platform, G Suite and Google Maps.</li><li>Comfort with SQL, data manipulation, reporting, and quantitative analysis.</li><li>Ability to influence people at all levels of an organization and drive changes, and think strategically and creatively. Ability to balance internal and external factors when identifying problems/strategies, proposing solutions, and making decisions.</li></ul>",
    "responsibilities": "<ul><li>Lead cross-functional programs and be a subject matter expert on new systems and infrastructure program initiatives. Collaborate with stakeholders by gathering requirements, defining scope, creating business cases, developing project plans and schedules, and driving and managing implementation/deployment.</li><li>Create and document solutions for process optimization or automation in order to improve customer experience and operational efficiency.</li><li>Develop and implement management processes, metrics, and reporting instruments to ensure program success.</li><li>Manage risks, anticipate bottlenecks, manage program prioritization, make trade-offs, and balance business needs versus technical constraints.</li><li>Communicate impact of programs to management. Publish documentation and best practices procedures.</li></ul>",
    "title": "Commercial Operations Program Manager, Google Cloud"
}