{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckY4CguG7-dh1wFE2cqQFlOrWxzTcFLzV-RBaeAsqQe4SOgCPMA3TaMdMmY3Nc7MHTVyATuzkZNpg-9gLMkGTjOJf_LkMHEsYnxHUhfI5Erpl_mbT9dQinreVUUQ%3D_V2&jobTitle=Finance+Project+Business+Functional+Lead%2C+Financial+Planning+and+Analysis&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-23T16:31:42.532Z",
    "description": "<p>Finance Project Managers drive critical priorities for Google by leading and assisting in projects of all sizes. Drawing from your strong financial background, you work with a diverse team to manage projects from concept to implementation and keep Google-wide stakeholders informed as you go. You get down into the details of complex analyses without losing sight of the overall objective. When working on multiple projects at once, you intuitively know which issues to highlight and can bring key decision makers together to come up with effective solutions. Once a project is completed, you&#39;re able to clearly communicate the results and draw the key learnings for senior management. You are efficient and organized, making the most of everyone&#39;s abilities and holding the team to a high standard.</p>\n\n<p>As a Business Functional Project Lead, you will manage your assignments through the entire project lifecycle working closely with Finance, Corporate Engineering teams, and Professional Services partners to deliver on goals. You&#39;ll work with Finance teams on complex projects to establish overarching strategy, goals, and objectives, define requirements, design new business processes and data, structure and implement projects, and communicate status to stakeholders. \n</p>\n\n<p>In this role, you will work closely with multiple groups leveraging your knowledge of Finance processes and systems to build relationships and develop solutions that meet our future business requirements. Additionally, you&#39;ll leverage an understanding of Finance processes in the areas of Financial Planning and Analysis (FP&amp;A), Management, and Internal Reporting, to evaluate alternatives, guide decision making, solve challenges, provide analytical insight, and business judgment to support strategic and tactical initiatives across the organization.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4889959802404864",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:45:12.431Z",
    "publish_date": "2019-02-27T19:52:51.080Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of relevant work experience. Experience in Finance systems, ERP platforms, and Finance business processes in the area of FP&amp;A Management and Internal Reporting.</li>\n<li>Experience in a business process improvement function, defining business requirements, evaluating options/alternatives, process, and data design as part of a team. Experience in project management, system development lifecycle, and leading and/or supporting cross-functional transformation initiatives.</li>\n<li>Experience leading discussions in a cross-functional groups.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA/CA/MBA, Master&#39;s degree, or PhD.</li>\n<li>Ability to work in a fast-pace, fast-changing environment.</li>\n<li>Ability to lead discussions, identify solutions to challenges, and influence key decisions.</li>\n<li>Ability to facilitate discussions with executives to arrive to key decisions with excellent business judgment.</li>\n<li>Ability to work under deadlines with excellent team management and organizational skills.</li>\n<li>Excellent problem-solving, process improvement, change management, team management, and analytical skills. Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Structure projects with your team and stakeholders by defining strategy, scope, goals, objectives, and success criteria. Develop comprehensive plans and lead projects/team through the entire project lifecycle for quality delivery of scope, on-time, within budget, and achieve success criteria.</li>\n<li>Establish and lead working group meetings to understand as-is, identify gaps/propose improvements, evaluate solution alternatives, and prioritize requirements, Identify and design data, and drive consensus to achieve agreed set of requirements.</li>\n<li>Provide key stakeholder management, engagement, and alignment for project success, including clearly communicating status, risks, and remediation plans to executive stakeholders.</li>\n<li>Partner with Finance leaders to deliver change management to ensure new processes and technologies are deployed effectively and adopted by the organization.</li>\n<li>Define and manage key metrics in order to measure business impact of process improvements. Resolve challenges that arise for areas of responsibility keeping in mind impacts to the project timeline and to other programs/projects.</li>\n</ul>",
    "title": "Finance Project Business Functional Lead, Financial Planning and Analysis"
}