{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYt2CAdEFCq89DgnvjoGzR0vdZrUXCbSm7tP9jtaZ1kSOgASYQ8wCiMuN7ydCarkFvcqp7veNbzbW5v3nJx_VtPzlwdK2D-ZYj90tDujoTNrCZHGl00qPlb3DU4%3D_V2&jobTitle=Lead%2C+Vendor+Operations%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T22:31:45.693Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n\n<p>We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, often with an eye to finding industry-wide solutions. Trust and Safety team members are motivated to find innovative solutions and use technical know-how, user insights, and proactive communication to pursue the highest possible quality and safety standards for users across Google products.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/122901484904817350",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:23.346Z",
    "publish_date": "2019-02-27T19:49:23.346Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Applied Mathematics, Statistics, Quantitative Social Sciences or equivalent practical experience.</li>\n<li>Experience in working with SQL, database structures, and developing reporting/data visualization tools.</li>\n<li>Experience in writing code in a common web or mobile development language such as Java, Javascript, Python, GO, or PHP.</li>\n<li>Ability to travel up to 10% of time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of experience on a Trust and Safety team.</li>\n<li>Experience in consulting.</li>\n<li>Experience delivering data insights using Dremel or SQL. Strong technical competency, with a data-driven analytical approach towards solving complex challenges.</li>\n<li>Ability to present results of complex analysis compellingly to both technical and non-technical audiences at an executive level.</li>\n<li>Interest and demonstrated ability in mentoring peers and coaching teammates on analytical projects.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Monitor, analyze, and evaluate operation performance and results. Support the creation of hypotheses to deliver efficiency improvements and increasing quality initiatives.</li>\n<li>Synthesize and present quantitative results to an executive audience of product management and vendor operations colleagues.</li>\n<li>Analyze data related to vendor operations, productivity, and quality to identify opportunities for program management teams.</li>\n<li>Prioritize and implement top business intelligence needs for vendor partners.</li>\n<li>Leverage data visualization packages and tools to deliver real-time results to stakeholders. Assist in development of business plans and global vendor budgets.</li>\n</ul>",
    "title": "Lead, Vendor Operations, Trust and Safety"
}