{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVX1JsfvxguYI-bUq50Xtq0hTwYFnmS8PaebI0GkHp4SOgASYQ8w1m5NMs5DkxvgYkvc7q3NQb7_Qw9YFGZ5_VtK-ZB7k5oEq14qUn3bTS70Tz4JTSazJ4GfDb0%3D_V2&jobTitle=Communications+Associate%2C+Developers&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T21:31:48.902Z",
    "description": "<p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns based on understanding of journalists&#39; interests; engage in face-to-face meetings with commentators and other opinion formers; develop print and web-based material supporting these campaigns; and counter misinformation that might interfere with our business and ability to serve our users. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.</p>\n\n\n<p>As a Communications Associate you will be a full-time associate working on Developer PR supporting the Platforms and Ecosystems organization. From media outreach and project management, to message development and weekly reporting, you will provide daily PR support for the many facets of developer initiatives across all of Platforms and Ecosystems, including our two largest platforms, Android and Chrome, as well as our annual Google I/O developer conference. In this role, you will foster and maintain relationships with reporters across consumer, business, and tech press, and drive positive, impactful media coverage for the product. You are able to take initiative and maintain a positive attitude, demonstrating communications and problem-solving skills.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values, and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be able to combine creativity with the organizational skills to manage numerous different projects to tight deadlines simultaneously, as well as enjoy pitching to all kinds of journalists, bloggers and commentators (we find it hard too!), or producing internal communications and events for our employees. Things happen quickly at Google and to get stuff done here you need to be an enthusiastic team player - a self-starter who can work cross-functionally and isn&#39;t frightened to take risks or try out new ways of doing things.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/126540830811792070",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:55:36.886Z",
    "publish_date": "2019-02-27T19:55:36.886Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in a business, media, or non-profit environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in mobile/web technologies and/or technology PR and relationships within technology, business, and developer press.</li>\n<li>Experience providing communications guidance to executives and devising communications strategies.</li>\n<li>Ability to think, plan, and execute on multiple projects simultaneously in an organized fashion and work efficiently with a global team of colleagues and cross-functional stakeholders.</li>\n<li>Ability to work calmly and maintain good judgment in fast-paced, high-stress environments.</li>\n<li>Excellent written and verbal communications skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work closely with executives and cross-functional teams (e.g., policy, marketing, events, engineers, operations) as communications lead for our annual developer conference, Google I/O.</li>\n<li>Devise press strategies and provide communications guidance related to Google’s Developer programs and initiatives, supporting Google’s Developer Relations team and developing compelling communications materials, including story pitches, statements, and blog posts.</li>\n<li>Develop and maintain close productive relationships with journalists, key partners/influencers in the tech, business, and developer press.</li>\n<li>Understand industry-wide and Google’s developer initiatives and pitch stories highlighting the company’s leadership in this space.</li>\n<li>Represent Google as a company spokesperson, as needed.</li>\n</ul>",
    "title": "Communications Associate, Developers"
}