{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckduX4sEBnTdjO6PdUmhCcOP-gCI1nPH6bjUmcQ1zp50SOgCPMA3TbAOC4Cr7Z-FhrKGvEeStV_ptQEE_YBYUce384IdWR-MI7o_sNsFhciUA_HF_3GAOhGSbjn8%3D_V2&jobTitle=Technical+Program+Manager%2C+Software+Engineering+Program&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:32:44.499Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>By applying for this role, you will be considered for the following areas: Advertising, Chrome and Apps, Mobile, YouTube and Video, and Communications</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5674039814324224",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:33:42.683Z",
    "publish_date": "2019-02-27T19:43:55.736Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS degree in Computer Science, Engineering, Mathematics, Statistics, related fields or equivalent practical experience.</li>\n<li>Software development experience in one or more general purpose programming languages: Java, Python, C/C++.</li>\n<li>Experience working with one or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, machine learning, information retrieval, natural language processing, networking, developing large software systems, and/or security software development.</li>\n<li>Cross-functional Program Management experience working among several groups such as: design, product management, engineering, and business stakeholders.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Comfortable technically reviewing code and participating in design/architecture reviews.</li>\n<li>Ability to understand technical subjects and emerging technologies, and their relevance to the marketplace.</li>\n<li>Ability to influence as a member of a highly integrated team composed of both technical and non-technical members.</li>\n<li>Interest and ability to learn other technical areas as needed.</li>\n<li>Strong communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive the engineering coordination and execution focused towards launching various new projects.</li>\n<li>Collaborate with cross-functional engineering teams (Software, Test, systems and infrastructure) and product teams in developing project schedules, milestones and risk analyses.</li>\n<li>Coordinate with stakeholders to manage, track and control project issues to ensure timely delivery of products.</li>\n<li>Develop reports to track planning, scheduling, issues, risks and overall status.</li>\n<li>Oversee the creation of new processes and tools as necessary to support additional needs and requirements of a fast-growing business; exercise technical judgment to keep goals for programs, projects, and products realistic and attainable within a given timeline.</li></ul>",
    "title": "Technical Program Manager, Software Engineering Program"
}