{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdwViLsNJ7zLy-uk75VA4nS06w2IdXFUGetUIYbgJ-cSOgASYQ8wjuIHSol1kJnKIGiKIRWGnM-bz-KTNGctSBmtAKoRFtXTk90sINyUY_SRPeujTTneht3cHGI%3D_V2&jobTitle=Business+Compliance+Manager%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-12T16:01:55.452Z",
    "description": "<p>YouTube&#39;s Technology Services team is a global organization dedicated to developing and managing the company&#39;s largest and most strategic partnerships. We work closely with the YouTube product, engineering, and content teams to address our partners&#39; most pressing and complex technology challenges. As a Business Compliance Manager, you&#39;ll lead deployments, optimize implementations, and handle integrations to build strong, successful, long-term partnerships.</p>\n\n\n<p>Our team ensures that YouTube&#39;s processes/ecosystem are healthy, optimized for efficiency and compliant with Google standards.\n</p>\n\n\n<p>In this role, you&#39;ll program manage, audit, and track agreements with our Business teams and partners. You&#39;ll work with cross-functional teams, and you&#39;ll develop practical and innovative ways to meet YouTube’s needs. You&#39;ll also support operations, and ensure that services are provided and are compliant.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/84877580148056774",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-12T16:01:55.452Z",
    "publish_date": "2019-03-12T16:01:55.452Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of project management, process improvement, or legal operations experience.</li>\n<li>2 years of management consulting experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of experience in management consulting and/or within law departments/firms.</li>\n<li>Cross-functional operational experience in managing expectations with senior stakeholders.</li>\n<li>Ability to write complex SQL queries and query large databases.</li>\n<li>Ability to analyze data and create succinct presentations tailored to an audience.</li>\n<li>Ability to scale operations for complex processes and programs.</li>\n<li>Excellent attention to detail, time management and multitasking/prioritization abilities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead operations for YouTube, including working closely with the Business, Compliance, Finance and Legal teams on content licensing and service agreements with YouTube’s partners.</li>\n<li>Create visibility of renewals/terms of key partner agreements across YouTube verticals for all Direct/Online Partners.</li>\n<li>Identify additional issues in systems, work with teams to resolve. Build expertise on our internal tools, systems, business rules and data.</li>\n<li>Advise on and track obligations for partners, set strategy and program manage, and introduce controls to track new terms signed by partners.</li>\n<li>Improve YouTube API operations and help reduce business risk.</li>\n</ul>",
    "title": "Business Compliance Manager, YouTube"
}