{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQ9LwLvOeX7gLC980e4d-Vre5ezLJgpUMikD_r5gx1USOgASYQ8w4z6sOmTx3FCdqRL5YS0Pc_dm5xHLK_AMTVE7KqlsxOTPRHLge1xWLOu3MKZ-q93WjPmCgao%3D_V2&jobTitle=Strategic+Partner+Development+Manager%2C+Global+Distribution+Partnerships&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T18:01:52.222Z",
    "description": "<p>Google&#39;s line of products and services to clients never stops growing. Partner Development Managers have the rare opportunity to build a long-lasting relationship with our top partners. You cultivate these existing partnerships to make sure they can take full advantage of Google&#39;s ever-growing suite of offerings. You possess strong relationship-building skills and are apt to see mutually beneficial opportunities with partners in order to best represent our users, products and programs.</p>\n\n\n<p>As a Partner Development Manager on the Global Distribution team, you&#39;ll lead a broader cross-functional team to formulate a strategy that will allow us to meet our goals against the backdrop of complicated platform ecosystem dynamics. Once the strategy is set, you&#39;ll evaluate partnership opportunities, engage with prospective partners, work on agreements, and see the agreement through to execution. You&#39;ll also work strategically with our existing partners to broaden and deepen relationships.</p><p>The Global Partnerships organization is responsible for exploring new opportunities with Google&#39;s partners. Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The Global Partnerships team supports Google’s own Product teams with essential partnerships to help Google’s user experiences in advertising, Search, Assistant, Maps, Travel, Shopping, Payments and more. Teams create product-enabling partnerships, go-to-market strategies and incubate business growth for a variety of products.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/118432979857875654",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-13T18:01:53.115Z",
    "publish_date": "2019-03-13T18:01:53.115Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>5 years of experience in a tech business development role, strategy experience in consulting, finance or other strategic/analytical field.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA and/or JD degree.</li><li>Experience in negotiating agreements through to execution.</li><li>Demonstrated strategy acumen, with experience in using analytical insights and employing thoughtful structures to solve problems and communicate solutions.</li><li>Ability to work in fast-paced, collaborative, and ambiguous environments where thoughtfulness, an entrepreneurial mindset, persistent execution, and ability to form relationships drives success.</li><li>High-level of comfort in escalating and presenting key issues and recommendations to leadership when appropriate.</li></ul>",
    "responsibilities": "<ul><li>Collaborate with a large cross-functional team to develop broad responses, including the ownership of our broader product distribution strategy, to platform ecosystem challenges and opportunities.</li><li>Develop, and maintain direct relationships with key distribution partners and prospective partners.</li><li>Lead a cross-functional team to structure, negotiate, and develop strategic complex agreements.</li></ul>",
    "title": "Strategic Partner Development Manager, Global Distribution Partnerships"
}