{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckfc9Jkf8B_E8IKegzy0qBTbfhyoQMcY9fdB6MhQAoN8SOgASYQ8wbmez0hQ7OfqlE_0HBAvUXifUpiAtv-7DvoUU5du3WhGgJQiLWfNTuWE4UjVjjlO22Yt9AwM%3D_V2&jobTitle=Compliance+Analyst%2C+Third+Party+Data+Protection&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-27T23:01:56.252Z",
    "description": "<p>The Google Compliance team makes sure that our business is always consistent with the current financial regulations. Comprised of master jugglers, this team balances Google&#39;s legal and compliance requirements with the dynamic needs of our users and the values of our company. As part of this team, you proactively identify pain points and gaps in existing policy frameworks and find innovative solutions. You develop efficient compliance systems and work with teams to implement these across the organization. You are thorough in all you do and see to it that as Google pursues our next big idea, we always have our bases covered.</p>\n\n\n<p>We oversee and implement Google’s Third-Party Data Protection and Compliance program, responsible for the company’s due diligence operations of the program; monitoring and reporting on program compliance; development, implementation, and maintenance of policies and procedures; investigation and tracking non-compliance; and leading projects across stakeholders. The team works closely with Legal, Information Security, and Product teams, Internal Audit, Finance, and Privacy Governance (PDPO). \n</p>\n\n\n<p>Ethics and Compliance is a group of lawyers and compliance professionals who operate on a global stage. We work at the crossroads of new technologies and existing laws to provide answers and help Google build innovative and important products for our users around the world.</p><p> </p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/112325430599393990",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-11T16:01:58.678Z",
    "publish_date": "2019-03-11T16:01:58.678Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>4 years of work experience in data analytics and modeling.</li><li>Experience with data privacy and information security risk management.</li><li>Experience planning and leading cross-functional projects.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>Certified IAPP/CIPP.</li>\n<li>Experience with GDPR, ISO, NIST, HIPAA and/or other risk-centric standards and practices helpful.</li>\n<li>Ability to work on a broad variety of matters from the complex matters to the routine standard matters.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work on multiple projects simultaneously and prioritize work to meet adapting deadlines.</li>\n<li>Develop detailed recommendations for mitigating findings and process improvement projects. Use local systems and advanced spreadsheet functions for regular reporting.</li>\n<li>Provides guidance and assist in the identification of compliance, risks, implementation, and maintenance of organizational vendor privacy compliance processes and procedures in coordination with information Security, Internal Audit, Product Management, and Legal teams.</li>\n<li>Assist with procedures for vetting and auditing vendors for compliance with the privacy and data security policies and legal requirements.</li>\n<li>Assist in the design and implementation of compliance programs and initiatives.</li>\n</ul>",
    "title": "Compliance Analyst, Third Party Data Protection"
}