{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZe1Bch18YjsF5aSJBmt2kzIRH54gfR3wJCM9o8nvZ4SOgCPMA3T_7rsMD1yOVr2qXUQFWWMJiGkULJsUNFk-LTPhQQOxfKnInhl52wgnqZAR8ghxB6a3-HkgYo%3D_V2&jobTitle=Technical+Lead%2C+GPU+System+Software&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:14.594Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to handle new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n<p>GPUs sit at the core of the current machine learning wave that is changing the world across industries -- better health, self-driven cars, voice recognition, language translation, better understanding of consumer behavior.\n</p>\n\n<p>As a Technical Lead, you are expected not only to be strong technically and roll up your sleeves, but also provide technical leadership to major projects and mentor a team of engineers. You manage your project’s technical goals, contribute to product strategy and help develop your team. \n</p>\n\n<p>With extensive technical and leadership expertise, you will ensure a high level of quality in the shipped products and assist in making operations cost efficient. You will also be responsible for working with internal and external customers and product managers to ensure requirements are understood and translated into a deliverable roadmap.\n</p>\n\n<p>Platforms Engineering performs research, design and development for the hardware, software and networking technologies that power all of Google&#39;s products and services (including Google Cloud Platform, Android, Chrome, VR, Gmail, Maps and more). We constantly work on solutions and this team offers impactful projects at every level of the technology stack, from the chip level to massive distributed systems design and software development.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5104577030586368",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:42:12.967Z",
    "publish_date": "2019-02-27T19:42:12.967Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Experience with high performance computer architectures (CPU, memory subsystem, GPUs, PCIe, fast networks, multiprocessing).</li>\n<li>Experience writing and debugging systems software (kernel, device drivers, firmware, compiler)</li>\n<li>Experience with shipping software. Experience leading several cycles of shipping and supporting a product with wide usage (either many users or large scale deployments).</li>\n<li>Experience working with stakeholders outside the team, such as operations, vendors or partners.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MS degree in Computer Science or a PhD.</li>\n<li>Experience developing and adhering to industry standards</li>\n<li>Experience with virtualization and cloud.</li>\n<li>Experience with open source development</li>\n<li>Expert in GPU&#39;s.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish and maintain solid software engineering practices across scoping/planning, development, testing, release and sustenance.</li>\n<li>Ensure a high level of quality in the shipped product and generally help make operations cost efficient.</li>\n<li>Work with internal customers and product managers (machine learning, Cloud and others) to ensure requirements are understood and translated into a roadmap.</li>\n<li>Work closely with stakeholders (GPU vendors, Google hardware and software development and test teams, users) to deliver on the roadmap.</li>\n<li>Provide status, iterative releases, focus on quality and velocity, and enable design/roadmap decisions as needed.</li>\n</ul>",
    "title": "Technical Lead, GPU System Software"
}