{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZvy4UcLY4Dx23m5NrWdvQct-lt4UKjvZtHq3fIw_UYSOgASYQ8wjsYqxEMaUYyPat5Fam4vJ6xQoFyE-b3VsMs8znGx3hJ_qGgydtPGEYHjc_BfSFxpfJTVobY%3D_V2&jobTitle=Sales+Specialist%2C+G+Suite%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T18:31:55.859Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>Our team of engineers, product managers, and sales and marketing professionals work with a vast array of partners and customers to advance the company&#39;s mission to organize the world&#39;s information to make it universally accessible and useful. In this role, you will create and execute the sales strategy. This role requires unique insight in applying Google G Suite solutions to large enterprises, navigating acquisition processes.\n</p>\n\n\n<p>As a member of the Google Cloud team, you&#39;ll inspire companies to work smarter with G Suite tools. You&#39;ll represent the innovative power of our products to make organizations more productive, collaborative and mobile.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/140065629274022598",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-11T18:31:55.859Z",
    "publish_date": "2019-03-11T18:31:55.859Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of relevant experience in SaaS, IaaS and PaaS sales.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>12 years of experience selling to enterprise clients.</li>\n<li>Experience successfully meeting and exceeding goals.</li>\n<li>Demonstrated understanding of the entire suite of Google Cloud products.</li>\n<li>Effective relationship building/growing skills, with the ability to deliver results simultaneously in a cross-functional environment.</li>\n<li>Effective written and verbal communication skills and excellent interpersonal, problem solving and analytical skills, with the ability to plan, pitch and execute territory sales strategies.</li>\n<li>Ability to travel as required.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with the wider Google Account teams to provide guidance to develop campaigns and build a pipeline of customers within selected regions and verticals.</li>\n<li>Build and maintain executive relationships with customers, influence long-term strategic direction and act as a trusted advisor.</li>\n<li>Develop strategies to accelerate sales opportunities.</li>\n<li>Gather, manage and direct a virtual team during the sales cycle.</li>\n<li>Work collaboratively with the team to grow business with new G Suite customers.</li>\n</ul>",
    "title": "Sales Specialist, G Suite, Google Cloud"
}