{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYSvnDzkS3xWLsyIozr8Zx7kty1ROb_jvCl6sAkjn1YSOgCPMA3TfkC-qW2_ZXznuyd36Bjf9pIKb5QUVgq3VtaYCm-6GmZEUZ6vEJenP7stmBTGY1MzbvR8Ga4%3D_V2&jobTitle=Senior+Portfolio+Risk+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-07T20:31:51.479Z",
    "description": "<p>Google&#39;s Treasury team is on a mission to optimize the return on Google&#39;s financial assets. As a member of this team, you&#39;re always looking for innovative ways to help Google invest for the future while limiting volatility and material surprises. In addition to risk busting and asset management, you work collaboratively to administer business insurance programs and stock programs, and provide financial analysis support to our internal teams. You make creative yet calculated decisions that are backed by both experience and your extensive knowledge of the economy and financial industry.</p>\n\n<p>As the Senior Portfolio Risk Analyst, you will provide independent risk oversight and insights on Alphabet’s Treasury investment portfolio. This will include providing independent measurement and analysis of portfolio performance, activity, risk, and stress testing along with leadership in design of reports and analytical projects. In partnership with portfolio managers, you will advise on risks in the portfolios in terms of market dynamics, asset classes, security types, factors, liquidity, and counterparty risks. As an experienced member of the Risk team, you will be ready to effectively communicate with portfolio managers and executive management. Through your interactions, you will help inspire a culture with a risk management mentality across the Treasury organization.</p><p> </p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4912500290289664",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:47:05.648Z",
    "publish_date": "2019-02-27T19:43:42.247Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor degree in Finance, Economics, Engineering, Statistics, similar quantitative field, or equivalent practical experience.</li>\n<li>6 years of experience in the finance industry.</li>\n<li>3 years of experience at an asset management firm.</li>\n<li>Experience with financial markets and instruments, the asset management business, and portfolio risk management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or PhD in Finance, Economics, Engineering, Statistics, or similar quantitative field.</li>\n<li>CFA charterholder.</li>\n<li>Experience working with fixed income asset classes.</li>\n<li>Experience with analytic systems (e.g., Aladdin, Bloomberg, RiskMetrics) and excellent quantitative and statistical analysis skills.</li>\n<li>Ability to develop an independent point of view and think critically.</li>\n<li>Ability to conduct research and translate quantitative data into meaningful interpretations. Ability to influence with excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish and maintain sound risk management practices and a risk frameworks for portfolio management, including setting appropriate risk constraints, risk budgets, stress testing, backtesting portfolios, and assessing the appropriateness of trading positions from a risk standpoint.</li>\n<li>Measure and assess portfolio performance, conduct attribution analyses, and report results to management, decompose and explain expected portfolio risk at a detailed level, and conduct custom analysis to support the risk oversight process for the relevant portfolios.</li>\n<li>Help design/improve quantitative models/tools to help monitor and manage risk as well as explain performance.</li>\n<li>Build and maintain excellent knowledge of products, investment processes, trading strategies, and market characteristics. Be knowledgable about regulatory requirements/environment.</li>\n<li>Work with the Portfolio Management team to ensure portfolio management activities and objectives are aligned with strategic objectives and views.</li>\n</ul>",
    "title": "Senior Portfolio Risk Analyst"
}