{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeVcvUjmB-PiraD4UEYNbqonKTNloUYah7aWhJyn79USOgCPMA3TseCIqKZ5Fa_g2GGNUcg67pyG6-wGE3ejXrj2evZJZigzTuDIQEzW3Wnk0pB4RHBN3hM8ZgE%3D_V2&jobTitle=Vendor+Manager%2C+Global+Vendor+Operations%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:03:25.659Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>As a Vendor Manager, you will manage critical workflows operated by vendors within the region and lead a team of vendor managers. You will be establishing the operation at one or more sites and partnering with stakeholders, cross-functional teams and suppliers to make it a success. This role includes overall management responsibility for provisioning and enabling the vendors to operate as outlined in the Statement of Work (SOW). You will also manage sections of the long-term global operational strategy and support model, including outsourcing decisions, agreements, vendor selection and continuous improvements of business processes.</p><p>You will be responsible for end-to-end YouTube vendor operations. You will work on YouTube Products to enable support for users and creators across channels. You have detailed knowledge of our constantly evolving product suite to ensure that user feedback flows to the stakeholders and product team and fuels innovation. In this highly cross-functional role, you are the voice of our users and problem-solve with the internal teams. You process suggestions, bugs, abuse and other product information to ensure we are constantly improving the user experience.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5119217886232576",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:02.653Z",
    "publish_date": "2019-03-07T01:32:02.653Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in consulting or cross-functional program management.</li>\n<li>Experience in operations and strategy and planning.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience delivering results through cross-functional interaction with sales, marketing, finance, product development and other functions.</li>\n<li>Ability to influence cross-functionally.</li>\n<li>Excellent communication and negotiation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be accountable for operations by managing overall vendor performance in region, driving vendor selection, consultation and overall vendor operations strategies.</li>\n<li>Develop and maintain the overall regional workflow strategy. Identify and mitigate risk from a delivery standpoint and ensure compliance with all internal policies and procedures.</li>\n<li>Deliver efficient and effective escalations in line with the established policies and procedures.</li>\n<li>Lead regular business reviews and vendor relationship management activities. Partner with cross-functional teams locally and globally to drive continuous vertical improvements and efficiencies at scale.</li>\n<li>Contribute to global initiatives by defining and realizing overall operations strategy. Work closely with various internal groups to understand business requirements, implement new processes and contribute to ongoing process improvements.</li>\n</ul>",
    "title": "Vendor Manager, Global Vendor Operations, YouTube"
}