{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdxo5inkhyB7FJq6q8lOIEaphS69Lw37wTbIA_jQf9wSOQASYQ8wRphhYDBEpGHkMO41n0CsHYHn1LDSGYxfW7WY-69OEiM8wc-dp_j8qRpuhUHX7e-SzO5-bA%3D%3D_V2&jobTitle=Support+Communications+Content+Strategist%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-21T21:01:48.870Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, presenting unique challenges and opportunities to support over a billion monthly users globally. Fast-paced, dynamic, and proactive, the YouTube Support team provides seamless, brilliant support to our content creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it, and to allow our users’ voices to help shape product solutions. <br><br>As a member of the Support team, you&#39;ll analyze top issues facing our users and content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you&#39;ll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.<br></p><p>As a Support Communications Content Strategist, you will drive the development and the consistency of support content across multiple channels, including internal knowledge bases and canned responses. You will effectively translate complex concepts into friendly, easy-to-read content that reflects YouTube Editorial guidelines. You will also manage large content databases and work cross-functionally to craft high-quality material that balances user and business objectives. Additionally, you understand how to create internal and external resources, online writing, and user education best practices while maintaining a focus on the user.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/75321631578170054",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T01:01:57.358Z",
    "publish_date": "2019-03-06T01:01:57.358Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in online operations and/or web development.</li>\n<li>Experience managing and writing for internal knowledge bases.</li>\n<li>Experience writing social communication responses to support questions.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in online content production, editing, UX writing, or marketing content for consumer-focused communications.</li>\n<li>Experience writing benefit-oriented, consumer-focused copy. Understanding of user experience principles, rich media, and social media.</li>\n<li>Ability to take initiative and work independently and on multiple initiatives at the same time.</li>\n<li>Ability to work globally and cross-functionally in an ambiguous environment.</li>\n<li>Excellent project manager and problem-solving skills. Excellent business judgment.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create and edit articles and canned responses. Help set and shape guidelines for internal support content and advocate writing best practices.</li>\n<li>Collaborate with multiple teams at YouTube to develop and execute the support strategy. Work with content at many levels (e.g., information architecture, style guides, templates, analytics).</li>\n<li>Build, maintain, and improve some of YouTube’s internal knowledge bases as well as canned responses for email, chat, and, social support teams.</li>\n<li>Analyze metrics to identify pain points and improve support content. Set quality standards and measure content quality.</li>\n<li>Partner with product specialists, subject matter experts, vendor operations and training, and other editorial groups to ensure content consistency and transparency.</li>\n</ul>",
    "title": "Support Communications Content Strategist, YouTube"
}