{
    "application_instruction": "<i> In school or graduated within last 6 months?  We encourage you to apply to openings on the <a href=\"https://careers.google.com/students/\">Students Job Site</a>.</i><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: San Bruno, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQzZ6alcOwo-IsrcVGlv2TBWD1J02biSSHY4BySHXKQSOgCPMA3T9A5mTH7o0wtkcXG7tRDETKQgqYRiziaGoLArGSJN8O5OoUvk_-iHCAHGgg6-B3Mr2fUFpvM%3D_V2&jobTitle=Software+Engineer%2C+YouTube&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:07:00.468Z",
    "description": "<p>YouTube&#39;s software engineers develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. Our ambitions reach far beyond just Search. Our products need to handle information at the computer science, including information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, and user interface design; the list goes on and is growing every day. As a software engineer, you work on a small team and can switch teams and projects as our fast-paced business grows and evolves. You will adapt quickly and be excited to solve new challenges as we continue to push technology forward. With your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6086930221694976",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-07T00:31:56.411Z",
    "publish_date": "2019-03-07T00:31:56.411Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS degree in Computer Science, similar technical field of study or equivalent practical experience.</li>\n<li>Software development experience in one or more general purpose programming languages.</li>\n<li>Experience working with two or more from the following: web application development, Unix/Linux environments, mobile application development, distributed and parallel systems, big data, machine learning, information retrieval, natural language processing, networking, and/or developing large software systems.</li>\n<li>Working proficiency and communication skills in verbal and written English.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s, PhD degree, further education or experience in engineering, computer science or other technical related field.</li>\n<li>Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, or JavaScript.</li>\n<li>Interest and ability to learn other coding languages as needed.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design, implement and launch highly-visible, user-facing features.</li>\n<li>Develop new ways for YouTube users to find interesting content.</li>\n<li>Design and develop large scale web applications.</li>\n</ul>",
    "title": "Software Engineer, YouTube"
}