{
    "application_instruction": "<b>This application is intended for candidates that are eligible for full-time authorization in the United States upon completing their education. If you do not meet this requirement, please consider applying for international opportunities. Please check for opportunities in the office where you are eligible for full-time authorization.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf0Ty-Q9LskiMJRcLGZv0kh_Ap41xp3FX7doHQ7vd30SOQCPMA3T543oZS6Gm2tXa2qfriHcLIOuiFhXXIhh6Yk6b3Jid3PFWeh3LCEupZQoTWeqnYWSjAirUw%3D%3D_V2&jobTitle=Cloud+Technical+Residency%2C+University+Graduate%2C+2019+Start&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:45:18.043Z",
    "description": "<p>The Cloud Customer Engineering, Cloud Professional Services (PSO), and Cloud Technical Support teams provide technical expertise across the full Google Cloud portfolio of products to prove the value of, deploy, and provide ongoing support of the technology to our customers. These teams are on the front lines of leading customers through the largest technological shift in the history of the IT industry. They are the consultants and engineering gurus that help customers understand the unique value of and transformational benefits that result from applying these technologies to their business workloads. \n</p>\n\n<p>As a part of the Google Cloud Technical Residency Program you will have the unique opportunity to work in different Google Cloud roles under the direct mentorship of experienced staff members. Before you start projection rotations, you will undergo training to prepare you to add value on day one of your customer engagements. The project rotations include opportunities to work with partners, engage in technical solution validation, develop scalable tools, demos and related assets, and provide implementation, advisory and support services to Google customers across a wide spectrum of industry and scale. \n</p>\n\n<p>You will also have the opportunity to develop your business and product skills by working on a range of projects, such as building tools to automate and scale business processes, come up with different Google products to create custom solutions, and provide data driven insights to Google’s internal sales and product teams.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5902393864421376",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-18T23:31:36.747Z",
    "publish_date": "2019-03-18T23:31:36.747Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or related technical subject, or equivalent practical experience, with the ability to start full-time employment by July 2019.</li>\n<li>Experience in web technologies such as CSS, HTML, HTTP, JavaScript/AJAX and XML.</li>\n<li>Experience with developing programs/scripts in languages such as C++, Java, Python, Scala or SQL.</li>\n<li>Evidence of customer service experience, demonstrated through coursework, internships, project work and/or other outside interests.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in systems software and algorithms, working with Linux/Unix and APIs.</li>\n<li>Database design and SQL Query construction experience.</li>\n<li>Ability to adapt your message to the technical level of the audience and comfortable presenting technical materials.</li>\n<li>Excellent analytical, organizational, problem solving and troubleshooting skills.</li>\n<li>Business acumen with strong customer service and communication skills.</li>\n<li>Ability to travel.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Contribute to the design, development, and implementation of prototypes, demos, and proof-of-concept components in support of in-flight customer opportunities. Help build creative solutions to challenging customer questions, RFPs, or other obstacles encountered in customer engagements.</li>\n<li>Team with customer technical and implementation leads and partners to manage and drive successful adoption of Google Cloud. Interact with sales/partner leads and technical stakeholders to translate complex customer requirements into recommendations for solution architectures and consulting services.</li>\n<li>Guide customers through the entire innovation lifecycle, building strategic roadmaps and driving achievement of key milestones.</li>\n<li>Help in customer day-to-day challenges by delivering scalable solutions and troubleshooting their problems. Understand operational workflows, identify and define tool needs to enable operational scaling, and drive the development (initial and ongoing) and deployment of these tools.</li>\n<li>Improve product feature offerings by providing partner feedback to internal cross-functional teams including Product Management and Engineering.</li>\n</ul>",
    "title": "Cloud Technical Residency, University Graduate, 2019 Start"
}