{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeLnaIeiUrP7S_ZtlFtQTYKDizQSsRL2adyHyDRvrXYSOgCPMA3T4IJ1ordmWdSKEV9QtrGdVf8u3dGBp_pImyzTs2JUDSZ-Mcww6tjPOuoDIue90kjSp9v8e-Y%3D_V2&jobTitle=Technical+Solutions+Engineer%2C+Stadia&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:20.421Z",
    "description": "<p>Google engineers develop the next-generation technologies that change how users connect, explore, and interact with information and one another. As a member of an extraordinarily creative, motivated and talented team, you develop new products that are used by millions of people. We need our engineers to be versatile and passionate to take on new problems as we continue to push technology forward. If you get excited about building new things and working across discipline lines, then our team might be your next career step.</p>\n\n<p>The Living Room team is working on revolutionizing how people interact with their TVs, and we&#39;re looking for technical solutions engineers to make that a reality and bring tier 1 partner experiences to Chrome, Chromecast and the Cast ecosystem. We want to open up the living room to a new realm of possibilities and transform how people connect with content in the living room and the variety of devices they have there.\t\n</p>\n\n<p>From the moment the user enters the living room to the time they leave, our software drives the experience and guides them through a maze of increasingly available content and services.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6001108503953408",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T18:01:51.354Z",
    "publish_date": "2019-03-19T18:01:51.354Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Programming experience in C/C++ as well as experience with graphic APIs such as Open GL or Vulkan.</li>\n<li>Experience developing for console, PC and/or mobile.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Unity development experience.</li>\n<li>Unreal development experience.</li>\n<li>A quick learner and can ramp up quickly on new technologies and SDKs</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand Stadia Partner technical requirements and use cases, and distill these into crisp product requirements.</li>\n<li>Define the experience and technical solutions that would realize these requirements, and build the necessary pieces.</li>\n<li>Work with partners in order to resolve any technical issues that might arise from the use of Google technologies within the partners’ products.</li>\n<li>Have travel flexibility and short-term co-location with partners.</li>\n</ul>",
    "title": "Technical Solutions Engineer, Stadia"
}