{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdhoNkD7ESTPH1ayRMWwSMixvYwt57fkgi9KlDiC3ZkSOgASYQ8wiDjn-mwRdsBcQSxWY2zCrzuUflZYqGAhzy2LSwDd4UUdLuyzt15ga9kPbCJJkLxUZnuXIfI%3D_V2&jobTitle=Content+Strategist%2C+YouTube+Support+Communications&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-27T23:01:56.340Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, presenting unique challenges and opportunities to support over a billion monthly users globally. Fast-paced, dynamic, and proactive, the YouTube Support team provides seamless, brilliant support to our content creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it, and to allow our users’ voices to help shape product solutions. <br><br>As a member of the Support team, you&#39;ll analyze top issues facing our users and content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you&#39;ll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.</p><p>As a Content Strategist, you&#39;ll drive the development of support content across email channels. You&#39;ll effectively translate complex concepts into friendly, easy-to-read content that reflects YouTube Editorial guidelines, manage large content databases and work cross-functionally to craft high-quality material that balances user and business objectives. </p><p>You understand how to create engaging, short, and to-the-point email communications while maintaining focus on users. You’ll partner with the Support Communications team, product specialists, marketing, and subject matter experts across YouTube to develop content that helps viewers understand and act on critical information. You&#39;ll drive projects and write content to ensure a consistent experience across email content. You&#39;re able to grasp technical concepts quickly and can successfully lead and manage multiple projects at the same time.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/94311032089912006",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:08.275Z",
    "publish_date": "2019-03-07T01:32:08.275Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>3 years of experience in online operations and/or web development.</li><li>Experience managing and writing for internal knowledge bases.</li><li>Experience writing social communication responses to support questions.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in online content production, editing, UX writing, or marketing content for consumer-focused communications. Experience writing benefit-oriented, consumer-focused copy.</li><li>Understanding of user experience principles, rich media, and social media.</li><li>Excellent leadership, project management, and analytical skills. Ability to work globally and cross-functionally in an ambiguous environment.</li><li>Self-starter, with the ability to work independently on multiple initiatives simultaneously.</li><li>Excellent problem-solving skills and business judgment.</li><li>Excellent written and verbal communications.</li></ul>",
    "responsibilities": "<ul><li>Create and edit emails. Help set and shape guidelines for system emails, mandatory service announcements and writing best practices.</li><li>Collaborate with multiple teams at YouTube to develop and execute the support strategy. Build, maintain, and improve a wide range of YouTube emails for external viewers and creators.</li><li>Work with marketing to analyze metrics to identify pain points and improve email content. Set quality standards and measure content quality.</li><li>Work with content at many levels (information architecture, style guides, templates, analytics).</li><li>Partner with product specialists, subject matter experts, marketing, and other editorial groups to ensure content consistency and transparency.</li></ul>",
    "title": "Content Strategist, YouTube Support Communications"
}