{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQOzh9WT8oMTzPRbZgQl4l4rXrv5eylDtLvnJc5VwSkSOQASYQ8wIaKVg987mB4EU8FoKpQloerhtuNSKY0kxeJqYgjKIrbQbBpGsmM920mYDty28w56iEvg9Q%3D%3D_V2&jobTitle=Program+Manager%2C+Channel+Sales+Operations&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T21:31:37.197Z",
    "description": "<p>The Channel Sales team works with companies to bundle and integrate Google Ads products with their own to deliver value to their customer base. We partner with technology platform companies, including eCommerce, Ad Tech, Marketing Automation segments, who serve customers primarily through their online offerings. As a Program Manager, you&#39;ll be part of the team that sets the strategy and ensures execution of the go-to-market for Google’s Channel Sales business globally. </p>\n\n<p>Our team leads the design and planning for sales programs that generate incremental growth for Google. We work in partnership with cross-functional teams across Sales, Marketing, Finance, and Engineering. Experts in developing strategy and delivering process improvements, team members are both analytical and strategic, taking a pragmatic approach to driving high impact.\n</p>\n\n<p>In this role, you&#39;ll combine excellent business acumen with operational rigor. You&#39;re a self starter who can &quot;crunch the numbers&quot; one minute and critically think through strategic issues and communicate to senior stakeholders the next. You&#39;ll gain invaluable experience in this high-impact role working in a dynamic global environment. \n</p>\n\n<p>The Business Strategy and Operations organization provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/115486378487096006",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:55:53.429Z",
    "publish_date": "2019-02-27T19:55:53.429Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in a management consulting, sales operations, investment banking/private equity/venture capital, or marketing analytics role.</li>\n<li>Project management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of work experience in consulting or sales operations.</li>\n<li>Experience identifying opportunities for product, program, and process improvement.</li>\n<li>Experience researching and analyzing key business drivers, trends and operating metrics.</li>\n<li>Knowledge of SQL.</li>\n<li>Analytical mindset, with the ability to synthesize data into useful structured formats and bring actionable insights.</li>\n<li>Demonstrated problem solving and analysis skills, combined with excellent business judgment and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Evaluate the efficiency of the channel sales program and advise the leadership team on where to focus in order to maximize return.</li>\n<li>Drive analyses to help the sales organization, including quota achievement, coverage, retention, segmentation and productivity.</li>\n<li>Support annual/quarterly business planning processes.</li>\n<li>Oversee implementation of enabling systems and tools, working closely with internal systems teams. Troubleshoot assignment workflow bottlenecks and resolve day-to-day issues to support the frontline.</li>\n<li>Design team metrics, reporting and dashboards to improve how business runs. Maintain a high-level of data integrity.</li>\n</ul>",
    "title": "Program Manager, Channel Sales Operations"
}