{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckduXP8ELuGE7eWe8vs94kDhUBSE0YRsLXo1FUM7_3yQSOgASYQ8wDIeMVW2jbKOQYe9Ohx6-v1KfljVC4O6sTWuOsEO0xSl-nJSqfwSx-76ERFYmW4oitsruaT4%3D_V2&jobTitle=gTech+Engagement+Manager%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T17:31:43.630Z",
    "description": "<p>Central Strategy and Operations (CSO) is important for developing the future strategy and supporting the cross-functional activities for all of Google Customer Solutions (GCS). This team partners with gTech to lead cross-GCS/gTech strategy, determine operating model, and define critical capabilities needed. We ensure a coordinated, thoughtful partnership and this team will be critical as we continue to expand GCS&#39; partnership with gTech.</p><p>In this role, you&#39;ll transform the gTech - GCS relationship by creating a cross-functional shared vision for our partnership, advising on activating gTech-related initiatives, and interfacing with leadership across both teams to share progress and plans.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/108386366439465670",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:56:27.356Z",
    "publish_date": "2019-02-27T19:56:27.356Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree or equivalent practical experience.</li><li>8 years of experience in sales operations, management consulting, product management, or equivalent experience in a technology/media company.</li></ul><br><p>Preferred qualifications:</p><ul><li>Master&#39;s, MBA or PhD degree.</li><li>Ability to influence stakeholders across organizational lines and borders.</li><li>Demonstrated ability to lead and execute on complex operational and strategic initiatives. Ability to think strategically to solve complex problems.</li><li>Effective problem-solving skills coupled with business acumen.</li><li>Effective leadership skills with demonstrated ability to lead impact in a fast-paced environment.</li></ul>",
    "responsibilities": "<ul><li>Develop and implement long-term vision and strategy for cross-functional engagement with GCS in partnership with leadership.</li><li>Build and maintain relationships with leadership; act as the trusted advisor.</li><li>Work seamlessly across cross-functional teams to identify deeper partnership opportunities to drive incremental GCS growth and/or gTech value.</li><li>Lead analytical deep-dives to understand business drivers and opportunities for improvement.</li><li>Design and implement governance plan for delivery towards goals. Identify and implement metrics and reporting tools to measure business results and success.</li></ul>",
    "title": "gTech Engagement Manager, Google Customer Solutions"
}