{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTvnd-IxIwMWOoGCtUGwQWTjtOEl9awFzSD3E_7epIUSOgASYQ8wcuKq344_bI9qoEZQg9BPPW--g9vZDlD5j1FY6BgW_5S0SmeS0RwMRM5xOw8f8-8n5_--JiM%3D_V2&jobTitle=Manager%2C+Small+Business+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T18:31:42.476Z",
    "description": "<p>With a rapidly growing array of sales teams, it&#39;s important to have knowledgeable, charismatic leaders to guide our client sales teams. As a Sales manager, you&#39;ll lead and coach high-performing account teams that use consultative sales skills to understand our advertisers&#39; needs and deliver measurable solutions that grow their businesses. You will also work with the sales leadership team to set strategic objectives and run the day-to-day operations for the business. Sales managers willingly help their teams and roll up their sleeves to partner directly with clients to provide comprehensive service. You are an excellent communicator with a proven ability to train and motivate a large team, and you take an analytical approach to sales management.</p>\n\n<p>Google Customer Solutions sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer. The Sales team keeps Google growing with our Small- and Medium-sized Business (SMB) advertisers. In a scalable way, we are responsible for growing SMB clients’ advertising growth by educating, solution selling and consulting with them directly. SMB Sales team members are extremely proactive, motivated, team-oriented and can handle our fast-paced environment. In this role, you will lead a high-performing sales team working directly with Google&#39;s small business advertisers in North America. As a member of a fast-paced sales team, you will help develop compelling and scalable solutions for our large advertiser base.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for every type of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/106729672730911430",
    "location": {
        "address_lines": [
            "Ann Arbor, MI, USA"
        ],
        "city": "Ann Arbor",
        "country": "MI",
        "country_code": "US",
        "display": "Ann Arbor, MI, USA",
        "lat": 42.2808256,
        "lon": -83.7430378
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=1168x324&zoom=12&signature=8LnraDVYxGhIHyKG7b7PRQ5sHnc=",
        "large_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=1024x324&zoom=12&signature=v7eA4ssEZFb7guDMZdU5UX8H-cM=",
        "small_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=600x400&zoom=12&signature=oFhX4JnYJqwRVThGPXhNJsUnacM=",
        "small_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=600x400&zoom=12&signature=VKXQIvW8QoK0VuXz2iHxr-9Alno="
    },
    "modified": "2019-02-27T19:44:20.471Z",
    "publish_date": "2019-02-27T19:44:20.471Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in sales management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>2 years of experience managing and inspiring high performance sales teams.</li>\n<li>Ability to own sales team operations: portfolio management, team building, KPI measurement, execution. Ability to model and coach sales behaviors including C-level engagement, effective questioning, objection handling, competitive selling.</li>\n<li>Proactive, can-do attitude, follow-through, resourcefulness and attention to detail. Ability to develop thought leadership abilities and industry expertise; ability to influence executive stakeholders.</li>\n<li>Thrives on immersion in a rapidly changing environment. Excellent problem-solving and analytical skills.</li>\n<li>A passion for consultative solution selling with a drive to innovate. Strong communication and interpersonal skills; ability to be personable yet persistent.\n</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver against assigned business growth targets. Manage, inspire and motivate a team of client-facing and high-performing Googlers.</li>\n<li>Assess the needs of our customers and gather user feedback to improve upon existing solutions and design and iterate workflows and operational plans for large-scale ideas.</li>\n<li>Build a team structure, recognize leadership potential, and support career development through enhancing capabilities within the team.</li>\n<li>Execute projects involving quantitative analysis, industry research and strategic development.</li>\n<li>Ensure team readiness to deliver complex advertising solutions and create a culture of sales innovation and advertiser success on the team.</li>\n</ul>",
    "title": "Manager, Small Business Sales, Google Customer Solutions"
}