{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckStM2sVkX_oQPtM-QkAmDOhZqaIuFKPETgbjwwipXYISOgASYQ8w281RinVaZeg9d2-gr2deyd_aBmqdQczEEQJqNjNj5r_6BRauTDkR6bs6u2OWTik-vgDxEpE%3D_V2&jobTitle=Program+Manager%2C+Acquisition+Support&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T01:31:50.313Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require Program Managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multidisciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones, and hemispheres, and you will keep all the players coordinated on the project&#39;s progress and deadlines.\n</p>\n\n<p>The Cloud Support team helps customers to solve technical problems with excellent customer care. We engage customers across the globe through online communities, social outreach, and 1:1 support. Our team is the face of Google to many customers, and like all Google’s products do, we set and adhere to the high standards of our support on customer experience.\n</p>\n\n<p>In this role, you will work with Cloud Support Leadership, Acquisitions and Engineering teams to develop a robust customer support model for legacy and new customers of companies post-acquisition. You will drive seamless integration activities across the broader customer support organization, while maintaining high employee retention and customer partner experience during the transition of support. Additionally, you will help drive support planning, readiness, and training activities for product general availability (GA) of acquired technologies as well as handle customer escalations through your business acumen and strong technical assessment skills. Through migrating support systems and determining a long-term resource model, you will help fulfill customer support obligations and manage customer support worldwide for acquired organizations.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/98750171237491398",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-03-08T01:31:50.313Z",
    "publish_date": "2019-03-08T01:31:50.313Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or Engineering or equivalent practical experience.</li>\n<li>Experience with Google Cloud or other cloud solutions or experience in a tech environment or a professional services firm.</li>\n<li>5 years of experience in Program Management, leading projects with multiple dependencies.</li>\n<li>Experience in a Customer Support, Product Management, or Partner Management.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience in managing mergers and acquisitions-related product support transitions and integrations.</li><li>Excellent analytical and problem-solving skills and solid understanding of customer support principles.</li><li>Self-starter, who is comfortable with navigating ambiguity in a rapidly changing environment.</li><li>Ability to manage multiple projects with attention to detail, accountability, and ownership for end-to-end project lifecycle.</li><li>Ability to communicate with and influence stakeholders and diverse technical/non-technical groups without direct authority, spanning all organizational levels.</li><li>Ability to inspire and motivate team members to grow in their capabilities and focus on delivering results.</li></ul>",
    "responsibilities": "<ul>\n<li>Work with Engineering Leadership and Google Venture Integration on identifying relevant customer support and services in all acquisitions.</li>\n<li>Develop detailed customer support workflow, resource requirements, and necessary budget to support the acquired technology.</li>\n<li>Manage key deal deliverables, establish 24X7 support, transition legacy support systems and tools, and train support teams on acquired technologies.</li>\n<li>Complete end-to-end transition of support for acquisitions and strategic partnerships; lead a team of Engineers, who deliver ongoing technical support for acquired companies\nfor 12-18 months post-close before migrating to mainstream support.</li>\n<li>Use a data-driven approach to drive Operational Excellence initiatives and Product Support strategy; analyze support data and communicate actionable insights, learnings and best practices to internal stakeholders through Voice of Customer reports and other channels.</li>\n</ul>",
    "title": "Program Manager, Acquisition Support"
}