{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYWrRoNt9PtbYJXmZovVvsLwxmAu6FRZlm5jfgw_AK8SOgCPMA3TuQXJmt0Dju798OXnbsega2OeTplZ6tZ4rIyRbT8QBF7SH7jYsSkA_Hfw13z5k4qdgWPjkyk%3D_V2&jobTitle=UX+Writer&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:33.530Z",
    "description": "<p>As a User Experience writer, you are an advocate for Google design, working to shape product experiences by creating useful, meaningful text that helps users complete the task at hand. You help set the vision for content and drive cohesive product narratives across multiple platforms and touch points. As a stellar writer, you have a portfolio of work that demonstrates content that simplifies and beautifies the overall user experience. <br><br>You work with people in a variety of UX design-related jobs including researchers, product managers, engineers, marketing and customer operations. Collaborating with each, you strive to establish cohesive language and a unified voice across products and platforms. You regularly use empathy, logic and hard data to inform content choices, and are an expert in your product. You provide content recommendations that include the right words and sometimes complementary data and images.</p>\n\n<p>You use your gift for language to design intuitive, delightful product experiences that help users accomplish their goals. You’re also a content strategist, defining product vision and narratives across multiple platforms and touch points. As a writer, you have a portfolio of work that demonstrates your gift for simplifying and improving user experiences. \n</p>\n\n<p>UX Writers work with people in a variety of disciplines, including design, researcher, product management, engineering, legal, marketing, and customer operations. Collaborating with each, you strive to establish a unified voice across products. You regularly use empathy, logic, and hard data to inform content choices and to advocate for the user. \n</p>\n\n<p>You will drive guidelines and best practices, manage complex, cross-functional projects, and work with leadership to set goals and implement roadmaps. You provide direction and mentorship to junior writers and support to peers.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4791512148934656",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T15:12:59.769Z",
    "publish_date": "2019-02-27T19:41:05.343Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in English, Journalism, Technical Writing, UX, HCI or equivalent practical experience.</li>\n<li>Experience in shaping content for multi-disciplinary projects, with a portfolio of UX-focused writing samples and style guidelines.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of relevant experience in user-focused writing, including work in hardware, software, digital agency, documentation or journalism.</li>\n<li>Experience developing information architecture for complex documentation sets or product suites. Experience with localization and accessibility best practices.</li>\n<li>Knowledge of online technology and related products, including web and mobile UI and tools.</li>\n<li>Familiarity with user experience research principles and practices and how to use data to provide informed user insights.</li>\n<li>Ability to lead, collaborate and influence (with and without formal authority) engineering, design and product management teams.</li>\n<li>Skills as a self-starter who can manage projects in a fast-paced environment and remain focused amidst frequently changing requirements.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Use writing and editing skills to write UI text that facilitates user navigation, as well onboarding, promos, error messages, instructional materials, and other components of the end-to-end user experience.</li>\n<li>Drive vision for product language and content across a product or subject-matter domain, and ensure cohesive product narratives; Document your strategies with guidelines, and establish best practices and strategy principles.</li>\n<li>Manage projects from needs assessment to implementation; identify opportunities, establish priorities, secure resources, and manage stakeholders.</li>\n<li>Collaborate with designers, researchers, legal, marketing, product managers, and engineers; Influence and adapt to stakeholders and their feedback.</li>\n<li>Provide leadership, direction, and mentorship to junior UX writers and educate cross-functional partners on the role of UX writing and content strategy throughout the product development process.</li>\n</ul>",
    "title": "UX Writer"
}