{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXg_jwZz62Gvn0fHTYD6n0voXFiKziMwNSA6GyLnbPMSOgASYQ8wdBW8xgiFcALzPe73n5YLj5ANJ9cK2JlEHJ6I4w-7trVTpkZ3l3t4HaRyxCYIMhX8QjGypww%3D_V2&jobTitle=Controls+Systems+Engineer%2C+Machine+Learning%2C+Platforms&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T15:32:09.207Z",
    "description": "<p>Our thirst for technology is a part of everything we do. The Data Center Engineering team takes the physical design of our data centers into the future. Our lab mirrors a research and development department -- cutting-edge strategies are born, tested and tested again. Along with a team of great minds, you take on complex topics like how we use power or how to run state-of-the-art, environmentally-friendly facilities. You&#39;re a visionary who optimizes for efficiencies and never stops seeking improvements -- even small changes that can make a huge impact. You generate ideas, communicate recommendations to senior-level executives and drive implementation alongside facilities technicians.<br><br>With your technical expertise, you ensure compliance with codes and standards, develop infrastructure improvements and serve as an expert in your specialty (e.g., cooling, electrical).</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/115005170753905350",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-08T15:32:09.207Z",
    "publish_date": "2019-03-08T15:32:09.207Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Master&#39;s degree in Engineering, Science, related field or equivalent practical experience.</li>\n<li>5 years of experience designing and implementing controls systems and dynamic modeling.</li>\n<li>5 years of experience with Machine Learning and construction of algorithms.</li>\n<li>Experience with programming in C, Python, MATLAB, or Shell.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>PhD in Engineering, Science or related field.</li>\n<li>Experience with modeling/statistical software such as TensorFlow, Simulink, R, or Matlab Machine Learning Toolbox.</li>\n<li>Experience with dynamic system analysis, feedback control systems (PID Control) and optical control.</li>\n<li>Experience with digital signal processing and time-series analysis.</li>\n<li>Experience with optimization, Linear Programming and Convex Optimization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Research and develop new algorithms and methods for optimizing data center efficiency and performance.</li>\n<li>Design, validate, and implement controls algorithms to handle electrical and mechanical stability.</li>\n<li>Analyze and recommend approaches to handling dynamics of the electromechanical systems and their interactions within a data center.</li>\n<li>Conduct empirical statistical analysis/modeling on relevant data for use in data center controls.</li>\n<li>Collaborate with the Engineering team to implement proposed strategies and algorithms in our technology system. Develop large scale Machine Learning algorithms for pattern recognition and Bayesian and non-linear systems.</li>\n</ul>",
    "title": "Controls Systems Engineer, Machine Learning, Platforms"
}