{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Pittsburgh, PA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXz9iwjeqcGT2F14ss3VqIpq9hSAlIoCuYGMcAzHfOkSOgCPMA3Tx-3ghJ36BT7AYCj-NYGUfhQzerwNM_YFrX0n42nQt0N5c8q7nYWyTcIqYDk6PWzRyP9YX_E%3D_V2&jobTitle=Web+Solutions+Engineer%2C+Users+and+Products&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:32:38.945Z",
    "description": "<p>At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent the voice of Google&#39;s users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. <br><br>gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. <br><br>We are committed to building an ever more diverse, equitable, and inclusive gUP, and consider this the foundation upon which individual, team, and user success are built. We&#39;re also committed to innovation not only in the content of our work, but in the way we work. Check out <a href=\"https://rework.withgoogle.com/blog/googles-algorithm-powered-internal-job-marketplace/\">this blog post </a>on our Chameleon program.</p>\n\n<p>Google&#39;s Web Solutions Engineers in Partners develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. \n</p>\n\n<p>Our users are global and you will help power our partners. You will work on a small team embedded within the gUp group and will have the opportunity to learn and grow inside Google. You are versatile and passionate to address new problems as we continue to push technology forward.\n</p>\n\n<p>As a Web Solutions Engineer in gUp, you will utilize your technical aptitude and design skills to develop innovative solutions to help Google&#39;s partners. You will analyze problems, identify elegant and scalable solutions to them, and identify and resolve dependencies. You have a passion for developing small to medium projects and some basic project management skills. Communication skills are a must, as you will interact frequently and closely with our stakeholders from around the world and across different functions to identify pain points and devise innovative technical solutions.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6737103443656704",
    "location": {
        "address_lines": [
            "Pittsburgh, PA, USA"
        ],
        "city": "Pittsburgh",
        "country": "PA",
        "country_code": "US",
        "display": "Pittsburgh, PA, USA",
        "lat": 40.44062479999999,
        "lon": -79.9958864
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&size=1168x324&zoom=12&signature=bML2TGs1mgqZUrRr4AbUGft114I=",
        "large_2x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&scale=2&size=1024x324&zoom=12&signature=yYDwtb4snIKR5aq5kGb0m8lAHdQ=",
        "small_1x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&size=600x400&zoom=12&signature=w1iNbGf2icUDv9rzW2JCq5rI-RA=",
        "small_2x": "/maps/api/staticmap?center=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=6425+Penn+Ave%2C+Pittsburgh%2C+PA+15206%2C+USA&scale=2&size=600x400&zoom=12&signature=zy8WswLAzKtXGWV1PfX3HzTcfVU="
    },
    "modified": "2019-02-27T19:40:26.997Z",
    "publish_date": "2019-02-27T19:40:26.997Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BS degree in Computer Science, Electrical Engineering, Math or related quantitative field or equivalent practical experience.</li><li>Experience in one or more programming languages.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with relational or non-relational databases with interest in handling large data sets.</li>\n<li>Experience with unit testing, agile project development, and bug and change management systems.</li>\n<li>Experience with Salesforce.com.</li>\n<li>Extensive experience in one or more of the following: HTML, XML/XSLT, JSON, Python, Java or JavaScript</li>\n<li>Excellent project management skills, with ability to track multiple simultaneous projects, and independently provide technical solutions to business challenges.\n</li>\n</ul>",
    "responsibilities": "<ul><li>Build new internal tools, back-end services and web applications that extend Google’s technical reach with partners.</li><li>Create test plans and test cases.</li><li>Aggregate data from multiple sources to enable business insight discovery.</li><li>Write and review technical documents, including design, development and collaborative code reviews.</li></ul>",
    "title": "Web Solutions Engineer, Users and Products"
}