{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZscyZalCeVQUOXb-L6-SMU7MrTNkVa-vZ7PXQ1XzD4SOgASYQ8wentzGk0DBSbwNV4PoiJgYpWd73x59zj3YIHNpB7vv5xbkg4zB505QDtmaw5PRyoNIFQM1tY%3D_V2&jobTitle=Product+Design+Engineering+Manager%2C+Google+Hardware&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T20:31:29.173Z",
    "description": "<p>As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.</p>\n\n<p>As Product Design Engineering Manager, you will develop and guide a small but growing team of Mechanical/Product Design engineers and related disciplines. You will build a close, collaborative relationship with Google’s Industrial Design team to create beautiful, functional concepts and develop them into mass-production consumer products.\n</p>\n\n<p>In this role, you will use your experience to influence product direction and hardware architecture. You will ensure the team has access to the right training, tools, and best practices to build reliable, scalable systems. When problems arise, you will help the team find creative solutions. You will work with cross-functional subject matter experts and product management to identify strategic technologies and processes for long-term research.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5828139615813632",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:48:30.991Z",
    "publish_date": "2019-02-27T19:48:30.991Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Mechanical Engineering, related Engineering field, or equivalent practical experience.</li>\n<li>10 years of experience leading mechanical engineering projects.</li>\n<li>5 years of experience managing engineering teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s or PhD in Mechanical Engineering or related discipline.</li>\n<li>Experience in high-volume consumer electronics mechanical architecture and systems design.</li>\n<li>Knowledge of technologies used in consumer products (e.g., Plastic Injection Molding, Sheet Metal, Extrusion, Die Casting).</li>\n<li>Ability to form effective cross-functional relationships and to communicate product design/mechanical requirements clearly to non-experts.</li>\n<li>Ability to lead a team and deliver multiple large, complex, and mission-critical projects.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Hire and develop a high-performing, collaborative, and inclusive team.</li>\n<li>Manage and guide multiple Mechanical Engineers/Product Design project teams, from concept through mass production.</li>\n<li>Ensure adoption of best practices, including necessary engineering rigor, to create robust and desirable products.</li>\n<li>Build consensus among cross-functional teams and influence executive-level decisions. Communicate technical concepts clearly to cross-functional leaders.</li>\n<li>Develop technology roadmap to support future product development.</li>\n</ul>",
    "title": "Product Design Engineering Manager, Google Hardware"
}