{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcyrZDzdr2mfkVgpUER8b9qKNZRKcRewlpgw758h9iQSOgASYQ8wn9vcbNbBaL3tnv_I1DwJdLdUa6UfyG14U82hoSkihF8PIFklc0mpCj3vyTKAkMU3xdBznqk%3D_V2&jobTitle=Strategy+and+Operations+Analyst%2C+Revenue+Programs%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T22:01:50.687Z",
    "description": "<p>The Google Customer Solutions (GCS) Revenue Programs team is responsible for driving global insights and recommendations that promotes business growth for Google’s advertising business. The team leads the design, planning, and implementation of global business growth programs with cross-functional collaboration among sales leadership, marketing, product and engineering. As a central team, we provide business critical insights to shape the engagement strategy of our global salesforce and ensure alignment of goals and execution as we grow the business. Team members are experts in business strategy and operations, analytical and strategic, yet highly pragmatic and results-oriented. </p> <p>You will be responsible for driving continuous improvement throughout the business by re-imagining every aspect of our business. You&#39;ll combine analytical rigor and thought leadership to drive improvements in incentives, customer segmentation and prioritization, engagement strategy, product penetration, and organization design. You will have exposure and visibility to senior executives as you present your proposals and demonstrate their impact. You will also be sought out as a trusted advisor by leaders across the organization. </p> <p>You can work in a rapidly changing industry, tolerate ambiguity, influence senior stakeholders and demonstrate problem-solving leadership with limited oversight.</p><p>When our millions of advertisers and publishers are happy, so are we. Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128166501166260934",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:50:12.135Z",
    "publish_date": "2019-02-27T19:50:12.135Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Bachelor&#39;s degree with quantitative focus (Economics, Computer Science, Mathematics, Physics, Statistics or Accounting) or equivalent practical experience.</li> <li>4 years of analytical work experience in marketing and sales, management consulting, or in a business operations and analytics environment.</li> </ul><br><p>Preferred qualifications:</p><ul> <li>MBA, MS degree or other advanced degree.</li> <li>Experience presenting and analyzing large quantities of data with strong spreadsheet and database query experience (e.g. SQL).</li> <li>Track record of thought leadership in applying data-driven models that have had impact on sales and marketing operations across international markets.</li> <li>Ability to consistently deliver quality outputs in a fast-paced environment, work to tight deadlines, and contribute to a fun, fast-paced, high impact and dynamic environment.</li> <li>Ability to strategically analyze and synthesize data to develop useful formats and actionable insights.</li> <li>Extremely well-organized and capable of handling multiple projects and ad-hoc requests simultaneously.</li>\n</ul>",
    "responsibilities": "<ul> <li>Identify key growth and optimization opportunities.</li> <li>Provide insight on the strategy and operating performance of the businesses for executive reviews and strategy summits.</li> <li>Conduct sophisticated analysis and modeling that translates data into actionable insights and supports business development.</li> <li>Research and analyze key business drivers, trends and operating metrics.</li> <li>Collaborate cross-functionally with Program Managers and other analysts across business areas to drive strategic initiatives forward.</li> </ul>",
    "title": "Strategy and Operations Analyst, Revenue Programs, Google Customer Solutions"
}