{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU1HLuM6beAw3K1brBg7npkCxVjv2H9wG7KYbjlcMxoSOgCPMA3TNHXoa4t5fqeQpqVCuKO3Ia6N4QuGtTSQ-ei9AeyD1DH71KPxRIqGp02_QMEkHkJKPW-WsII%3D_V2&jobTitle=Global+Program+Manager%2C+Creator+Development+Program%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T23:02:08.537Z",
    "description": "<p>The YouTube Partner Program engages millions of content creators — a group that’s growing quickly, and will grow even faster in the coming years. Many of these creators are responsible for “what is original” on YouTube, and are building the media companies of the future. Fast-paced, dynamic, and proactive, the Online Partnerships and Development (OPD) team makes sure that YouTube&#39;s creators around the world have a great experience and achieve success on the platform.</p><p>Our team provides program management across all YouTube Creator &amp; Artist programs (encompassing acquisition, account management, driving product adoption and in-person offerings). Fast-paced, dynamic and proactive, program managers on the team focus on project management to support YouTube’s key operational priorities and drive actionable insights. You will apply critical thinking to make recommendations and inform major business decisions. You will be an expert on YouTube’s business model and operations and will apply your analytical experience to help advise strategy and optimization. From scoping to analysis to implementation, you will be responsible for working with global teams on projects that impact the entire content operations organization.</p><p>As a Global Program Manager for the Creator Development Program, you will support the design and implementation of a 1:1 engagement model that meets creator needs and is aligned with YouTube’s larger creator offering. You will work closely with cross-functional teams such as Content Partnerships, Partner Operations, Go-to-Market, Insights, Infrastructure &amp; Tools and Marketing.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6190658715058176",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T23:02:01.384Z",
    "publish_date": "2019-03-06T23:02:01.384Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>BA/BS degree or equivalent practical experience</li> <li>Experience in SQL and customer relationship management reporting (e.g., Salesforce).</li> </ul><br><p>Preferred qualifications:</p><ul> <li>MBA and/or consulting experience.</li> <li>5 years of demonstrated expertise in defining key success measures and track progress against, effectively evolving the programs based on building dashboards and critical analysis.</li> <li>5 years years of demonstrated expertise in analyzing data that drives business decisions.</li> <li>Strong analytical skills and experience with data visualization</li> <li>Excellent communication skills, including the ability to take complex, ambitious topics and create compelling narratives for different audiences.</li> </ul>",
    "responsibilities": "<ul>\n<li>Program manage the insights and tools workstreams of the Creator Development Program, partnering with cross-functional stakeholders, such as Partner Enablement, Marketing and YouTube Spaces, to ensure successful design and execution of Creator Development Program</li>\n<li>Manage program strategy and day-to-day execution of product activations, diversity and inclusion initiatives, service model improvements and alignment with Content Partnerships &amp; Support (portfolio refresh/transfers)</li>\n<li>Program manage the creator viability (program fit) and lead warming engagement of Creator Development Programs spanning several markets</li>\n<li>Provide thought leadership and program management. Analyze incoming data to create program-level insights.</li>\n<li>Communicate recommendations to senior management and drive recommendations through to implementation.</li>\n</ul>",
    "title": "Global Program Manager, Creator Development Program, YouTube"
}