{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX6irz9dkEePN-u3Vjt5vHE2gYD2L6d7_46iGgxiKKwSOgASYQ8wB7yMX0yduTIueqEIx2EckUmrTRkIBzi8cM7BDD8QHUm2tstDgbDZoz9LjtPiqrPV2WbZdGU%3D_V2&jobTitle=Product+Partnerships+Manager%2C+Responsibility%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-21T04:31:47.322Z",
    "description": "<p>YouTube’s Product Partnerships team accelerates the global growth and innovation of YouTube products by driving new business opportunities through partnerships. We own the business side of new features, products and initiatives that are vital to the success of YouTube. As a team member, you understand the landscape of partnerships opportunities across technology licensing/integrations, marketing, and distribution. You will also craft strategies, define and structure critical partnerships, negotiate agreements, and cultivate our relationships.</p> <p>The spread of misinformation online and its implications for society are at the fore of public discourse. The Responsibility team works to prevent the spread of misinformation and safeguard the YouTube experience by enhancing our technology and user experiences. You’ll work closely with Product to identify partnership opportunities that, for example, help empower users with information and context around critical, and often controversial, issues. You’re excited by this team’s mission and ready to bring your perspective and creativity to this challenging and ever-evolving area. You’re as comfortable discussing with Product how a partner plugs into our technical workflows as you are diving into its implications with Legal and Policy. You are thoughtful, strategic, analytically driven, and possess a global perspective. You thrive in a fast-paced, ever-evolving, team-oriented environment.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/97691479113114310",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T23:02:02.320Z",
    "publish_date": "2019-03-06T23:02:02.320Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Bachelor&#39;s degree or equivalent practical experience.</li> <li>6 years of relevant partnership development experience, including identifying partners, structuring and negotiating deals, or partner management as well as experience handling sensitive partnerships.</li> <li>4 years of experience working closely with Product, Engineering and Legal in a technology environment.</li> </ul><br><p>Preferred qualifications:</p><ul> <li>Experience working in Trust and Safety, Policy, or similar areas.</li> <li>Experience operating within and leading cross-functional efforts (with Product, Engineering, Legal, Policy, Operations, etc.)</li> <li>Consulting experience</li> <li>Strong interpersonal and communication skills including articulating key business, financial and technical points with both partners and internal teams</li> <li>Strong problem-solving skills including an entrepreneurial and creative approach, attention to detail, demonstrated collaboration instincts</li> <li>Passion for and understanding of YouTube products with the ability to quickly learn new technologies.</li> </ul>",
    "responsibilities": "<ul>\n<li>Become a domain expert and thought leader in your area.</li>\n<li>Work closely with Product to identify opportunities where partnerships can enhance our efforts to prevent misinformation.</li><li>Develop and maintain strategic partnerships with external content partners and experts, including advocating opportunities, managing contracts, managing partners and measuring / evaluating our success.</li>\n<li>Lead the business side of cross-functional launches of new features in target countries or globally, working closely with Product, Engineering, Policy, Legal and other Google teams, and problem-solve open issues.</li>\n</ul>",
    "title": "Product Partnerships Manager, Responsibility, YouTube"
}