{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU4mvHaeUKGOnn6w25Zq10ts1lAEOf-jRKjNEK0Q2pkSOgCPMA3TCIpSijPu53LvJznUmRV-KUyYqbk5tKweAToUBH0tV-a7RQgDLuGZIiCvQeOlPeinio86Apk%3D_V2&jobTitle=Strategic+Partner+Development+Manager%2C+Mobile+Business+Models%2C+Google+Play&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:40.518Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Armed with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.</p>\n\n\n<p>Google Play is the software distribution platform with users across Android devices worldwide. The team&#39;s goal is to help ensure that Android/Google Play software ecosystem stays vibrant - helping users on Google Play, and helping developers build their businesses on Android.\n</p>\n\n\n<p>As a Strategic Partner Development Manager, you focus on Mobile Business Models within Google Play. You will be responsible for building a pipeline and working with developers so that we can offer Google Play users across the globe different ways to access and consume great apps and games on the platform.</p><p>Google Play offers music, movies, books, apps and games for your devices, powered by the cloud. It’s a Google approach to entertainment, syncing magically across your devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping the product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team helps strengthen the overall Android ecosystem by giving developers and partners a premium store where they can reach millions of users.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4631348289667072",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:20:49.163Z",
    "publish_date": "2019-03-05T14:31:48.762Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of working experience.</li>\n<li>Experience in pipeline creation and sourcing.</li>\n<li>Experience in crafting and negotiating agreement terms within the mobile ecosystem with developers, carriers, OEMs, etc.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with user acquisition, content curation and business growth allocation for business models (e.g., subscriptions or bundles).</li>\n<li>Experience in synthesizing diverse feedback to develop a point of view that captures multiple opinions and concerns in a clear and concise fashion.</li>\n<li>Experience in recruiting and managing mobile app developers at a tech company, or experience in helping mobile apps achieve ecosystem success.</li>\n<li>Ability to work in an ambiguous and rapidly changing environment.</li>\n<li>Ability to communicate contractual, technical, financial information with partners and with internal cross-functional teams.</li>\n<li>Developed interpersonal and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Curate and manage a pipeline of apps and games to offer for Google Play and pitch innovative new business models to developers.</li>\n<li>Create a compelling value proposition and negotiate agreements to bundle the offerings with carriers, OEMs and other Google products and services.</li>\n<li>Collaborate with Product teams to ensure that product features, partners and developers are prioritized in crafting the product roadmap.</li>\n<li>Provide input on merchandising in the Google Play store. Work closely with partners to ensure their apps and games meet the guidelines for inclusion.</li>\n<li>Stay up-to-date on the latest developments for apps and games through research, attending/speaking at events and meeting with influencers. Provide feedback on features and business models to Product/Engineering teams.</li>\n</ul>",
    "title": "Strategic Partner Development Manager, Mobile Business Models, Google Play"
}