{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckduuksHjZium1dr7sD8q_3d7XYenM5OC7F_W6iEE9GoSOgCPMA3TZqHHSTwnLA_iZjfDicWo1fHE9SY7i8Q5D8jy5S2DS3VuWH-5uqsYBPXB_yAyMoeaWCiSrxI%3D_V2&jobTitle=Stock+Administration+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:54.272Z",
    "description": "<p>Google&#39;s Treasury team is on a mission to optimize the return on Google&#39;s financial assets. As a member of this team, you&#39;re always looking for innovative ways to help Google invest for the future while limiting volatility and material surprises. In addition to risk busting and asset management, you work collaboratively to administer business insurance programs and stock programs, and provide financial analysis support to our internal teams. You make creative yet calculated decisions that are backed by both experience and your extensive knowledge of the economy and financial industry.</p>\n\n<p>As an Stock Administration Analyst, you will work in a critical role to manage Google&#39;s equity administration workflows. You will work closely with key business partners (both internal and external) to manage the complexities our equity compensation plans and the data associated with these.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4832918298099712",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T15:53:34.637Z",
    "publish_date": "2019-02-27T19:52:03.344Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree, or equivalent practical experience.</li>\n<li>3 years of experience in equity plan administration</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Certified Equity Professional (CEP)</li>\n<li>Advanced knowledge of spreadsheet software and/or SQL with the ability to use data to solve problems and bring best practices to the team</li>\n<li>Advanced analytical ability, critical thinking, attention to detail, strong organizational skills, and ability to multitask in a fast-paced environment.</li>\n<li>Excellent communication skills with the ability to manage a high volume of detailed work while still maintaining accuracy.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage critical, daily equity administration workflows that support company policies, SOX controls, and global compliance including: grant processing, PT/LOA vesting adjustments; GSU releases; country-specific procedures; month end audits and reconciliations</li>\n<li>Provide a positive participant experience: Answer Googler questions and send out communications, including option expiration notices and outreach</li>\n<li>Support systems and ongoing projects</li>\n<li>Maintain documentation for all equity plan administration, including SOX control processes and monthly audit procedures.</li>\n<li>Serve as a point of contact for multiple business partners, including Google and external partners</li>\n</ul>",
    "title": "Stock Administration Analyst"
}