{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckcwxe2mtMVnG5Xv8fQeFmd-SfrvoSOT5tKWny46NsWcSOgCPMA3TrwJYo8b3CpBAmQOo_IUpDAF1qC7OT1fulACnJwaypWF-tT2PUEwNK5zDcv7eZtMOoCORfZI%3D_V2&jobTitle=Director%2C+Global+Enablement%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T21:01:42.207Z",
    "description": "<p>As the Director of Global Enablement for Google Cloud, you will be responsible for leading the planning, design and implementation of global enablement programs across all regions and all go-to-market (GTM) segments. You will deliver productivity programs, enablement and business-supporting initiatives for Google Cloud Sales teams as well as Google Cloud product enablement to our customer-facing teams, including Sales, Customer Engineers, Professional Services and Channel. You will focus on long-term strategy and driving impact by working closely with all field roles, including direct sales and partners to support their enablement needs and ensure proper landing and execution of programs globally.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5001924426530816",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:47:33.633Z",
    "publish_date": "2019-02-27T19:47:33.633Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>10 years of field training and enablement experience with increasing responsibility, including people management experience.</li>\n<li>Experience in developing and managing sales competency models and learning paths for sales roles.</li>\n<li>Experience working with enterprise sales.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working on strategy and vision for an integrated learning system behind the learning portal development for increased learner engagement and satisfaction.</li>\n<li>Working technical knowledge of a cloud technology platform.</li>\n<li>Ability to build relationships with internal stakeholders and external partners.</li>\n<li>Strategic thinker that can take broad visions and concepts and develop structured plans, actions and measurable metrics and then execute those plans.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead and inspire a global team of Enablement Program Managers responsible for driving higher productivity through programs like onboarding, continuing education, events, etc.</li>\n<li>Partner with Google Cloud Leadership and translate business needs into training products and programs.</li>\n<li>Oversee design, build and execute highly innovative and engaging learning programs enabling the field on knowledge, skills and tools/process. Ensure learning programs are with clear metrics on impact, effectiveness, appropriateness and utility.</li>\n<li>Drive an effective governance process focused on providing timely and targeted content and programs for enablement.</li>\n<li>Collaborate and drive continual improvements in our processes and productivity working with HR, Sales Operations and other subject matter experts across Google.</li>\n</ul>",
    "title": "Director, Global Enablement, Google Cloud"
}