{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbmNHpkb3HeclqK5uBflZpxWFJGpwCRMhPf90bdfkHMSOgASYQ8wuVBsvLyWUrPMwz6tnwYSyYSFZamajDXtbGam_nuZgmtW3XD5rtfRADqnFMtozOS8gCIlNTY%3D_V2&jobTitle=Global+Client+Lead%2C+Oil+and+Gas%2C+Google+Cloud&loc=US",
    "categories": [
        "ADMINISTRATIVE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T19:01:53.902Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As the Global Client Lead for the energy industry, you will work with strategic customers, partners, and internal teams to grow Google Cloud Platform’s business. Serving as a subject-matter expert for your industry, you will advocate how Google’s offerings can address client&#39;s needs. Leveraging deep industry experience and strong executive relationships, you will have the ability to spur the growth of Google Cloud Platform’s products and services. You understand the technology usage in the industry and how cloud computing can enable companies to address challenges stemming from evolving market dynamics and customer preferences.\n</p>\n\n\n<p>You will lead a commercially-oriented team and influence the creation of a compelling, global go-to-market strategy for an industry-specific set of Global Clients with the goal to increase collaboration between the customer and Google Cloud. You will own the agenda, key transformation relationships, and client success. Furthermore, as a key leader on the Google Cloud team, you will inspire leading companies and insurgent movers in the industry of their domain expertise to work smarter with Google tools like Maps, G Suite, Search, and Chrome. You will advocate the innovative power of our products to make organizations more productive, collaborative, and mobile.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/117392407932084934",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:55:19.280Z",
    "publish_date": "2019-02-27T19:55:19.280Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Experience in co-creating roadmaps with customers or vendors at the C-suite level.</li>\n<li>Experience in working independently on behalf of customers and influencing others within their own organization.</li>\n<li>Experience in leading teams in Cloud, Analytics or Machine Learning.</li>\n<li>Experience in leveraging organizational depth across functions for client&#39;s transformational success.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or equivalent practical experience.</li>\n<li>Experience in driving digital transformation in the most strategic companies in the industry.</li>\n<li>Track record of excellent performance with increasing levels of responsibility and independence.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner closely with a few top global up and mid stream companies as their most trusted Google technical advisor to identify cloud related design, development, and deployment friction points from customers’ perspective. Rally teams to work through solutions.</li>\n<li>Work with customers and partners to define joint initiatives and co-create their transformation roadmap.</li>\n<li>Tell the Google innovation story and help translate it to actionable steps that global companies can take towards adoption.</li>\n<li>Develop and execute strategy for industry partnerships and sponsorships by collaborating across functional and product area boundaries to bring the best of Google to the customer</li>\n<li>Meet and exceed challenging growth goals by establishing and expanding relationships with large customers and business partners while actively contribute to the evolving Google Cloud business and product strategy.</li>\n</ul>",
    "title": "Global Client Lead, Oil and Gas, Google Cloud"
}