{
    "application_instruction": "<b>Please include URLs for an online portfolio in addition to resume. Submissions without a portfolio included will not be considered.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeuEbO8p2hTVQuyvkf-i7J1nPKNRV2N97klC8snP-xwSOgASYQ8wqykHyeD70GL5ixkSwWO3CnpiVrzASLZ8mDNYtI0y6YqrX8g0SLJsfeaIbLGKuB-Q4mD8vSY%3D_V2&jobTitle=Director+of+UX%2C+Privacy%2C+Data+and+Protection+Office&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T19:02:41.450Z",
    "description": "<p>The Privacy and Data Protection Office (PDPO) coordinates privacy-related initiatives across product areas and functions to help Google maintain its user-first privacy focus, invest in constructive relationships with regulators and key opinion formers (KOFs) worldwide, and ensure that ongoing privacy strategy work is conducted with transparency and accountability. The PDPO is home to privacy launch review, user-facing privacy products (e.g., Privacy Checkup), core privacy infrastructure, and privacy-related research programs.\n</p>\n\n\n<p>The PDPO UX team is responsible for understanding user needs around privacy and sharing this expertise throughout Google. The team creates products like &quot;Your Data in Search,&quot; as well as extensible design patterns around privacy that can be used across Google, and also consults with all product areas on designing for privacy.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/140455188444914374",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-08T19:02:41.450Z",
    "publish_date": "2019-03-08T19:02:41.450Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in Design, Human-Computer Interaction (HCI), Psychology, Information Science, Computer Science or equivalent practical experience.</li>\n<li>12 years of experience in UX Design.</li>\n<li>5 years of experience in people management or leading design teams.</li>\n<li>Portfolio of UX-focused work samples for web and mobile applications.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in protecting user privacy and an understanding of privacy concepts.</li>\n<li>Experience in vision setting and execution on software products and technologies.</li>\n<li>Experience working in quick-turnaround environments.</li>\n<li>Demonstrated organizational, analytical and influencing skills.</li>\n<li>Exceptional leadership, collaboration and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the UX design function of the Privacy and Data Protection Office (PDPO), including managing and growing a design team.</li>\n<li>Become the go-to expert around designing for privacy. Drive critical vision work around privacy in our products and develop key patterns across Google and new products.</li>\n<li>Demonstrate knowledge of the competitive landscape around privacy design and best practices, and the creativity and drive to continually raise the bar.</li>\n<li>Partner with Product Managers and Engineering leaders to create and drive product strategy. Guide and influence senior leaders from nearly every product area at Google around designing for privacy.</li>\n<li>Manage, inspire, and develop a growing team of designers. Partner with a UX research team to deeply understand user needs around privacy, how Google products measure up, and what we must do to improve the user experience.</li>\n</ul>",
    "title": "Director of UX, Privacy, Data and Protection Office"
}