{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Washington, DC, USA; Seattle, WA, USA; Chicago, IL, USA; Austin, TX, USA; Atlanta, GA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRnAWB0WMjTmE57hqzCZZyXyuYGc0x1Gmfbb10qkyfoSOgASYQ8wINSKlhdEbMe_HYX00VK0kA1WJWaXF1Vw7oMSreXlTE-V_Xf67W8JphUdk8k90is4pXMPjRA%3D_V2&jobTitle=Hybrid+Cloud+Sales+Specialist%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T17:31:50.526Z",
    "description": "<p>As a Hybrid Cloud Sales Specialist, you will define the strategy for Google&#39;s hybrid cloud product growth across your region, lead a cross-functional team, build key relationships with C-level executives, and showcase Google’s innovation and technology solutions to our potential customers. You&#39;ll work closely with strategic partners and existing Google Cloud sales account teams to lead conversations about how the product can transform our customers’ organizations. You will also partner with other functional teams across Product, Legal, Compliance, Operations, and Enablement to remove barriers and ensure flawless execution and success of the customer engagement.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/134331825385284294",
    "location": {
        "address_lines": [
            "Seattle, WA, USA"
        ],
        "city": "Seattle",
        "country": "WA",
        "country_code": "US",
        "display": "Seattle, WA, USA",
        "lat": 47.6062095,
        "lon": -122.3320708
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=1168x324&zoom=12&signature=ps_sPvgcgFUcz72GpSwau1rebxc=",
        "large_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=1024x324&zoom=12&signature=LGHj2cxqA3QhLZJTwZmYSkwFGho=",
        "small_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=600x400&zoom=12&signature=D1jnhP7KcjQ4mOvW3HCzt_s7wc8=",
        "small_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=600x400&zoom=12&signature=LHlLQ_7VV0axWi1ctKvQwOcu_UM="
    },
    "modified": "2019-03-14T17:31:50.526Z",
    "publish_date": "2019-03-14T17:31:50.526Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience in direct sales leadership and/or channel sales.</li>\n<li>Experience in enterprise IT transformations.</li>\n<li>Experience helping enterprise customers transitioning to the cloud and IT modernization.</li>\n</ul><br><p>Preferred qualifications:</p><ul> <li>Ability to work cross-functionally.</li> </ul>",
    "responsibilities": "<ul>\n<li>Establish and develop strategic C-level relationships and go-to-market strategy to help our customers transform their enterprises through content security policy (CSP) and Google Cloud Platform (GCP) technologies.</li>\n<li>Develop, test, refine, and scale sales strategies for CSP. Identify needs and use-case, innovate solutions that optimize customer potential, and identify measures of success and use data to analyze strategy success.</li>\n<li>Provide feedback to Product and Go-To-Market teams to ensure future CSP offerings are aligned with customer needs and use-cases.</li>\n<li>Manage customer relationships, CSP touchpoints, account plans, pricing discussions, and agreement operations.</li>\n<li>Work collaboratively with other Google teams in delivering long-term value through partnerships. Define, review, and agree to a clear set of priorities, joint initiatives, and roadmap with our customers.</li>\n</ul>",
    "title": "Hybrid Cloud Sales Specialist, Google Cloud"
}