{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWbkOnIMjXFq6bnaKLKzm_LKf8031xElDKJHR4EuIj4SOgASYQ8wzyOOGmFJNRK8RLdvTSrLVhC1rjXxPkKUJm7BsSKJkpEC_2Da4eaDMvAUMfAwPTbno48A_y8%3D_V2&jobTitle=Partner+Manager%2C+On-Demand+Learning+Partnerships%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T21:01:58.571Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>The Google Cloud Learning team develops and delivers Google Cloud product and solution trainings to thousands of partners, businesses and individual developers. The training portfolio includes classroom training, on-demand training and a hands-on lab offering. As a Partner Manager, you&#39;ll lead complex, multidisciplinary partnerships with global scope. \n</p>\n\n\n<p>You&#39;ll plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project/partner stakeholders both internal and external.Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.\n</p>\n\n\n<p>Our team is responsible for identifying, developing, launching and successfully managing the learning programs and partnerships that drive impact at scale. Our reach includes Google Cloud prospects, customers, partners, and students who want to learn more about Google Cloud.\n</p>\n\n\n<p>You&#39;ll manage existing on-demand training partnerships, and you&#39;ll ensure that partners deliver on their responsibilities while adhering to obligations. You&#39;ll represent the voice of Google and develop independent relationships at all levels within the partner organization.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/121555497586172614",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-19T21:01:58.571Z",
    "publish_date": "2019-03-19T21:01:58.571Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of partner management experience.</li>\n<li>5 years of experience delivering projects with stakeholders (both internal and external) within deadlines.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience working in a large enterprise, in a sales operations or program management role.</li>\n<li>Experience in managing technical partnerships.</li>\n<li>Experience working in a global team, with different cultures and navigating multiple time zones.</li>\n<li>Understanding of at-scale Learning platforms. Proven ability of delivering on business goals.</li>\n<li>Self-starter, with the ability to work in an ambiguous and fast-paced environment. Comfort using data and analytics to drive business decision making, track program progress and gather insights.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand partner obligations against OKRs, align partner stakeholders around them, and communicate effectively at all levels.</li>\n<li>Develop and execute annual and quarterly business plans detailing product, pricing, promotions and operational aspects.</li>\n<li>Develop insight into on-demand learning and act as a thought leader in the space.</li>\n<li>Be responsible for all aspects of the learning experience, including enrollments, payments, communities, support, global languages, etc.</li>\n<li>Track partnership success and iterate based on observations and analysis.</li>\n</ul>",
    "title": "Partner Manager, On-Demand Learning Partnerships, Google Cloud"
}