{
    "application_instruction": "This role may also be located in our Playa Vista, CA campus.",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSM3tmzlckz-LlYoKGw0EOj6kZyH0RWO8G_R-434TxgSOgASYQ8wUXa4WaNlNYMcQWzbF2LH9-aFnnE1MFCa5JzyXP4iKXyK6aZuoNvd0y-fVy79sO2WMSxAu40%3D_V2&jobTitle=Content+Strategist+%26+Designer%2C+Customer+Experience+Center&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-09T01:01:45.779Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Your role is to help uncover and craft compelling stories that will inspire, engage and educate executives with the goal to drive their business objectives. You will design and produce visually stunning presentations, as well as manage client workshops at the Customer Experience Center end-to-end.\n</p>\n\n<p>As a Content Strategist &amp; Designer, you are tasked with staying on top of industry trends as well as Google’s latest in digital brand-building tools and technologies, keeping the rest of the team educated. This role will contribute to the ongoing development of a curriculum that fuels our workshops with a focus on narrative storytelling, data insights, and the entire suite of Google tools and technologies.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142607019405124294",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-09T01:01:45.779Z",
    "publish_date": "2019-03-09T01:01:45.779Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience working on content strategy and/or visual design as a designer.</li>\n<li>Experience leading conversations with senior-level audiences.</li>\n<li>Project management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with presentation software (e.g., Google Slides).</li>\n<li>Experience working on numerous projects at once and passionate about creating unforgettable in-person experiences.</li>\n<li>Experience in brand marketing and/or advertising with significant exposure to how marketing and media budgets are allocated.</li><li>Creative with structured thinking, and an emphatic storyteller, guided by audience and industry insights.</li>\n<li>Proactive and entrepreneurial. Able to handle multiple tasks, partner with cross-functional teams and work in a fast-paced environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Own and manage the program execution with the support of Facilitator and Data Visualization Specialist, partner closely with internal teams, write the pre-workshop briefs with the Facilitator, align with event owners on workshop objectives and desired outcomes.</li>\n<li>Design and create presentation templates and slides with a high design standard.</li>\n<li>Create a content strategy and run of show for future programs, and partner with team members to assess content needs on an ongoing basis. Iterate our existing programs constantly and develop new ones to keep our slate up-to-date and relevant.</li>\n<li>Contribute to the ongoing development of frameworks, case studies, workshop exercises, and curriculum with a focus on establishing Google as a trusted advisor.</li>\n<li>Uncover cultural trends and techniques that inspire our creative work to deliver best-in-class in-person experiences.</li>\n</ul>",
    "title": "Content Strategist & Designer, Customer Experience Center"
}