{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Chicago, IL, USA; New York, NY, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUOpvirk664X2xSuHKTcLfHE-crLxa5zY2rLSo2DzVsSOgASYQ8wdb5s7e893K-kZ5T-r3ATcbFSB1fkQPNrnbX2gupASzBYYLBWI1nP-6sfnCFQd-bBUBRu4tA%3D_V2&jobTitle=Global+Learning+and+Facilitation+Lead%2C+Sales+Trainings&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-28T23:01:54.256Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p><p>Our team works to transform sales capabilities at Google. We work to deliver learning experiences for Googlers. You&#39;ll be responsible for defining, creating and building a program for facilitators to deliver sales trainings. You&#39;ll collaborate cross-functionally across internal teams and external vendors/partners.</p><p>You&#39;ll set the strategy and execute on it, you have a passion for facilitation and have a passion for enabling people to perform at their best.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/79584924966757062",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-18T18:31:43.476Z",
    "publish_date": "2019-03-18T18:31:43.476Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>8 years of experience in sales, sales enablement or adult learning theory.</li><li>Experience facilitating learning trainings.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA degree.</li><li>Experience working in a fast-paced environment, with excellent program management skills.</li><li>Understanding of sales/business development.</li><li>Vision for the future, with the ability to execute within deadlines.</li><li>Excellent communication skills and ability to work with cross-functional partners for mutually beneficial outcomes.</li></ul>",
    "responsibilities": "<ul><li>Diagnose, research, and design learning experiences/journeys for internal teams that align with vision, philosophy and design principles.</li><li>Partner with instructional designers, program managers, and data analysts to establish consistent evaluation metrics, skill development opportunities, coaching practices and recognition/incentives.</li><li>Work with facilitators and with senior leadership globally.</li></ul>",
    "title": "Global Learning and Facilitation Lead, Sales Trainings"
}