{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdmhJH9efhMewy_02nNTtLx-fNByRAIWk69CIMOdeyQSOgCPMA3TLyu3RPbarlcbYAPfV2VmlPFdHaJ2DBKmJmgEsIQNQrT2GBgqEd-OzVdPclMtIjb6xykKr1Y%3D_V2&jobTitle=Go-to-Market+Associate%2C+Google+My+Business&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T00:01:29.165Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Product and Sales Activation team (PSA) is a global team whose mission is to bring Product to Market and Market to Product. We collaborate closely across partner teams such as Product Management, Marketing, Finance and other GCS teams. The team is responsible for understanding and advocating for product features that will make GCS customers successful in their digital marketing efforts while delivering against strategic business targets; identifying and working across GCS to set and deliver on priority growth initiatives. To accomplish this, the PSA organization combines strong strategic, problem solving, and execution skills with a strong drive for delivering results across a global organization.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5285888991100928",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-18T21:12:25.529Z",
    "publish_date": "2019-03-04T22:31:34.165Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience</li>\n<li>2 years of experience in business development, consulting, investment banking, corporate strategy, operations or equivalent project management experience in a technology/media company</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree</li>\n<li>Experience with small businesses, Google Ads, and/or Google My Business</li>\n<li>Ability to manage complex operational and strategic initiatives</li>\n<li>Ability to influence and work collaboratively with stakeholder teams</li>\n<li>Excellent written and oral communication skills</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Implement strategies to grow Google My Business (GMB) through third-party partnerships.</li>\n<li>Support new feature launches including communications, training and assisting with product readiness testing.</li><li>Work with Channel Sales, Marketing, and Product to identify best practices and develop supporting materials (e.g. pitch decks, case studies, FAQs).</li>\n<li>Manage program reporting, analyze trends in the business, and make recommendations to optimize Sales and Product decision-making.</li>\n<li>Lead special projects to grow the GMB third-party program in collaboration with Product, Marketing, Sales, Support, and other members of the PSA GMB team.</li>\n</ul>",
    "title": "Go-to-Market Associate, Google My Business"
}