{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYLertAL32rIEDeqKC6yo-q8oJclXezYZBqidmkFqQ4SOgCPMA3TAHybQ9kHC__QGDEHox0R_nJGvuiwN3JqZUxyKUrk4HIJndEglxBXxyPhNEibNtq-lQw3azE%3D_V2&jobTitle=Strategic+Partner+Development+Manager%2C+Google+Play+Games&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:46.991Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Armed with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.</p>\n\n<p>You&#39;re a passionate gamer and an experienced business development professional that&#39;ll advance our partnerships with key gaming companies in the industry. As the Strategic Partner Development Manager, you will use your love of gaming, business acumen and extensive industry knowledge to enable more game developers succeed on Google Play and Android. You will work with a team of Business Development Managers, drive and contribute to the vision and strategy for the Google Play Games business and influence the product roadmaps to ensure that diverse needs are met. You will also help partners drive business creation and growth on Google Play globally.</p><p>Google Play offers music, movies, books, apps and games for your devices, powered by the cloud. It’s a Google approach to entertainment, syncing magically across your devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping the product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team helps strengthen the overall Android ecosystem by giving developers and partners a premium store where they can reach millions of users.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5333361717608448",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:51:41.567Z",
    "publish_date": "2019-02-27T19:51:41.567Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in the gaming industry.</li>\n<li>Business development and partner management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>In-depth experience operating within and influencing cross-functional teams (product management, implementation, legal, finance, marketing, etc.).</li><li>Games industry experience.</li><li>Fluency with mobile game development technologies, business models, value chains and competitive landscape. Passion for gaming.</li><li>Developed product sensibility, with the capability to drive key product innovations or opportunities with the developer community.</li><li>Excellent written and oral communication skills in English, with the ability to represent complex business or technical concepts externally.</li></ul>",
    "responsibilities": "<ul>\n<li>Be the primary point of contact for global games executives and key US-based developers.</li>\n<li>Work across Google Play/Android (Product Managers, Engineering, Merchandising, Marketing etc.) and Google (Google Cloud Platform, YouTube, etc.) to shape the Google Play Games strategy and ensure our products and programs help developers succeed.</li>\n<li>Secure commitment from partners to support the strategic priorities of Google Play.</li>\n<li>Define and track key metrics to assess ecosystem health and address gaps.</li>\n</ul>",
    "title": "Strategic Partner Development Manager, Google Play Games"
}