{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeymdhhCaENsoz8aaYUsqXpSvevlE1kKvCQsVv71ZCgSOgCPMA3TR5u7a6218y27A6GTdf9cVo_xpYOvWVz8aViJM_w94OZxFdKOtVAtgD_vcyuxjRYtdI3d0PU%3D_V2&jobTitle=NPI+Supply+Chain+Program+Manager%2C+Technical+Infrastructure&loc=US",
    "categories": [
        "MANUFACTURING_SUPPLY_CHAIN",
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:27.382Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As an NPI Supply Chain Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Google is looking for a dynamic professional to lead all aspects of supply chain readiness in New Product Introduction (NPI) hardware products for our global data centers. \n</p>\n\n<p>As a Supply Chain Program Manager, you work with cross-functional teams starting with product inception to bring innovative products into the global data centers efficiently. You demonstrate domain expertise in material readiness, clear to build, supplier and contract manufacturer management, procurement, manufacturing and are well-versed in other aspects of operations and engineering that impact supply chain strategies and execution. In this hands-on role, you will be responsible for developing and executing materials plans to enable prototype builds and production ramp plans to be deployed to our global data centers. Product types include Networking, Infrastructure and Server and Storage. You will work closely with Engineering, Supply Chain Operations, Supply and Demand Planning, Contract Manufacturing and Supplier partners to launch new products and to implement processes and systems that directly scale new product deployments.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4826902932160512",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:40:16.127Z",
    "publish_date": "2019-02-27T19:41:36.252Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Industrial Engineering, Supply Chain Management, Business Administration, Operations Research or equivalent practical experience.</li>\n<li>10 years of industry experience in one or more of the following fields: New Product Introduction (NPI), Supply Chain Management, Manufacturing, Operations or Planning.</li>\n<li>Experience in managing Contract Manufacturers and Component Suppliers. Experience in driving materials and supply chain readiness.</li>\n<li>Experience in materials build readiness in NPI and supply chain readiness for Production. Experience in Supply/Demand Planning.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Industrial Engineering, Supply Chain Management, Business Administration or Operations Research.</li>\n<li>Experience working across all phases of a product from prototype to mass production to end of life.</li>\n<li>Experience with Accounting/Finance.</li>\n<li>Experience leading cross-functional process improvements.</li>\n<li>Comfortable shifting between hands-on detailed analysis and big picture thinking, and customizing communications based on the audience.</li>\n<li>Ability to collaborate and influence across multiple levels of an organization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive material and supply chain readiness for all NPI builds from concept phase to production handoff, partnering with cross-functional teams.</li>\n<li>Identify and communicate supply chain risks and mitigation plans to ensure materials readiness for NPI builds as well as supply continuity into production.</li>\n<li>Be the primary materials liaison with suppliers. Manage spend against project budgets, and manage large production risk buys and strategic buffers.</li>\n<li>Develop and document global supply chain map for each product, including suppliers, procurement model, lead time, shipment logistics, assembly/test/fulfillment model and spares strategies.</li>\n<li>Update project schedules, communicate status/risks and influence change. Represent the New Product Introduction Supply Chain organization in internal program meetings, driving initiatives and process improvements to help the team grow in scalability.</li>\n</ul>",
    "title": "NPI Supply Chain Program Manager, Technical Infrastructure"
}