{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTV5wI72bw8jTFBetmFhyIx_aJ7wcSe1NKzECBRFJ9ISOgASYQ8wyTabAA3m4noB00z0qXMCpNNOA17zpxuulhPotPdLkZtwVhY4J5UIAKMEMn440MKzm_YX2nU%3D_V2&jobTitle=Program+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T15:31:53.401Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>In this role on the Cloud Programs team, you will manage and scale multiple technical programs that will clarify, simplify, and amplify the client-facing and internal work of our global Customer Engineer and Solutions Architect teams. You will build positive relationships and work with stakeholders across multiple internal teams to support our Technical Sales teams as they engage clients, as well as complete and measure our work more effectively. You will make recommendations on program efficacy and the need to change course to be more effective, focusing on impact over activity.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/78749127552180934",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:56:41.335Z",
    "publish_date": "2019-02-27T19:56:41.335Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in program and/or project management in cloud computing or technology.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in the business technology market as a Program Manager in SaaS, Cloud Computing, and/or emerging technologies.</li>\n<li>Experience across Engineering, Sales, and Marketing teams in cloud computing or related technical fields.</li>\n<li>Track record of successful program outcomes from idea to launch in multiple contexts.</li>\n<li>Ability to manage the expectations, demands, and priorities of multiple internal stakeholders.</li>\n<li>Ability to work well under pressure with changing needs and direction in a rapidly-growing organization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Shape, ship, and show technical programs designed to support the work of the Cloud Customer Engineering teams.</li>\n<li>Measure and report on key metrics tied to programs to identify any need to change course, cancel, or scale the programs from a regional to global platform.</li>\n<li>Communicate status and identify any obstacles and paths for resolution to stakeholders.</li>\n<li>Establish expectations and rationale on deliverables for stakeholders and program contributors.</li>\n<li>Provide program performance feedback to teams in Product, Engineering, Sales, and Marketing to enable efficient cross-team operations.</li>\n</ul>",
    "title": "Program Manager, Google Cloud"
}