{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUYG4dsdYVa6hI0owUtm6RkBrb-p35bT3n4COD2OJ1ISOgCPMA3T9hswbnYiMdI82yGNzytNqHnbhZgSB4_xUG9LN70-24eiRXX17NA5-9EcZtsTVi_C95WzQr4%3D_V2&jobTitle=Director%2C+Product+Management%2C+Ads+Integrity&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-15T10:01:46.983Z",
    "description": "<p>We have a responsibility to our users, advertisers and partners to create a platform that is trustworthy, protects our user and advertiser interests, and also sets the standard for the industry on how to prevent and defend against attacks.\n</p>\n\n<p>Ads Integrity is responsible for protecting Consumers, Publishers and Google from bad ads. The team sets and manages the enforcement of the policies around what kinds of ads are acceptable to run through Google&#39;s products and services. Ads Integrity is a cross-functional team consisting of Product Management, Engineering, Human Reviewers, Policy Experts, as well as working with other functions like Public Relations, Marketing, and other products to ensure we protect consumers across all of Google’s surfaces. \n</p>\n\n<p>As Product Management Director for Ads Integrity, you will drive industry forward thinking on the topics of ad policy and defending against spam. You will be a public face for Google and will help the advertising community understand this critical area. You will be responsible for our internal strategy to address these challenges, balancing Google&#39;s interests and those of other parties to make online advertising better overall. Finally, you will lead a highly talented, experienced and technical team of product managers.</p><p>Users come first at Google. Nowhere is this more important than on our Advertising &amp; Commerce team: we believe that ads and commercial information can be highly useful to our users if, and only if, that information is relevant to what our users wish to find or do. Advertisers worldwide use Google Ads to promote their products; publishers use AdSense to serve relevant ads on their website; and business around the world use our products (like Google Shopping, and Google Wallet) to support their online businesses and bring users into their offline stores. We build and maintain the platforms that have made Google what it is today, and are constantly innovating to deliver the most effective advertising and commerce opportunities of tomorrow.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5034816211714048",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:47:36.416Z",
    "publish_date": "2019-02-27T19:47:36.416Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>10 years of experience building online advertising products.</li>\n<li>Experience in advertising policy, spam and cybercrime, legal background, and enterprise software experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Track record of success in the full lifecycle of product management: Product vision and roadmaps, writing exceptional PRDs, and shipping high-visibility and complex products on time.</li>\n<li>Experience in managing high-profile decisions and escalations that require executive coordination and sign-off.</li>\n<li>Experience in outbound industry relations work.</li>\n<li>Highly technical, with a track record of complex product work that spans business and consumer users.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop the policies, enforcement tools, and audit controls associated with ensuring the proper classification and integrity of the publishers that work with Google.</li>\n<li>Coordinate and present the status of development to multiple internal, executive, and external teams to ensure coordination and information sharing.</li>\n<li>Develop product features including requirements documentation, legal and privacy reviews, executive reviews, and launch reviews.</li>\n<li>Engage with 3rd party leaders in the space and represent Google’s interest in related cross-industry efforts and specifications.</li>\n<li>Manage commercial readiness process to ensure cross-functional alignment for feature launches. Oversee the product development process cross-functionally from ideation through development and commercial launch (including automation and manual enforcement).</li>\n</ul>",
    "title": "Director, Product Management, Ads Integrity"
}