{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRjUWvnmDnizAYCfeQtDGUz4cqouUwyIhS2p0AnsUf0SOgCPMA3Tatd417TXU4oBje5aIFZ1YbartMXJ7RB2R1Jzg6eotW0Q4F_vy_kwkk8LHA_3rDBWHhcEwk0%3D_V2&jobTitle=Program+Manager%2C+Facilities+Technical+Services&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:14.813Z",
    "description": "<p>As a Facilities Technical Services Program Manager, you are accountable for overseeing the program development and execution of technical services programs to support the REWS’s missions. These program includes Facilities Infrastructure Systems specification development and interpretation, Mechanical, Electrical and Plumbing (MEP) construction design development, energy conservation and sustainability, smart building technologies deployment, capital asset planning and facilities operations optimization. You will be comfortable working in a matrixed organization, building relationships in difficult situations, getting buy-in and consensus from colleagues with diverse opinions, driving decision-making where trade-offs are required and keeping information circulating so that Real Estate and Workplace Services (REWS) can grow coherently as Google expands. You will be an effective collaborator and enable Googlers team members and vendor partner teams to work coherently.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5519956915716096",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:46:10.735Z",
    "publish_date": "2019-02-27T19:46:10.735Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in a technical field or equivalent practical experience.</li>\n<li>8 years of experience in combined facility critical operations management and service with an emphasis on facilities, construction or corporate services within a large organization.</li>\n<li>3 years of experience in program management</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree.</li>\n<li>Certifications related to the industry (e.g., PE, LEED AP and/or CFM).</li>\n<li>Experience developing and managing budgets, including capital budget.</li>\n<li>Ability to bring creative, non-standard and innovative solutions to the table that help to enhance organizational functions and enable team productivity.</li>\n<li>Ability of project and program manage at scale and across complex businesses with high level of execution and quality.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create and implement a program to oversee the infrastructure systems design development in the real estate tenant improvement and new development construction projects in Google’s Bay Area real estate portfolio.</li>\n<li>Create and maintain a program that provides the construction project design guidance and infrastructure system design standards in accordance with our corporate real estate development strategy. Collaborate with the Real Estate Development team members to ensure project deliveries that promote creativity while ensuring consistency for the Operations team to maintain high level of efficiency.</li>\n<li>Manage the smart building technologies development and deployment across our portfolio. Drive innovation and ensure that REWS is pushing the boundaries of what is possible in Technological Innovation.</li>\n<li>Manage the Building System Engineering studies and New Technologies pilots to support the continuous improvement of the facilities operations and construction design support. Collect and evaluate post occupancy feed backs on infrastructure system design and installation to improve the program continuously.</li>\n<li>Create and manage the energy conservation program and sustainability program across the portfolio. Provide technical expertise to the Facilities Operations team and other REWS functional teams.</li>\n</ul>",
    "title": "Program Manager, Facilities Technical Services"
}