{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVxlG5prwqnckuXzi18YjJ0d-yWn393j7e9LN2A0UMUSOgASYQ8wEO7I2N00v2SQuDZ9k8pCKOKoAs-32XfDoH7JDaBiDwoHCmNbZD71_u0MxDk-EDRyOMxA6oY%3D_V2&jobTitle=Global+Head+of+Integrated+Marketing%2C+YouTube+Music&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-06T17:01:46.890Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>As the Head of Integrated Marketing for YouTube Music you&#39;ll drive strategy and execution of integrated marketing campaigns for YouTube Music. As a leader in the YouTube Music marketing organization, you will design and build the internal capabilities for subscriptions marketing and lead the integrated Marketing team.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/104333854208074438",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-06T17:01:46.890Z",
    "publish_date": "2019-03-06T17:01:46.890Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>10 years of experience working in a brand development focused role.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>A passion for music and/or experience in music marketing.</li>\n<li>Experience in consumer product marketing. Experience with large scale product launches.</li>\n<li>Integrated Marketing Campaign leadership experience and Go-to-Market experience.</li>\n<li>Experience building international playbooks/toolkits guiding regional and local Marketing teams.</li>\n<li>Ability to manage campaigns with large budgets.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead Go-to-Market campaign strategy and execution, including planning and creative and media briefs and driving execution with a cross-functional team of subject matter experts.</li>\n<li>Develop the calendar of YouTube Music moments and marketing opportunities, by working together with product marketing, media, creative, growth and international teams.</li>\n<li>Foster relationships with our content partners to acquire and clear partner content, build integrated co-marketing campaigns.</li>\n<li>Inspire and mentor the YouTube Music Integrated Marketing team.</li>\n</ul>",
    "title": "Global Head of Integrated Marketing, YouTube Music"
}