{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZgBSyQatKmptbjl0Oee6wuB1QCIsQ1blxQOJ0XFY2oSOgCPMA3Tas2I3KG74CGqiA3cUAy3h99J6UwjdbOozUC0XK0CLecpERn3XziPP4Y5rConWjxbizdTpQM%3D_V2&jobTitle=Technical+Program+Manager%2C+Network+Planning&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:37.095Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>Our team focuses on scaling the Google&#39;s network to meet growth in the Asia-Pacific (APAC) region by turning forecasts into network realities. In this role, you will partner and collaborate with strategic teams including Negotiation, Planning, Finance, and Engineering.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5292458495901696",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-04T10:01:52.032Z",
    "publish_date": "2019-03-04T10:01:52.032Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in networking technologies within the OSI model.</li>\n<li>5 years of experience in project management within cross-functional environments.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Demonstrated understanding of asian and global carrier networks.</li>\n<li>Distinctive analytical, problem-solving skills and financial skills.</li>\n<li>Excellent prioritization, multitasking and organizational skills.</li>\n<li>Excellent communication skills and a data-driven, analytical approach towards solving complex challenges.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with internal business and networking technical teams to identify and define tactical and strategic initiatives necessary to meet Google&#39;s ongoing needs for growth and optimization across APAC.</li>\n<li>Present network plans for approval by all internal stakeholders. Manage plan complexity ranging from short-term metro augments to long-term region-wide strategies for Google APAC network development.</li>\n<li>Manage the approved network plan with internal contributors such as network negotiators or vendor delivery managers until handover to the deployment team is complete.</li>\n<li>Communicate progress internally and advocate network plans.</li>\n<li>Help with execution of pre-negotiated orders and contracts with vendors as necessary and attend industry conferences such as Pacific Telecommunications Council (PTC) and International Telecoms Week (ITW).</li>\n</ul>",
    "title": "Technical Program Manager, Network Planning"
}