{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Seattle, WA, USA; Los Angeles, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc5ETiKQ80Guq7yXDnk3wL_K8gcX87hPjNKJt4gQLxkSOgCPMA3T_LFssP-UNKLTYZr8e-yDy1Ai17W30OUy7aCmySYP0X20spdtxfTGMeal7e7gvJZ4xRtg3ys%3D_V2&jobTitle=Sales+Engineer%2C+Big+Data%2C+Google+Cloud+Platform&loc=US",
    "categories": [
        "SALES_OPERATIONS",
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:49.047Z",
    "description": "<p>When leading companies choose Google Cloud it&#39;s a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p>\n\n\n<p>We’re on a mission to change the world of enterprise computing through Google Cloud Platform. You&#39;ll be helping to shape and execute strategies that help customers “go Google” for their core business. \n</p>\n\n\n<p>You&#39;ll use your technical experience and work on the Google Cloud Platform Sales Engineering (SE) team. You&#39;ll become a trusted advisor to our clients and prospects and an expert advocate for our Platform. In this role, you&#39;ll use both technical and business skillsets to move the business forward as efficiently as possible.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5741119028789248",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-02-27T19:44:52.041Z",
    "publish_date": "2019-02-27T19:44:52.041Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field or equivalent practical experience.</li>\n<li>Experience in data and information management as it relates to Big Data.</li>\n<li>Experience using and/or managing databases.</li>\n<li>Experience with one more of the following: Map Reduce, Hadoop, Spark, Flume, Hive, Impala, SparkSQL, BigQuery.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other technical field and experience with Big Data, PaaS, and IaaS technologies.</li>\n<li>Experience architecting and developing software for scalable, distributed systems.</li>\n<li>Web application development and integration experience. Software development platforms and solutions experience in J2EE, Java servlets, JavaScript, Python, Go, PHP, ASP, CGI or Ajax.</li>\n<li>Working knowledge of Linux, Web 2.0 development platforms, solutions, and related technologies (HTTP, Basic/NTLM, sessions, XML/XSLT/XHTML/HTML), understanding of DNS, TCP, Firewalls, Proxy Servers, DMZ, Load Balancing, VPN, VPC).</li>\n<li>Ability to quickly learn, understand and work with new emerging technologies, methodologies and solutions in the cloud/IT technology space.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work to identify and qualify platform opportunities and determine if Google Cloud Platform is right for clients. Identify business and technical requirements, conduct full technical discovery and architect client solutions to meet gathered requirements.</li>\n<li>Take responsibility for the technical aspects of the business cycle including such activities as advocating technology, supporting bid responses, product and solution briefings, proof-of-concept work and the coordination of supporting technical resources.</li>\n<li>Work hands-on with Google for Work Cloud Platform products to demonstrate and prototype integrations in customer/partner environments.</li>\n<li>Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition using techniques such as whiteboard and slide presentations, product demonstrations, white papers, trial management and RFI (Request for Information) response documents.</li>\n<li>Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution providing best-practice advice to customers to optimize Google Cloud Platform effectiveness.</li>\n</ul>",
    "title": "Sales Engineer, Big Data, Google Cloud Platform"
}