{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Cambridge, MA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWudAeR7GFHKbXJ9D299Q-OKces80cl8SlVIFx3mDOkSOgASYQ8wzXhKogIPzNLV66r9tUWj64sy-E1OYEumdfREIg0yNEfF2pWhyqhQovUvFZcHzCzKwNHdDd4%3D_V2&jobTitle=Technical+Account+Manager%2C+Financial+Services%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T16:31:34.183Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n<p>Our Professional Services organization brings product and implementation experience directly to our customers, injecting passion and know-how to help them get the most out of Google Cloud.\n</p>\n\n<p>As a Cloud Technical Account Manager (TAM), you will draw on your technical, communication, and organizational skills to help customers get the most value from their Google Cloud Platform and G Suite investments. Your previous experience working with companies in the Financial Services sector on enterprise infrastructure implementations, cloud platform design, Big Data solutions, and application development will play a critical part in your day to day work driving success and advocating for our most critical strategic customers. You will manage all aspects of Google Cloud adoption, helping customers accelerate their journey to our platform and optimize their business and technical operations.\n</p>\n\n<p>In this role, you will develop deep and lasting relationships with business executives and IT stakeholders to develop an understanding of their business requirements and goals. Building on this knowledge, you will manage the shared strategic roadmaps to drive customer partnerships, provide technical guidance and program leadership, and facilitate customers’ digital transformation to maximize their value on Google Cloud.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/109002599488725702",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-02-27T19:54:57.609Z",
    "publish_date": "2019-02-27T19:54:57.609Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.</li>\n<li>4 years of experience in a financial/quantitative analysis firm, consulting firm, or financial services company in an infrastructure and/or data systems environment.</li>\n<li>Experience working with a cross-functional and geographically dispersed team and customer base.</li>\n<li>Ability to travel domestically and internationally up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of experience working with financial services organizations in a direct or consulting capacity, supporting migration of workloads in areas such as AML, Trade Surveillance, Market Risk, Credit Risk, Capital markets, Retail Banking, and Private Wealth management. Experience with governing bodies such as the OCC &amp; SEC.</li>\n<li>Experience in application/workload migration to Google Cloud Platform and other cloud services, with a focus on migrating big compute workloads from on prem to cloud or to a hybrid solution.</li>\n<li>Experience working with channel partners, systems integrators, and third-party developers to deliver solutions.</li>\n<li>Experience in cloud operations and technical support or operations (e.g., capacity planning, product release management, etc.).</li>\n<li>Experience in at least 2 of the following areas: data center infrastructure, operating systems, networking, security, system administration, service management growth, and/or data architecture.</li>\n<li>Knowledge of financial services industry regulations/policies for cloud-based technical solutions. Knowledge of PCI compliant, GDPR, SOX 404, and Basel II.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive the customer partnership for key strategic customers. Establish executive relationships, conduct customer QBRs, advocate for customer to rapidly overcome blockers, and coordinate across multiple work streams and teams to maintain momentum.</li>\n<li>Manage the post-sales relationship with customers to maximize value. Collaborate with customer technical and implementation leads and partners to manage and drive successful adoption of Google Cloud.</li>\n<li>Guide customers through the entire innovation lifecycle, building strategic roadmaps and driving achievement of key milestones. Serve as lead and advocate for business transformation, enabling teams to embrace cloud technologies.</li>\n<li>Provide best practices and accelerated support for Google Cloud Platform and G Suite Solutions. Develop best practice recommendations for Google Cloud partners based on the experience gained during customer engagements and the needs of the financial services industry</li>\n<li>Drive customer feedback to Google Product Management and Engineering to ensure the best possible production experience. Assist in prioritizing product requirements by communicating customer needs and impact.</li>\n</ul>",
    "title": "Technical Account Manager, Financial Services, Google Cloud"
}