{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaS8rUzTxcKbKexWG6z23gvK9iyNPdH9n9KjtkIzJBwSOgASYQ8wJMBRv8syjdKSQeFK5vRfhiSVN6IJ7FnPtFI6_5S6simxcABQzqtVYJ314yvH3K-Z3o_7C3E%3D_V2&jobTitle=Global+Product+Lead%2C+Search+Creative%2C+Google+Customer+Solutions%2C+Product+and+Sales+Activation&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T21:31:39.319Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Customer Solutions and Innovations team is responsible for developing performance and brand product solutions for the Google Customer Solutions (formerly SMB) business. We are the product and business experts behind the Google Costumer Solutions (GCS) Googlers that are responsible for driving sustainable business growth and product adoption. We identify opportunities through data-driven analysis, develop business cases for those opportunities, build consensus with stakeholders, and program manage cross-functional teams to drive GCS advertiser success and business growth. \n</p>\n\n\n<p>In this role, you&#39;ll manage functional areas of Search and be responsible for product adoption metrics. You&#39;ll be an expert in your product area and will know how GCS customers engage with our products. Additionally, you will analyze data to uncover opportunities to accelerate business growth, building models to determine addressable audience, business impact, and expected growth opportunities. You&#39;ll also be a leader for GCS search opportunities, engaging with the various product, marketing and GCS teams (e.g., Acquisitions, Channel Sales, Sales, etc.) to drive product changes, create go-to-market strategies, and design effective incentive systems to help drive Global GCS Search business.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/111345205380031174",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:55:48.738Z",
    "publish_date": "2019-02-27T19:55:48.738Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of professional work experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s Degree or equivalent practical experience.</li>\n<li>Experience managing customer relationships and communicating change.</li>\n<li>Experience with digital marketing products and the digital marketing landscape.</li>\n<li>Track record of successfully managing complex, international projects.</li>\n<li>Ability to influence counterparts in Sales, Marketing, and Operations.</li>\n<li>Excellent analytical and problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Become subject matter expert for Search.</li>\n<li>Define GCS product and go-to-market strategy for one or more functional areas within Search.</li>\n<li>Work with Product, Marketing, and Operations to identify and size market and customer opportunities, plan and manage programs to execute against those strategies, and partner with Sales leadership on achieving the strategies globally and in-region.</li>\n<li>Identify key product needs across GCS (i.e., Sales, Acquisitions, Services) and link with Product to execute action plans.</li>\n<li>Use customer data and trends to develop scalable global solutions for client interaction, sales and services. Develop and refine best practices and collateral.</li>\n</ul>",
    "title": "Global Product Lead, Search Creative, Google Customer Solutions, Product and Sales Activation"
}