{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYJAIQ4AdnycHk8UTNWMQ3jHB7H1Fg864GC7_0JNFLsSOgCPMA3TFMX-dsTDnXmIoBj7B37ctjqrcgrX5rbsHJDf9t3p09TTCtarRkGuhgp0ceJzZzYhnp-5Ges%3D_V2&jobTitle=Investor+Relations+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:05.624Z",
    "description": "<p>Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. A master juggler working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.</p>\n\n<p>You are a quick-witted and intelligent financial analyst and are at ease in a constantly changing environment, where poise under pressure and attention to detail are critical to the team’s success.\n</p>\n\n<p>As an Investor Relations Analyst, you will coordinate quarterly earnings calls and support the ongoing communications activities of the firm with shareholders and sell-side research analysts. You will work cross-functionally and provide a broad level of exposure throughout the organization, including with senior executives.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5580380285632512",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:38.183Z",
    "publish_date": "2019-02-27T19:50:38.183Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of work experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor&#39;s degree with an emphasis on coursework of a quantitative nature (e.g., Mathematics, Physics, Statistics or Economics).</li>\n<li>Thorough knowledge of finance and accounting.</li>\n<li>Excellent multitasker with the ability to manage disparate projects at the same time. Ability to see the big picture.</li>\n<li>Exceptional analytical skills including a high proficiency in spreadsheet software. Passion for technology and finance.</li>\n<li>Excellent attention to detail.</li>\n<li>Excellent communication and people skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop knowledge of Alphabet’s business and products to assist in education of sell-side research analysts and institutional investors about the company.</li>\n<li>Assist in preparation of earnings-related materials for management.</li>\n<li>Assist with monitoring analyst reports and estimates of financial performance and assist on investor engagement.</li>\n<li>Help run investor events, including preparing briefings for our executives and running on-the-ground planning and operations.</li>\n<li>Assist the team in various cross-functional internal projects as needed.</li>\n</ul>",
    "title": "Investor Relations Analyst"
}