{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaOnONODXL_R5i4wY6KMmh06Fz2RKjTZJ-WovRTDtM4SOgASYQ8wNpbDm0tJBE7W-sfQZjLhXnSEYdLMM0iFgmF240SUpxGsi_oRHt6LjR-CBTQWPhfSiE8cKVo%3D_V2&jobTitle=Project+Manager%2C+Construction&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T18:01:52.168Z",
    "description": "<p>With the Google Access team, you’ll work on cross-product and cross-team initiatives, working closely with cross-functional team members to refine and evolve our projects, as well as deploy new technologies to markets and communities around the globe. You like being on-the-ground, executing complex projects that bring internet access to people.</p>\n\n\n<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a MXU Field Construction Manager at Google, you lead complex, multidisciplinary projects. You plan requirements with internal vendors and customers and guide projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders.\n</p>\n\n\n<p>With the Google Access team, you’ll work on cross-product and cross-team initiatives, working closely with cross-functional team members to refine and evolve our projects, as well as deploy new technologies to markets and communities around the globe. You like being on-the-ground, executing complex projects that bring internet access to people.</p><p>At Access, our mission is to create abundant internet on networks that are always fast and always open. Google Fiber provides superfast Internet to homes across the U.S. We want to bring Google Fiber to customers even faster, so we’re focused on making deployment more efficient and less intrusive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/117132257602216646",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-07T18:01:52.168Z",
    "publish_date": "2019-03-07T18:01:52.168Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Construction Management, Engineering, Business, Telecommunications, related field, or equivalent practical experience.</li>\n<li>8 years of experience with fiber network deployments and constructing new plant fiber infrastructure. 5 years of experience with MDU infrastructure.</li>\n<li>5 years of experience in managing contractors.</li>\n<li>Experience designing and building scalable construction, installation, and support processes.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience with fiber network deployments. 5 years of experience with FTTH infrastructure.</li>\n<li>Experience with Geographic Information Systems (GIS) and database management including AutoCAD, ESRI, and/or shape file functionality. Experience in operational improvement, process/workflow development.</li>\n<li>Experience with project management tools and web applications.</li>\n<li>Experience interpreting fiber test results and auditing projects for compliance with scopes of work. Knowledge of network drawings, route maps, and scopes of work.</li>\n<li>Ability to innovate our means and methods and potentially change industry standards.</li>\n<li>Excellent written and verbal communication, interpersonal, analytical, financial, organizational, prioritization, and multitasking skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and manage program management functions within the metro to include aspects of project initiation, planning, executing, controlling, and closing.</li>\n<li>Operate across internal Google Fiber groups and external organizations to ready and implement operational processes. Execute multiple projects/programs/planning in support of regional long-term processes.</li>\n<li>Lead process improvements that result in efficiency and efficacy gains throughout deployment and operations in the market.</li>\n<li>Manage project budgets, scheduling, planning, and contractor resource assignment. Track contractor performance including billing against budget and contract, manage proposals, SOW’s, bids, scope definition, engineering design cycles, and design review and approvals.</li>\n<li>Work with and communicate progress to internal stakeholders and ensure that projects are scoped properly and handed off seamlessly for network deployment. Coordinating all project activities.</li>\n</ul>",
    "title": "Project Manager, Construction"
}