{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Austin, TX, USA; Mountain View, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSZM47hyKC_VbN4YPhKlRHnqw-WKziSsMhwvuzapcpwSOgASYQ8wnDK3xPdtMaEJ2gkEi99h-cYFI8gLY_VXMtnkgl_3bbsUVY9qXaNqOPQQzuqbVmK7LtWILFo%3D_V2&jobTitle=Recruiter%2C+Cloud+Sales&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-25T22:01:43.438Z",
    "description": "<p>Google is known for our innovative technologies, products and services — and for the people behind them. The Google People Services (GPS) team focuses on providing an amazing experience to past, present and future Googlers. As a member of our recruiting team, you&#39;ll be charged with finding unique candidates who bring an entrepreneurial spirit, a sense of scrappiness and a diversity of thought to all that they do. You will be responsible for guiding candidates through our hiring process and introducing them to the magic of working at Google. You are driven, eager and able to use your creative skills to develop lasting relationships with both candidates and hiring managers. You&#39;re also comfortable with numbers and can draw insights from analytics to make our hiring process smarter, friendlier and more efficient.</p>\n\n\n<p>In this role, you are the first step to building and growing Google Cloud. This role is part sourcer, part client-advisor, and part-innovator. You’ll have an opportunity to be part of a team fueling the growth of our Sales organization.</p><p>Great just isn&#39;t good enough for our People Operations team (you probably know us better as &quot;\u0098Human Resources&quot;). Made up of equal parts HR professionals, former consultants and analysts, we&#39;re the advocates of Google&#39;s colorful culture. In People Ops, we &quot;find them, grow them, and keep them&quot;\u009d - we bring the world&#39;s most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142165060559479494",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-06T02:01:41.730Z",
    "publish_date": "2019-03-06T02:01:41.730Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of full-cycle recruiting experience.</li>\n<li>Experience in enterprise software sales recruiting or executive search.</li><li>Experience working with senior-level clients.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Impeccable partnership skills as well as an innate drive to be responsive, action-oriented, and flexible to rapidly changing priorities with an emphasis on tact and diplomacy. Teamwork skills along with the ability to grasp new technologies.</li>\n<li>Excellent communication and interpersonal skills; proven ability to take initiative and build strong, productive relationships.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Source, evaluate skill level, conduct efficient and professional interview process, and drive offer process, including reference checks when appropriate, salary recommendations and negotiations, and closing of candidates.</li>\n<li>Create and implement a staffing business strategy that will be the framework for achieving an annual hiring plan that emphasizes quality and diversity of hires, process efficiency, and strong client management and candidate satisfaction.</li>\n<li>As one of our team&#39;s diversity advocate, you will partner with our clients and peers to help shape the direction of our diversity programmatic strategy by launching innovations, surfacing trends, and driving impactful initiatives.</li>\n<li>Communicate effectively with Google Cloud Sales leaders, hiring managers and interview teams.</li>\n<li>Manage candidates through Google&#39;s multi-faceted hiring process, maintaining a focus on excellent candidate and client experience throughout the process. Propose and implement ongoing improvements to Google’s recruitment efforts.</li>\n</ul>",
    "title": "Recruiter, Cloud Sales"
}