{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU76jQnP2Ea9okYCIRJC7FDfhHUaP3pnsUOS9XkRgZcSOgASYQ8wiVx1diBIoexjmHwt3itbNu0xPKYdnRgRrk2_QkbMR3A7fOg4-ji3V-YhYtavNWftUQF7WG8%3D_V2&jobTitle=Marketing+Campaigns+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T16:01:43.109Z",
    "description": "<p>Google is developing groundbreaking cloud solutions for companies, leveraging years of experience in building secure, reliable, and scalable cloud technology. With excellent Google differentiation in data analytics and machine learning, security, application development and collaboration software, we’re well on our way -- but we need more people who can help us write and tell that story. If you’re as excited about building what’s next as we are, Google Cloud is the place for you.</p>\n\n<p>As a Marketing Campaigns Manager, you will lead the strategy, execution, and growth of integrated global campaigns, leveraging the appropriate channels and methods to help connect developers to the relevant Google tools and resources.\n</p>\n\n<p>You&#39;ll drive Google Cloud awareness, learning, product adoption, and feedback through engaging, audience-focused activities. You are passionate and committed, and bring experience from working in a software or other technology cloud B2D organization. \n</p>\n\n<p>You’ll work on our content, creative, and media strategy and ensure that we deliver high-quality campaigns that meet the needs of developer communities and technical practitioners. You will drive optimizations throughout the entire campaign lifecycle, track the performance of key metrics, and report the impact of campaigns on business objectives.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/106096239948243654",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:49:34.666Z",
    "publish_date": "2019-02-27T19:49:34.666Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>5 years of experience with designing, building, and launching B2B or B2D software lead and demand generation campaigns.</li>\n<li>5 years of experience in end-to-end marketing campaign planning and execution.</li>\n<li>Experience in product integration and end-to-end campaign attribution with Marketo and Salesforce.</li>\n<li>Experience working collaboratively with a multi-disciplinary approach to synthesize learnings and performance insights.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Automated Bid Manager tactics as well as email, search, display and social marketing techniques.</li>\n<li>Expertise with marketing optimization programs and website analytics.</li>\n<li>Demonstrated knowledge of measurement approaches, including multi-touch attribution.</li>\n<li>Ability to create effective relationships to influence and collaborate, across all levels.</li>\n<li>Excellent problem-solving skills, with the ability to run analyses, track metrics, and find creative ways to optimize performance.</li>\n<li>Proven project management skills (e.g., managing cross-functional teams, external creative and media agencies, and marketing vendors).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create integrated marketing campaigns that drive adoption of Google Cloud products, including campaign execution, tracking, and measurement through marketing and CRM tools.</li>\n<li>Demonstrate accountability for achieving individual and shared goals, working closely with Sales, Marketing, Professional Services, Training, Product, and Developer Advocate teams to set expectations for developer volume and quality, adoption rates, developer user journey, and training.</li>\n<li>Apply growth marketing principles in all campaigns to optimize marketing performance.</li>\n<li>Test and refine new marketing approaches and channels to reach and engage key audiences.</li>\n<li>Collaborate on global campaigns across the Americas, EMEA and APAC regions, and work collaboratively and iteratively with the global team to synthesize learnings and performance insights.</li>\n</ul>",
    "title": "Marketing Campaigns Manager, Google Cloud"
}