{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUL4oF8FHNsvM556hyaVINF6GvtfD3Md7UPCPBCF6SkSOgCPMA3TjyBP2pPfd3Dt8b8b4LS6NZ5z7Jv2i2yg-aFhAIVfw1_Tuzw3ZRI1bnh9UgOUqK_SQoeBieY%3D_V2&jobTitle=Director%2C+Corporate+Development&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:44.043Z",
    "description": "<p>As the Director, Corporate Development you lead a team of Corporate Development professionals and work collaboratively across functions (including Product, Legal, Finance and People Operations) to identify, evaluate, and negotiate Google’s most complex acquisitions, investment and other strategic deals. You are the primary point of contact within the Corporate Development team for multiple Product Area SVPs, providing them with the insight needed to drive intelligent, sound decision-making. You understand the industry landscape and regional nuances, and harness them to lead our deals and integration. With an air of humility, you bring strategic thinking, strong quantitative skills and sound business judgment, along with the ability to think about what is -- and what could be.</p><p>The Corporate Development team drives Google&#39;s worldwide growth by identifying exciting acquisition and strategic investment opportunities across existing and future markets – and then working to make them happen. Consisting of experienced merger-and-acquisition leaders, investment professionals, scouting and strategy specialists, and integration experts, we&#39;re dedicated to identifying the business opportunities of tomorrow. We drive team decisions, lead negotiations, and help run post-acquisition integration and performance evaluation.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5580268188663808",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:31.289Z",
    "publish_date": "2019-02-27T19:52:31.289Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>13 years of experience in corporate development, venture capital, private equity, investment banking, or product management in the technology industry.</li>\n<li>Analytical experience; both quantitative and qualitative.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master’s degree, JD or equivalent work experience.</li>\n<li>16 years of relevant work experience.</li>\n<li>Experience running teams of Corporate Development professionals.</li>\n<li>Deep industry experience in several of Google’s Product Areas.</li>\n<li>Excellent interpersonal and communication skills, including with C-level executives and at industry events.</li>\n<li>Multiple deep relationships in the technology industry and community.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead large and complex Mergers and Acquisitions (M&amp;A) strategy projects. Be an expert in all aspects of M&amp;A and other strategic deals, including sourcing, evaluation, negotiation, execution and integration.</li><li>Set and establish M&amp;A priorities for multiple Google Product Areas; facilitate and drive sound M&amp;A-related decision making, including building consensus and driving decisions at the most senior levels. Serve as a board member or observer on investments.</li>\n<li>Manage the board/conference room and negotiate large and complex M&amp;A deals with composure, objectivity, balancing diplomacy (including empathy, as appropriate) with the ability to drive to outcomes that are in Google’s best interests. Demonstrate courage and communication skills to argue against bad deals.</li>\n<li>Develop strong relationships with the most senior Google executives and be seen as a ‘trusted advisor’ through expertise and effectiveness on both corporate development and Google strategic matters. Develop and maintain strong relationships within the technology community, including VCs, entrepreneurs, bankers, etc.</li>\n<li>Determine vision, strategy and direction of broader Corporate Development team; contribute to processes, tools, best practices, and training. Speak publicly at industry events.</li>\n</ul>",
    "title": "Director, Corporate Development"
}