{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf2mQFnf2Lc09XcS1Y-az2SxXm0XgDpw4uZnZcYxeAwSOgCPMA3TbV9slvk1fVP57D6wT-JRKfXs5507jrutNUsgXfsynrwzEXNWv_-1H8BOIc61zDNz6exmfKs%3D_V2&jobTitle=Lead%2C+Sales+Strategy+and+Operations%2C+Google+Ads&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-12T21:01:48.985Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Google Customer Solutions (GCS) Acquisitions Sales Organization drives the acquisition of new advertisers for Google by leveraging several channels and the Marketing organization.\n</p>\n\n\n<p>The role reports into the Acquisitions, Channel Sales, and AppDev team (ACA) which is a central team responsible for strategy and operations across GCS Acquisitions channels. The team leads the design and planning for programs that generate business growth for Google. Experts in developing strategy and delivering process improvements, team members are both analytical and strategic, taking a pragmatic approach to driving high impact.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6499167865995264",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:52:37.622Z",
    "publish_date": "2019-02-27T19:52:37.622Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>MBA degree or equivalent practical experience.</li><li>10 years of experience in management consulting, corporate strategy, or equivalent sales operations or project management experience in a technology/media company.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience working in the areas of strategy, organizational design, process optimization, and go-to-market approach.</li><li>Track record of building, managing, and developing high performing teams and future leaders.</li><li>Understanding of sales, media, and digital advertising platforms. Knowledge of sales systems and tools.</li><li>Ability to lead projects and independently scope, prioritize, and execute initiatives.</li></ul>",
    "responsibilities": "<ul>\n<li>Work directly with leaders on critical strategic, organizational, and operational projects designed to increase business growth productivity and operational efficiency.</li>\n<li>Analyze and determine insights from key business drivers, trends, and operating metrics.</li>\n<li>Work with cross-functional teams, including Sales, Marketing, Finance, and Engineering.</li>\n<li>Lead strategic projects, see forward on the business, and provide coaching and thought partnership to your team.</li>\n<li>Communicate recommendations to leadership and the broader organization.</li>\n</ul>",
    "title": "Lead, Sales Strategy and Operations, Google Ads"
}