{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZuV9ZrPJMEdWdH2n5Hk_OSbZ0V71NcfDDOu16xHVYsSOgASYQ8w66NedQkaPssU7IexfMtemmurPzkVTDP05koosEABIK22qSnQlgx7mhgjbG81xwNv6xHZRw8%3D_V2&jobTitle=Global+Marketing+Operations+Lead%2C+Safety%2C+Brand+Studio&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-06T19:31:39.699Z",
    "description": "<p>Brand Studio is a passionate team of creative thinkers and marketers. We protect and promote Google’s brand and reputation through programs, products and narrative experiences that express Google’s values in action across the world. As part of our team, you’ll define and create the visual and strategic elements that comprise Google’s brand and product identities. You’ll articulate standards that harmonize and bring a uniquely Google point of view to all of our products and communications. By embracing user insights, strategic thinking, beautiful design and provocative execution, you will create delightfully intuitive (and inventive!) experiences that will define the future of Google’s brand.</p>\n\n<p>The debate around data privacy and security and the expectation for tech companies to demonstrate responsibility has never been louder. The way users and influencers perceive our stance on respecting their data has huge impact on our brand and our future, shaping how they trust and advocate for us. This means helping them understand that we never stop protecting their data with our industry-leading security, and that we respect their privacy by providing data controls so they can choose the privacy settings that work for them. Ultimately we need to help people understand more about these important topics so they can enjoy our services without worrying about the safety of their personal information and data.\n</p>\n\n<p>We’re looking for someone with a passion for working on tough challenges, an appetite for working in a fast-paced environment with high executive visibility, and a desire to work on something of utmost strategic importance to the company and ultimately the future of the Internet.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/130984603692212934",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:53:54.038Z",
    "publish_date": "2019-02-27T19:53:54.038Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience in program management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Demonstrated ability to think strategically about complex issues, leading to thoughtful recommendations, action plans and processes.</li>\n<li>Strong leadership and project management skills with a proven track record of managing complex projects with multiple stakeholders and multiple priorities.</li>\n<li>Record of consistently delivering quality outputs with tight deadlines in a dynamic environment.</li>\n<li>Demonstrated ability in, and high comfort with, leading in an ambiguous, high-pressure and fast-paced environment.</li>\n<li>Genuine interest and passion in driving this critical conversation around data privacy and security as it increasingly becomes mainstream news.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Facilitate and manage relationships and operations between global and regional teams to ensure cohesive execution on all safety topics</li>\n<li>Drive clear cross-functional teams and communications, including with a wide range of PA’s and executive stakeholders</li>\n<li>Provide oversight of resources, budget and production</li>\n<li>Help continuously prioritize the time and resources of a rapidly growing team</li>\n</ul>",
    "title": "Global Marketing Operations Lead, Safety, Brand Studio"
}