{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckczmkkL7WS0rbub6TpdgrQr0DdRCi-zcGbKdCcR36RMSOgASYQ8woGe7KFyASaSmxAW28svop452vaQM0o2De3i-Kle7-KCoMoUvGjh9uml91gVif1sDVnvSC6Y%3D_V2&jobTitle=Direct+Sales+Business+Process+Analyst%2C+Cloud+Business+Transformation+Organization&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T21:01:44.413Z",
    "description": "<p>The Cloud Business Transformation Organization is responsible for programs that enable Google Cloud to go-to-market, enterprise ready, at Google scale. Our team partners with Product, Sales, Engineering, and other cross-functional partners to develop systems, tools, and processes. We empower our sellers and channel partners with the tools and data they need to be more productive and successful.</p>\n\n\n<p>As a Direct Sales Business Process Analyst, you will work directly with Google Cloud teams to re-imagining the business processes and systems across Marketing, Sales, Support, and Partners, collaborating between the the Google Cloud business and IT teams. In this role, you will use strategic thinking and excellent business judgment to leverage an understanding of sales processes to guide decision making, solve challenges, and provide analytical insights to support strategic and tactical initiatives across the Cloud organization.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/121189419672576710",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:04.792Z",
    "publish_date": "2019-02-27T19:49:04.792Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in a Business Analyst/Program/Portfolio Management role.</li>\n<li>3 years of experience working in CRM and/or supporting a a global sales organization</li>\n<li>Experience with Salesforce.com.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in Salesforce.com, Sales Cloud, CPQ, Billing, SQL, and ERP.</li>\n<li>Experience streamlining the processes and related system changes on lead to cash and identifying inefficiencies on current or proposed processes.</li>\n<li>Understanding of sales and marketing business objectives.</li>\n<li>Ability to develop and translate business requirements to functional requirements, identify gaps and execute testing of new, or modified, systems functionality or rules.</li>\n<li>Ability to drive the end-to-end lifecycle of developing integration solutions, from conception, to launch, and post-launch support.</li>\n<li>Ability to articulate solutions to business stakeholders, technical and non-technical people across all levels of staff and management. Excellent communication and problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create business requirement documents, user stories, functional specifications, and user acceptance test scenarios.</li>\n<li>Lead workshops to gather requirements using interviews, document analyses, requirements workshops, surveys, site visits, business process descriptions, use cases, business analyses, architecture diagrams and task/workflow analyses.</li>\n<li>Interact, consult, and partner with members of the global Google Cloud business and extended teams including but not limited to Engineering, Business Intelligence, Sales, and Data Governance to identify and build solutions and processes.</li>\n<li>Understand and design configuration and workflow for new processes and systems that maximize functionality and minimize customization.</li>\n</ul>",
    "title": "Direct Sales Business Process Analyst, Cloud Business Transformation Organization"
}