{
    "application_instruction": "<b>This role may also be located in our Playa Vista, CA campus.</b><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: Los Angeles, CA, USA; San Bruno, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSCrepzdKiSgbDoslmB_z_J3DmyFd6iC-ZICMhUiIhQSOgASYQ8wzLQxLGf3orBq1kI0Irhfz3fnsBM03EjQU36_jkAPkCOiSJDMYxKDz6iBemQ1U07yxYd6mvc%3D_V2&jobTitle=Learning+Experience+Designer%2C+Creator+Academy%2C+Scaled+Education&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-22T20:31:40.531Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, presenting unique challenges and opportunities to support over a billion monthly users globally. Fast-paced, dynamic, and proactive, the YouTube Support team provides seamless, brilliant support to our content creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it, and to allow our users’ voices to help shape product solutions. <br><br>As a member of the Support team, you&#39;ll analyze top issues facing our users and content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you&#39;ll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.</p><p>As a Learning Experience Designer, you will join YouTube’s Scaled Education team to enable creators by creating personalized learning experiences within YouTube’s Support and Education Operations organization. In this role, you will drive the educational content direction and writing within the Creator Academy, focusing on attractive microlearning content. You&#39;re passionate about creator education and an excellent communicator who works well in ambiguity and has the ability to adapt to a fast-paced, changing landscape. Our self-service, Scaled Education products include the Creator Academy learning portal, the YouTube Creators channel, and the Help channel. </p><p>Please include examples of microlearning content and one additional writing sample with your application.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/118650610682602182",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-07T01:32:07.166Z",
    "publish_date": "2019-03-07T01:32:07.166Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in education, a related field (e.g., instructional design, communications, writing, marketing), or equivalent practical experience.</li>\n<li>3 years of experience developing online education content, writing for the web and multimedia development, and measuring content effectiveness.</li>\n<li>Experience in project management and working with cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to handle operations management of a complex online content production pipeline, including legal approvals, global localization campaigns, and learning management systems.</li>\n<li>Understanding of the YouTube platform and creators and the competitive landscape of education and technology.</li>\n<li>Ability to write complex educational concepts that are concise yet easy to understand. Interest in data, measurement, and analysis.</li>\n<li>Ability to partner cross-functionally with global subject matter experts, Legal, Marketing, PR, and localization teams.</li>\n<li>Ability to prioritize and execute multiple simultaneous projects in collaboration with cross-functional teams.</li>\n<li>Excellent writing, editing, visual communication, script writing, and critical reasoning skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with a team of learning designers and video producers to write creative microlearning content that’s relevant for a creator audience.</li>\n<li>Develop written modules that can live across multiple platform surfaces, meeting creators where they are in their learning journeys.</li>\n<li>Collaborate with multiple teams at YouTube and partner with product specialists, subject matter experts, and Marketing and Legal to ensure content relevancy, approvals, and distribution.</li>\n</ul>",
    "title": "Learning Experience Designer, Creator Academy, Scaled Education"
}