{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRiq7dey-dJvphqY0cgVwsdQvFxIx5KyttekzqC5NkISOQASYQ8w4z6GMwnl-0x_EZ2fb96TdEuEuLEVPxMZzDl6WOc1LTK0W-tzu5TFwrlatshG-lN0-1exsA%3D%3D_V2&jobTitle=Strategic+Partner+Manager%2C+eCommerce&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T17:31:48.366Z",
    "description": "<p>Google&#39;s line of products and services to clients never stops growing. Strategic Partner Managers have the rare opportunity to build a long-lasting relationship with our top partners. You cultivate these existing partnerships to make sure they can take full advantage of Google&#39;s ever-growing suite of offerings. You possess strong relationship-building skills and are apt to see mutually beneficial opportunities with partners in order to best represent our users, products and programs.</p>\n\n\n<p>Our team works to secure premium brand safe inventory for Google’s advertising demand and help our partners leverage the best of Google’ products and platforms to continue to grow their business.\n</p>\n\n\n<p>As a Strategic Partner Manager, you will serve as expert consultants and One Google advisors to our partners. You will work cross-functionally to drive your partner&#39;s businesses and build effective relationships with C-level representatives to empower partners to thrive and grow in a digital future. Additionally, you will provide excellent partner service, research, and market analysis across Google’s entire search, display, video, and mobile solutions. In this role, you will rely on excellent analytical, problem-solving and relationship building skills to resolve technical and financial challenges with partners and better represent our users, products, and programs. You will also develop a comprehensive business strategy, demonstrating excellent business judgment.</p><p>Google’s Global Partnerships team powers extraordinary user experiences through meaningful partnerships. We build relationships that solve users’ needs, advance our partners’ goals, and further Google’s mission. Our team provides solutions for a range of partners — from helping publishers and developers grow their businesses through monetization solutions, to helping our long-term partners anticipate and navigate change in a way that delivers economic and reputational value. We build and distribute Google products through partnerships across a multitude of product areas, including Search, Assistant, Geo, News, Travel, and more. We collaborate across Google, ensuring a coordinated approach when engaging with our most complex and strategic partners.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/90351174248473286",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:56:47.867Z",
    "publish_date": "2019-02-27T19:56:47.867Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of work experience.</li>\n<li>Experience in online advertising (e.g., ad serving, programmatic), platforms, and trends (i.e., desktop, mobile, video).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in the online advertising industry or a related vertical (e.g., eCommerce, brick and mortar retail) with a focus on digital publishing.</li>\n<li>Experience working with third-party ad serving tools and yield optimization platforms (e.g., Ad Manager).</li>\n<li>Experience with buy and sell-side advertising technologies.</li>\n<li>Ability to understand growth metrics and apply these to potential optimizations.</li>\n<li>Excellent partner relations and account management skills.</li>\n<li>Excellent analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand the full scope of a publisher partner monetization business including inventory trends and channel priorities. Understand how monetization fits into larger business strategy.</li>\n<li>Analyze platform performance and present findings to clients, highlighting opportunities or introducing incremental channels. Contribute data-driven insights to support recommendations and ensure internal tracking pipelines are current.</li>\n<li>Deliver product execution, monitoring, optimizing, and troubleshooting. Leverage cross-functional support teams to ensure publishers have access to the product experts and resources they need.</li>\n<li>Develop renewal and product strategies and negotiate term sheets. Negotiate business terms on renewals and new agreements.</li>\n<li>Work with internal teams in multiple Google product areas on agreements and bring the best of Google to our partners. Lead and influence teams, presenting strategy and execution paths to executive management.</li>\n</ul>",
    "title": "Strategic Partner Manager, eCommerce"
}