{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Sunnyvale, CA, USA; New York, NY, USA; Seattle, WA, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZEtTTyOVG1OiwbrUAJy24fsBp12uVDOQ2L9b1BBzwISOgCPMA3TXGJfFBVPq3BJD0z3ZNqrPXNnhmK2Kpf_NKlCnzrMg57fmEwdBhGXeD97y-C7YfvZfgNaYIs%3D_V2&jobTitle=Technical+Solutions+Engineer%2C+Google+Cloud+Platform&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:48.051Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p><p>As a Technical Solutions Engineer, you will combine software development, networking, and systems administration expertise with an aptitude for technical advising, troubleshooting and analysis. You will swiftly solve technical issues for customers to show how our products can make businesses more productive, collaborative, and innovative. Your relationships with customers are crucial in the success of customers and Google Cloud. You will work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers.</p><p>You are the customer advocate. You will improve our products by working cross functionally with product management, deployment, and development teams to make customers successful. You are part of a global team that provides 24x7 support, you will be working in a backline support role and drive resolutions for problems and inquiries that customers report. By applying your in-depth technical experience, you will develop a deep understanding of Google’s services architecture while driving enhancements towards an overall better customer support experience. Specifically, you will provide solutions and resolve escalations for Google Cloud customers, as well as advising lower tier support teams.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5244263744077824",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:10:11.518Z",
    "publish_date": "2019-02-27T19:39:22.548Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field or equivalent practical experience.</li>\n<li>2 years of industry experience in technical support, professional services, software development, or product operations management.</li>\n<li>Experience with one or more of the following programming/scripting languages: Java, C, C++, .NET, Python, Shell, Perl, JavaScript.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience with any of cloud storage solutions, SQL database administration, Google App Engine, open source software communities, Cloud networking solutions, or distributed computing technology.</li><li>Understanding of basic web technologies (HTTP, HTML, DNS, TCP, etc.).</li><li>Network administration skills with understanding of Linux/Unix or Windows system administration (from kernel to shell and beyond, taking in system libraries, file systems and client-server protocols along the way).</li><li>Outstanding troubleshooting, attention to detail, and resourcefulness in a fast paced client facing work environment, while demonstrating strong communication skills (both verbal and written).</li></ul>",
    "responsibilities": "<ul>\n<li>Diagnose and resolve customer problems for Google Cloud Platform products; design and implement new operations, productivity and investigation tools to increase efficiency for Technical Solutions Engineering.</li>\n<li>Act as a consultant and subject matter expert for key stakeholders in the engineering, business, and customer organizations to resolve technical deployment obstacles and improve the product&#39;s vision.</li>\n<li>Obtain and maintain an in-depth understanding of Google&#39;s product technology and underlying hardware and software architectures; build in-product self-service solutions.</li>\n<li>Work closely with multiple product and engineering teams on understanding ways to improve the product and interact with our Site Reliability Engineering (SRE) teams to drive production excellence.</li>\n<li>Advocate for our customers by representing their issues to Product Management and Software Engineering and develop innovative ways to resolve issues.</li>\n</ul>",
    "title": "Technical Solutions Engineer, Google Cloud Platform"
}