{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbgySsUYaFMmJkTqs9bWtyLOTTBWAl70UZ1RgCMwN4MSOgASYQ8w9kMtAy6m1CRNIK7JMZbwxrctIG9-_OE5lvZQqaOtkOH5csxhQJvt5bmVe5JEPQlHVRX-cnU%3D_V2&jobTitle=Physical+UX+Design+Lead&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T19:02:07.694Z",
    "description": "<p>Design and user experience (UX) are at the forefront of everything we do. The job of an Interaction Designer is to envision how people experience our products and bring that vision to life in a way that feels inspired, refined and even magical. In an Interaction Designer role, you’ll take on complex tasks and transform them into intuitive, accessible and easy-to-use designs for billions of people around the world—from the first-time user to the sophisticated expert. Achieving this goal requires collaboration with teams of Designers, Researchers, Engineers and Product Managers throughout the design process—from creating user flows and wireframes to building user interface mockups and prototypes. At each stage, you will anticipate what our users need, advocate for them and ensure that the final product surprises and delights them.</p>\n\n\n<p>As Physical UX Design Lead at Home/Nest, you will be responsible for defining how people experience and use our products through physical interfaces. You will be able to articulate a coherent vision for a product’s physical interface, provide exhaustive specifications for its implementation, and lead intensive, cross-team collaboration to make that vision a tangible reality for our customers. You will be comfortable crafting a coherent product experience in an environment where requirements and constraints evolve and are defined over many design iterations. Additionally, you will ensure that customers’ interactions with our products promote brand-elevating experiences in every way.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/107752460002435782",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-11T19:02:07.694Z",
    "publish_date": "2019-03-11T19:02:07.694Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Design, Human-Computer Interaction, related field, or equivalent practical experience.</li>\n<li>4 years of experience as a designer in a related field, working on shippable products.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in tangible (physical) and screen-based interface design. Experience in hardware interaction logic design.</li>\n<li>Experience with hardware design/prototyping techniques and tools.</li>\n<li>Experience working with Industrial Design and Product Design teams.</li>\n<li>Experience partnering with UX Research to maximize research and design impact.</li>\n<li>Passion for quality and overall product excellence.</li>\n<li>Excellent visual design and verbal/written communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the conceptualization, design, and specification of physical user interfaces for products, in close collaboration with Industrial Design (ID), Product Design (PD), Human Factors, UX Research, and embedded software teams.</li>\n<li>Produce interactive prototypes of proposed physical interface concepts for testing. Conduct lab studies to test and validate proposed ID/PD product designs against usability and quality standards.</li>\n<li>Define, document, and maintain visual language standards and quality standards for physical products (e.g., color vocabulary, LED animations, iconography, etc.).</li>\n<li>Work with calibration experts to define ideal color targets for LEDs and ranges of acceptability for products in production. Provide comprehensive UX quality control in assessing prototypes and final production units against quality standards.</li>\n<li>lMentor fellow designers in the effective design, specification, and implementation of physical user interfaces.</li>\n</ul>",
    "title": "Physical UX Design Lead"
}