{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckff_ovDgdB9kPan8CBrfA1Ob-7J0mJq1hcWJA6zBip0SOgCPMA3TNcK4h0nlkeOhQ2t4C2ML6rkYo9hZvec_HLDQ0zP4x8FpMWOymuzyPiEyPJw_nptK09JCkZk%3D_V2&jobTitle=Data+Center+Environmental+Health+and+Safety+Specialist&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-04T21:01:53.797Z",
    "description": "<p>Google Data Center teams design and operate some of the most sophisticated electrical and HVAC systems in the world. As an Environment, Health and Safety Specialist, you oversee compliance by Google employees and contractors with EHS procedures. Your goal is to ensure environmental protection, pollution prevention, health, and safety for all Googlers and Google facilities. Your proactive approach means you are consistently working to improve data center environmental, health, and safety (EHS) performance. You meet and manage all EHS legal requirements while monitoring and supporting all facilities activity at Google&#39;s data centers, and always operate according to best-in-class environmental practices. In emergency situations or abnormal conditions, you respond to data center EHS issues and incidents to minimize the impact.</p>\n<p>Google Data Centers (GDC) make up one of the largest and most powerful computing infrastructures on the planet. Our team has built an EHS program to scale compliance and safety excellence construction, commissioning, deployment and operations of data centers. You&#39;ll be responsible for supporting new site construction EHS compliance through operational EHS leadership. You will play a critical role in ensuring all EHS issues are identified and addressed by working collaboratively with a cross-functional team of GDC departments and contractors to protect Google’s interests.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5319771935932416",
    "location": {
        "address_lines": [
            "Henderson, NV, USA"
        ],
        "city": "Henderson",
        "country": "NV",
        "country_code": "US",
        "display": "Henderson, NV, USA",
        "lat": 36.0395247,
        "lon": -114.9817213
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Henderson%2C+NV%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Henderson%2C+NV%2C+USA&size=1168x324&zoom=12&signature=dXyrN3M5HDjCTYSHQlz7QBA6wSk=",
        "large_2x": "/maps/api/staticmap?center=Henderson%2C+NV%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Henderson%2C+NV%2C+USA&scale=2&size=1024x324&zoom=12&signature=K99pG0XVIRb-bAfjLozwbACo8Pg=",
        "small_1x": "/maps/api/staticmap?center=Henderson%2C+NV%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Henderson%2C+NV%2C+USA&size=600x400&zoom=12&signature=qMmGu2CVwfq23qzp9Hy6iXWg1AQ=",
        "small_2x": "/maps/api/staticmap?center=Henderson%2C+NV%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Henderson%2C+NV%2C+USA&scale=2&size=600x400&zoom=12&signature=YpaEnOOIRORaqh1jrh8AR-pRE9E="
    },
    "modified": "2019-02-27T19:48:06.142Z",
    "publish_date": "2019-02-27T19:48:06.142Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>5 years of experience working within Environmental Health and Safety programs - including construction and general industry.</li>\n<li>Experience working with cross-functional teams, and external contractors/vendors.</li>\n<li>Experience with Electrical Safety and Behavior. </li><li>Collaboration, project management and communication experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>BS degree in Environmental Science, Occupational Health and Safety, Earth Science or a related discipline, or equivalent work experience.</li>\n<li>Professional Environmental Health and Safety Certifications (CHST, CSP, CHMM, REM)</li>\n<li>Experience communicating with Federal, State and Local Authorities regarding EHS challenges.</li>\n<li>Knowledge of Nevada-specific environmental, health and safety regulations.</li>\n<li>Air permitting compliance</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Support Data Center Sustainability, Program Management Groups, Hardware Operations and Data Center Operations by leading EHS program implementation and oversight from construction through operations.</li>\n<li>Lead projects associated with industrial and construction EHS compliance programs, regarding electrical safety.</li>\n<li>Manage projects associated with all aspects of environmental and regulatory compliance, with an emphasis on air emissions management.</li>\n<li>Manage oversight of construction activities to protect Google’s interests during ownership of site activities.</li>\n<li>Provide EHS support for existing fleet as needed, as well as support within the region and at a global level for all EHS programs and initiatives.</li>\n</ul>",
    "title": "Data Center Environmental Health and Safety Specialist"
}