{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; San Bruno, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckW-WvA0NsXnfssv52O7uc6W6rdPAqUDcCzityQRVS74SOgASYQ8wGscxOMIZo8xuwmaKAY1JiNu5i7Slf-7cgQzHOpb4X-nXt3QGsI60KwE1l88i6fteddVOo-Q%3D_V2&jobTitle=Product+Partnerships+Manager%2C+Creator+Product%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-05T16:31:42.595Z",
    "description": "<p>YouTube’s Product Partnerships team accelerates the global growth and innovation of YouTube products by driving new business opportunities through partnerships. We own the business side of new features, products and initiatives that are vital to the success of YouTube. As a team member, you understand the landscape of partnerships opportunities across technology licensing/integrations, marketing, and distribution. You will also craft strategies, define and structure critical partnerships, negotiate agreements, and cultivate our relationships.</p><p>Creators are the heart and soul of YouTube. As a Product Partnerships Manager, you’ll help drive the success and happiness of Creators on YouTube through important initiatives such as unlocking new non-ad growth streams, driving adoption of new technologies (e.g., VR creation tools), and enabling vertical-specific experiences (e.g., YouTube Learning). You’ll work closely with the Product and Engineering teams to identify partnership opportunities to support our creator-related goals and influence Product roadmaps. In addition to setting a partnership strategy and executing on it, you’ll serve as a strategic resource on areas you cover and help coordinate go-to-market efforts to ensure the success of partner-related launches. You will provide excellent partnership management skills and a strategic approach to how we partner, working well in a fast-paced, ever-evolving, and collaborative environment.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/125928534234276550",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T23:02:02.484Z",
    "publish_date": "2019-03-06T23:02:02.484Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of relevant work experience.</li>\n<li>4 years of experience in business development experience, identifying partners and structuring and negotiating agreements or in partner management.</li>\n<li>3 years of experience working with Product, Engineering, and Legal teams in a technology environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or equivalent work experience (e.g., management consulting).</li>\n<li>Experience interpreting legal documents, negotiating agreements, and working with legal team members to draft and execute agreements.</li>\n<li>Experience working with or thinking about the needs of content creators.</li>\n<li>Experience working cross-functionally with multiple teams and levels of management.</li>\n<li>Ability to quickly learn new technologies and demonstrated passion for and understanding of YouTube products.</li>\n<li>Ability to convey complex technical and financial business details in clarity. Excellent problem-solving skills, business judgment, and attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Become a domain expert and thought leader in your area.</li>\n<li>Identify new partnership opportunities.</li>\n<li>Manage objectives and deliverables for driving partnerships and evaluating growth.</li>\n<li>Lead cross-functionally to secure buy-in for the program and partnerships, including problem-solving legal, policy, business, operational, and technical complexities. Ensure budget and collaborate with other Google teams that work in this space.</li>\n<li>Develop and maintain strategic partnerships with external partners, including negotiating agreements and partner management.</li>\n</ul>",
    "title": "Product Partnerships Manager, Creator Product, YouTube"
}