{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke2BS2t7fBEc0KUCcvIzen8e50MHPzS8WqUWXrMcBqoSOgCPMA3Tyd8M7_5Cvf8l5rRLf22DIu0Vfl4lMBLRDG_GjB-ZapU1SKICqMTKe2I1QpftKghMruar2GM%3D_V2&jobTitle=Technical+Program+Manager%2C+Real+Estate+Systems&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-06T16:32:43.748Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Real Estate Systems Program Manager, you will drive Alphabet’s Real Estate investment strategy by working with our business partners to strategize, define and refine processes and build state of the art tools to manage the acquisition, transformation, use and disposition of real estate.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5288445454647296",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:46:40.871Z",
    "publish_date": "2019-02-27T19:46:40.871Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience as a Program Manager. Engineering Program Management experience.</li>\n<li>Experience participating in full-system implementation lifecycles (analyze, design, build, test, implement and support).</li>\n<li>Experience leading projects executed by vendors.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience supporting third-party tools used in the facilities space.</li>\n<li>Understanding of architectural-level technical concepts.</li>\n<li>Ability to see granular as well as big-picture issues.</li>\n<li>Ability to communicate to all levels of users, internal and external.</li>\n<li>Adaptable, proactive and willing to take ownership.</li>\n<li>Leadership and strategic problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Gain an in-depth understanding of Google’s Real Estate Workplaces Services (REWS) business processes and technical solution delivery process including data, systems and applications.</li>\n<li>Oversee the health of business critical applications within REWS.</li>\n<li>Manage design and delivery of technology solutions in support of new business processes and process improvements.</li>\n<li>Manage third-party service providers to drive timely execution of these initiatives including governance, budgets and milestones to ensure on-budget delivery.</li>\n<li>Collaborate with cross-functional teams to build project plans, manage risks and resolve issues across a dynamic, fast-paced, highly matrixed organization.</li>\n</ul>",
    "title": "Technical Program Manager, Real Estate Systems"
}