{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXv75C9PyiK48rwoEucXY-TnxagB9fQ_ZeSqil3M2KASOgCPMA3THSbcepcmn9O5MVsthFB-OcXc922GU50eAjhkOUV90fligTYOfwwMuA4D64MlHjbCkFzWvd4%3D_V2&jobTitle=Global+Digital+Demand+Generation+and+Growth+Marketing+Lead%2C+Online+Google+Store&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:31:56.409Z",
    "description": "<p>The Hardware and Retail Marketing organization is responsible for driving the growth of Google&#39;s hardware brands, including but not limited to Google Pixel, Google Home, Pixelbook, wearables and accessories. We partner with product teams to understand the user, shape the product roadmap, and bring products to market through coordinated global media campaigns. Google is committed to building radically effective experiences for customers at the intersection of hardware, software and artificial intelligence, and we’re growing the team.</p>\n\n<p>As the Global Digital Demand Generation and Growth Marketing Lead, you will be a strategic leader on the marketing team and will be responsible for leading all of our global digital programs aimed at bringing users to the site, driving conversions, and meeting our objectives. \n</p>\n\n<p>You will manage and mentor a team of experts in SEO, paid media, social and others. You will develop global strategies for growing our user base and business and will develop, plan, execute and measure integrated marketing campaigns that generate highly converted traffic. You have a passion for building, implementing and measuring new systems, processes and campaigns as well as provide quantitative and qualitative feedback on performance.\n</p>\n\n<p>To be successful in this role, you need to be a strategic thinker, a nuanced problem solver, an exceptional marketer with rich experience in executing global campaigns and driving business growth in an e-commerce channel. \n</p>\n\n<p>This is a critical and high-visibility role with the opportunity to make a direct impact on the future of a rapidly growing product and channel at Google.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5058444182880256",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:56:53.844Z",
    "publish_date": "2019-02-27T19:45:36.529Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>12 years of digital marketing experience in B2C e-commerce, consulting, consumer electronics, or a related field working with cross-functional teams.</li>\n<li>5 years of people leadership experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in related field.</li>\n<li>Experience in owning and defining the digital experience for complex consumer electronics product categories with multiple senior executive stakeholders; strong cross-functional relationship management skills.</li>\n<li>Proven team leader with track record of managing, mentoring and nurturing high performing teams. Personable yet persistent when working across global cultures and influencing senior managers.</li>\n<li>Proven success with delivering business growth and traffic goals by building and leading digital marketing programs across the digital spectrum from search advertising, to social, retargeting, syndication, etc.</li>\n<li>Executive-level written and visual presentation skills. Excellent oral communication skills with peers, management, and cross-functional teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be accountable for delivering the growth aspirations of the google store. Define, plan and execute global integrated demand generation programs for SEO, SEM, social media, paid media, partnerships, content syndication, marketing automation and more.</li>\n<li>Develop, implement, analyze and constantly refine our customer acquisition program strategy.</li>\n<li>Partner with other product marketing teams, Creative, UX, and Demand Generation teams to drive visual strategy, user experience, and external marketing efforts for the Google Store.</li>\n<li>Be an advocate for, and mentor, motivate and develop the Demand Generation Team who will own various media channels across paid media, social, SEO, partnerships, and others.</li>\n<li>Partner with Sales and Business Development teams to identify business goals, and develop and execute strategies for high profile Google Store initiatives.</li>\n</ul>",
    "title": "Global Digital Demand Generation and Growth Marketing Lead, Online Google Store"
}