{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRL9KUQfMmov0Z4LYhORzlHeHaLlxK8otljH3dOJszISOgASYQ8w35eTjBfdYXTSUGStSLoR-DQUjvDukZeWtrhEvg3-TDTDdTF17srkWxE7BKC0Or1B2oFuowg%3D_V2&jobTitle=Business+Services+Manager&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-28T20:02:54.988Z",
    "description": "<p>Strategy &amp; Operations (S&amp;O) professionals in Google’s Marketing organization provide business critical insights and analytics, ensure cross-functional alignment of goals and execution, and help teams drive strategic partnerships and new initiatives forward. Whether you are embedded within a specific marketing team to use insights to enable better marketing decisions or the global S&amp;O function to equip the organization to succeed at scale, you will engage with Google leadership in order to establish Marketing’s strategic direction. You will manage planning and operational processes and work cross-functionally with key partners across Marketing, Product, Finance and Engineering to solve our toughest challenges, advocate for high-priority projects, and drive greater operational rigor within Marketing.<br><br>To be successful in this role, you have a hypothesis-driven approach to problem solving, effective quantitative and communication skills, and the ability to take on broad-reaching and ambiguous questions while working collaboratively and cross-functionally with Googlers of all levels.<br></p>\n\n\n<p>As a Business Services Manager, you&#39;ll work on the Marketing Strategy and Operations team. You&#39;ll work to build a service function to address needs along the buying process for Google Cloud&#39;s Marketing teams. You&#39;ll focus on customer experience and efficiency gains through the implemented support services.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/112822542999134918",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-28T20:02:54.988Z",
    "publish_date": "2019-02-28T20:02:54.988Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Marketing or related field or equivalent practical experience.</li><li>5 years of experience in project management, procurement or finance in a B2B company or agency.</li></ul><br><p>Preferred qualifications:</p><ul><li>Master&#39;s degree in Business or Marketing.</li><li>Experience in financial planning and analytics.</li><li>Ability to influence and communicate cross-functionally across all levels of management.</li><li>Ability to balance the needs of prospects and customers with program objectives.</li><li>Demonstrated project management, global/regional stakeholder management and vendor management skills.</li><li>Excellent communication skills, with the ability to manage multiple projects simultaneously.</li></ul>",
    "responsibilities": "<ul><li>Develop, improve and streamline processes that cover financial planning, budgeting, legal and invoicing of all marketing programs.</li><li>Build and manage relationships with stakeholders and teams in finance, legal, vendor strategy and operations, and execute services through a global team of contractors.</li></ul>",
    "title": "Business Services Manager"
}