{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdDwq4jZxXwhylxZnVOoAC5WDiweFSsltpJlcXA__YoSOgCPMA3T3GbLYRTONApqx9szECT1UmEAtnwgV47ZOb-yfcKeAvGokixNy2_CYna1fSU5WOFc-TA7cIU%3D_V2&jobTitle=Project+and+Process+Manager%2C+Supplier+Operations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-07T00:31:35.563Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>Our team&#39;s mission is to design and implement global, scalable and compliant payments operations. In this role, you&#39;ll use your creative problem solving skills and focus on creating great Googler experiences while proactively mitigating risk by finding innovative, automated solutions to improve and standardize complex sets of processes and systems. You&#39;ll work to ensure high-quality operations by setting the vision and partnering with key stakeholders in Engineering, Product, Finance, and Legal and collaborating externally with outsourcing partners and banks.\n</p>\n\n<p>You&#39;ll face unique opportunities in scaling our varied businesses effectively while enabling our Product and Services teams to grow. As a Project and Process Manager, you&#39;ll be responsible for ensuring Google’s supplier information and processes are compliant with tax and legal requirements by designing processes that work globally while accommodating local needs. You will take on new leadership opportunities every day and have the autonomy to identify and execute long-term projects.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6406866901336064",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:53:57.988Z",
    "publish_date": "2019-02-27T19:53:57.988Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of experience with accounting/finance ERP systems and business processes.</li>\n<li>Experience with an outsourced service provider in operations, procure-to-pay, or other relevant area.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>PMP and/or Six Sigma certification or experience.</li>\n<li>Experience working on process/operational optimization and with internal controls and operations.</li>\n<li>Payments experience.</li>\n<li>Ability to work collaboratively, be diplomatic and influence stakeholders.</li>\n<li>Ability to work in a cross-functional, fast-paced, ambiguous and unstructured environment and lead complex operations initiatives. Ability to autonomously drive and prioritize multiple initiatives.</li>\n<li>Demonstrated project management, problem-solving, change management and analytical skills. Attention to detail, organized, and thorough with a desire for continuous improvements.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify, implement, and measure process improvements that enhance and optimize the control environment, consolidate processes, and scale with growth.</li>\n<li>Partner with Business and Finance teams to identify and gather tax and legal requirements, design solutions, review UAT plans, drive testing requirements, and drive change management and training activities.</li>\n<li>Analyze datasets to identify, prioritize, and address risks and opportunities.</li>\n<li>Drive compliance with Tax, Accounting, and Statutory teams for payment operations, and ensure risk assessment and control frameworks are in place and running effectively and efficiently.</li>\n<li>Drive standardization and continuous improvement.</li>\n</ul>",
    "title": "Project and Process Manager, Supplier Operations"
}