{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQkhTL5kETC5doGNgZUBP8sUC7iB9fe-E-nil6ar5DgSOgASYQ8wuLOBQAF9KApqH92p4QHjhXQSEy3WkABZu1GrQ3reRAW_BMfhqbWR3XXIm2STXIhM4rhE91A%3D_V2&jobTitle=Motion+Designer&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T22:31:45.810Z",
    "description": "<p>Whether you’re guiding a user through a shift in context or expressing the personality of your brand, motion and animation are key ingredients to refine a user&#39;s experience on every screen— from mobile phones and tablets to desktops and beyond. At Google, we use motion design to help tell a product’s story, guide our users, improve usability and make the user’s experience responsive and fun. As a Motion Designer, it’s your job to apply your passion for animation to simplify complex interactions and solve challenging design problems.<br><br>In this role, you’ll help define and implement Google’s motion design language across all platforms—this includes driving the creation of best practices, collaborating with visual and interaction designers, and working with other product teams. You’ll think critically about how motion reinforces Google’s UX objectives, enhances interactivity, and delights our users.</p>\n\n\n<p>Our UX principle at google is to delight the eye without distracting the mind. A positive first impression makes users comfortable, assures them that the product is reliable and professional and encourages people to make the product their own. A minimalist aesthetic makes sense for most Google products because a clutter-free design loads quickly and doesn’t distract users from their goals. A Google product’s motion design should aid its narrative, guide its users, improve usability, and make the experience responsive and fun. \n</p>\n\n\n<p>As a Motion Designer, you are a detail oriented and understand how form influences function, can weave motion into interaction design and simplify complexity.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/88730653157139142",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:49:20.553Z",
    "publish_date": "2019-02-27T19:49:20.553Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Design, Human-Computer Interaction, Computer Science, related field, or equivalent practical experience.</li><li>Portfolio of work demonstrating command of motion and interaction in web and/or mobile contexts.</li><li>Experience in User Experience (UX).</li></ul><br><p>Preferred qualifications:</p><ul><li>3 years of relevant industry experience.</li><li>Experience using motion to reduce perceived latency.</li><li>Understanding of basic principles of animation.</li><li>Ability to use motion to a narrative effect and understanding the future of interactive motion.</li><li>Ability to fuse creativity and code to deliver cutting edge interactions.</li><li>Ability to focus on detailed aspects of motion and experience, often related to physics, patterns, and visual design elements. Ability to use motion to express sentimental or emotional experience.</li></ul>",
    "responsibilities": "<ul>\n<li>Define and implement the motion design language for Google products.</li>\n<li>Provide patterns, best practices and guidance on animation and transitions for different devices and platforms including web, Android, and iOS.</li>\n<li>Collaborate with fellow UX designers as they incorporate motion into their work to enhance interactivity and delight users.</li>\n</ul>",
    "title": "Motion Designer"
}