{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaCiRAYqovUKgVyR8U9GIHojJmvWAcIAY8Sv3iAx8D8SOgASYQ8w2muxeAfL77nEqvgnYqyDyKB_5q1LdAKk_2JH2vPp-N8bkCShmhZOIqLmyOQv_L_sr661FOo%3D_V2&jobTitle=Global+Process+Owner%2C+Mergers+and+Acquisitions&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T14:01:45.633Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>The Supplier and Procurement Support Operations team strives to have the best internal purchasing tools, systems and processes available anywhere.\n</p>\n\n<p>You will be responsible for managing Google’s operations and special projects for Mergers and Acquisitions, Divestitures/Spin Offs, New Entities and Alphabet Companies on our Procurement, Payments, and Travel and Expense systems. \n</p>\n\n<p>In this centralized role, you represent Source to Pay (S2P) on cross-functional Finance teams to plan and execute successful integrations/separations. You will partner closely with the Global Process Owners across the Procurement, Payment Solutions and other teams to drive more controlled, efficient and cost effective operations that can flex with the addition or subtraction of entities. \n</p>\n\n<p>You leverage your process knowledge and project management skills to define scope, identify and manage dependencies/risk and execute projects.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/79229612254470854",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-12T14:01:45.633Z",
    "publish_date": "2019-03-12T14:01:45.633Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Source to Pay (S2P) operations experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Leadership skills, ability to take ownership of projects, set objectives, drive to results and influence without authority.</li>\n<li>Ability to understand and communicate big picture objectives while being detail oriented and thorough on assignments.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Own M&amp;A integrations including managing outsourced vendors and processes, ensuring that integration targets are met and identifying opportunities for improvement</li>\n<li>Represent Source to Pay (S2P) on cross-functional Finance teams to plan and execute successful launch of new Bets</li>\n<li>Work with business groups, cross-functional Finance, and Engineering teams to design a standardized AP Sub-ledger set up process across to support M&amp;A activities and new integration strategies in a timely manner.</li>\n</ul>",
    "title": "Global Process Owner, Mergers and Acquisitions"
}