{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckac-s3LGNqysbWGr-HJo-yRu8t-V6dPFFQH3KKmbH40SOgASYQ8wNb7tUAmXHWKSpAZ1aNcY7DpjOtkVUIjt6U_4VoW6rrfZuqeLTkN1eJ4OEufmlBoXLXnv2i4%3D_V2&jobTitle=Program+Manager%2C+Partnerships%2C+Partner+Credentials%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T20:01:54.313Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>The Cloud Partnerships team is focused on accelerating the adoption of Google Cloud by attracting and growing partners who can bring in new customers and make them successful. Our goal is to reward and recognize our partners’ successes as they harness the collective strengths of our organizations to deliver an exceptional experience for our customers.\n</p>\n\n\n<p>As the Partner Credentials Program Manager, you will ensure the success of Google Cloud partners selling, building, and delivering Google Cloud services and solutions through targeted initiatives, training, and programs. You will consistently seek ways to scale enablement to reach as many resources as possible, while developing and executing targeted programs for strategic resources. In this role, you will work with functional teams globally including Training, Marketing, Professional Services, Customer Engineering, and Sales. Additionally, you will rely on you experience with training strategies and skilling partners to build effective working relationships.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/137056587802911430",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:34.350Z",
    "publish_date": "2019-02-27T19:50:34.350Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in program management, data analysis/process documentation, mapping, and improvement within a cloud environment.</li>\n<li>5 years of experience in enablement for internal or partner audiences.</li>\n<li>Experience with partner ecosystems, agile partners, resellers, mid-tier integrators, and global system integrators.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience collaborating with Cloud partners</li>\n<li>Experience driving and tracking adoption of technical training and certification in a partner community</li>\n<li>Experience designing learning systems operations and workflows to drive engagement and completion of certifications and credentials.</li>\n<li>Experience working with a global audience and cross-functional stakeholders.</li>\n<li>Track record of successfully leading innovative, creative, and engaging change or adoption programs.</li>\n<li>Excellent communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand the global partner audience and design credentials and certifications processes and operations programs supporting the certification adoption goals. Drive awareness and understanding of the Google Cloud certification and credentialing processes among partners and internal stakeholders.</li>\n<li>Define and manage the partner credentials and certification data and reporting requirements. Maintain ongoing cadence of updates to partners, internal stakeholders, and the leadership team.</li>\n<li>Design and execute certification data and process initiatives to meet partnership goals and support skills development in the ecosystem.</li>\n<li>Drive reporting to internal and external stakeholders on key certification metrics while developing and applying insights to continually improve the business.</li>\n<li>Partner with the cross-functional team on annual program evaluations by supporting the data plan for the credentialing requirements portion.</li>\n</ul>",
    "title": "Program Manager, Partnerships, Partner Credentials, Google Cloud"
}