{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcVtIi3Hck2DA7gSt3OHdLm1U5FZvn-9JFEQH10-oUQSOgCPMA3T6Q0pkS9YDlcqSqOJIUXrzkz4H42Gr_cf8u77uAReHujk-9qgDZu0diViBxCoHWjBc49wF4M%3D_V2&jobTitle=Strategy+and+Business+Operations+Program+Manager&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:02:24.410Z",
    "description": "<p>At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent the voice of Google&#39;s users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. <br><br>gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. <br><br>We are committed to building an ever more diverse, equitable, and inclusive gUP, and consider this the foundation upon which individual, team, and user success are built. We&#39;re also committed to innovation not only in the content of our work, but in the way we work. Check out <a href=\"https://rework.withgoogle.com/blog/googles-algorithm-powered-internal-job-marketplace/\">this blog post </a>on our Chameleon program.</p>\n\n\n<p>As a Strategy and Business Operations Program Manager, you&#39;ll lead the strategy development for a team that provides customer care and technical support for a variety of Google products. In this role, you will have an opportunity to shape how we influence Product teams to launch products, implement efficiencies across a global Operations team, develop scalable processes, onboard new partners, resolve key user challenges and impact how we provide technical services to our partners.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6164198809862144",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:43:01.420Z",
    "publish_date": "2019-02-27T19:43:01.420Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a related field or equivalent practical experience.</li>\n<li>6 years of experience in management consulting.</li>\n<li>Experience in management consulting, organizational design, corporate strategy, or project management experience in a technology/media company.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree or similar graduate degree in management.</li>\n<li>Experience in implementing strategic and large-scale initiatives/projects in a change-oriented, fast-paced environment.</li>\n<li>Experience in structuring strategic analysis and messaging using spreadsheet software and presentation software.</li>\n<li>Knowledge of best-practices in business operations, service operations, customer support operations and/or internet/online media.</li>\n<li>Ability to work with different team members to design processes and implement strategic projects that solve business challenges.</li>\n<li>Excellent problem-solving skills with experience executing complex strategic and operational initiatives.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and structure key strategic projects/initiatives to solve complex business challenges by working with business stakeholders across the organization, managing communications, overseeing milestones and timelines and leading cross-functional groups to synthesize feedback and deliver on objectives.</li>\n<li>Work closely with leads to deliver strategic insights, provide solutions to challenges and recommendations based on business analyses.</li>\n<li>Define, launch and drive strategic and analytical initiatives to improve internal and external facing processes and operations, working closely with cross-functional teams, executive stakeholders and leadership.</li>\n<li>Collaborate with cross-functional stakeholders in annual business planning, headcount management, key organizational metrics and other operationally strategic projects.</li>\n<li>Identify gaps and propose changes to existing policy, systems and process frameworks. Develop scalable solutions and work to manage risks across the organization and develop best practices.</li>\n</ul>",
    "title": "Strategy and Business Operations Program Manager"
}