{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRGIVKuKdah4MwQuM5Y0BQi7mU4_RZwbCCivCP18nkYSOgASYQ8wImv2fxD5mUt5KXgbbXdBICBMtVpkEKDinNQK6Mri-zD_-y2Z5eMgw0jZaGYQn7MyvWf9RTs%3D_V2&jobTitle=Customer+Engineering+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T18:31:41.535Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global data center and software products. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of how technology is used in the workplace.</p>\n\n\n<p>As a Google Cloud Customer Engineering Manager, you will lead a team of pre-sales Engineers, who engage with prospects, understand and assess customer requirements, prepare and present demonstrations of Google’s Cloud products and services, guide the customer through implementation and production deployment, and address and overcome technical objections that arise throughout the sales process.\n</p>\n\n\n<p>With excellent technical and organizational skills, you have the ability to manage a diverse collection of engineering professionals. Additionally, you are a strong motivator and a confident presenter with excellent oral and written communication skills. You will maintain your technical expertise to engage directly with prospects and work cross-functionally with our Product, Support, Engineering, and Sales teams.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/109824080971997894",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-02-27T19:42:51.187Z",
    "publish_date": "2019-02-27T19:42:51.187Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or a related technical field or equivalent practical experience.</li>\n<li>10 years of experience serving in the capacity of a pre-sales engineer at an enterprise technology company, or equivalent experience in a similar customer facing role, e.g., within a professional services, solutions architect, or systems engineering team.</li>\n<li>Ability to travel up to 50% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Computer Science or equivalent practical experience.</li>\n<li>3 years of experience serving in the capacity of a Pre-Sales Engineering Manager, successfully leading the team to achieve sales goals throughout the performance period.</li>\n<li>Experience in data and information management, managing databases and identifying big data trends and issues within businesses.</li>\n<li>Experience with architecting and developing software for scalable, distributed systems. Strong grasp of enterprise networking and identity management systems; hands-on experience with Linux.</li>\n<li>Broad awareness of Big Data, PaaS, and IaaS industry and technical concepts with working knowledge of web application development platforms and related technologies.</li>\n<li>Ability to craft a compelling message and tailor it for a given audience and to mix deep technical expertise with simple, everyday language to deliver a memorable and useful story.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with Sales management to determine proper staffing levels to support annual goals, establish job requisitions, assemble candidate pool and lead interview team to fill open positions.</li>\n<li>Organize, train and equip the Customer Engineering (CE) Team. Assess CE team go-to-market readiness, identify gaps in CE preparedness and build plans to ensure the CE team is properly trained and equipped to successfully perform in support of annual goals.</li>\n<li>Work with Cloud Sales team and leadership to identify, qualify, and prioritize coverage for business opportunities. Participate in periodic opportunity review meetings to provide insight into how to best secure the technical win.</li>\n<li>Maintain customer satisfaction through working with the Sales Account, Customer Support, Product Management, Customer Solutions, and Engineering to resolve product problems affecting pre- and post-sales customer satisfaction.</li>\n<li>Travel up to 50% to visit customers throughout the Region.</li>\n</ul>",
    "title": "Customer Engineering Manager, Google Cloud"
}