{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckckXOzWm2_STvDnBhQROzHDiF_NOc3SxVzwRmzL6ikkSOgASYQ8wrOWo6rcJa34DCMsbZ_RB0oULI5io6-nKiDkvPjhclhZgI5uFFoGJPNtG1GdvCE_IkSXs46s%3D_V2&jobTitle=Program+Manager%2C+Revenue+Platforms&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T23:31:47.976Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>The Revenue Program Management team (RPM) leads cross-functional program management for the billing and payments platform design and improvement projects. This team acts as the key point-of-contact on behalf of all of Finance to triage all the concerns and root challenges, gather requirements, act as the key liaison with the Payments/Products Management and Engineer teams, and work with the cross-finance teams to execute on the projects/programs, including coordination of testing and post-launch operations. Our projects span across Google multiple teams and fall into Tax, Regulatory, Complex Product Launches, Platforms Infrastructure and Migrations and Special projects categories.\n</p>\n\n<p>As a Program Manager, you will apply exceptional leadership, program management, organizational, and communication skills as you engage key stakeholders across Google to prioritize and rationalize platform requirements from Finance, define programs with Product and Engineering teams to deliver new platform capabilities, and ensure smooth and successful launches to support our global accounting and operations teams. High quality launches, collaborative project teams, and happy stakeholders define success for this role.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4821019080556544",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:39:32.454Z",
    "publish_date": "2019-02-27T19:48:34.423Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>Experience in implementation of business growth and payments related systems and product launch requirements.</li>\n<li>Experience in systems, operations, internal controls, requirements documentation, testing, validation and program management.</li>\n<li>Experience working in cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>3 years of experience in Finance systems implementations and Program Management or related field.</li>\n<li>Ability to take initiative, adapt quickly to changing priorities and manage complex large-scale programs with multiple work-streams.</li>\n<li>Ability to autonomously drive and prioritize multiple initiatives alongside Product and Engineering teams.</li>\n<li>Ability to manage complex escalations in a timely and efficient manner, effectively balancing business and technical risks.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead stakeholders in the creation, prioritization and rationalization of platform requirements and work across teams to ensure appropriate resourcing and engagement.</li>\n<li>Create scope, schedule and budget plans and manage the team project execution, identifying project stakeholders and managing their expectations.</li>\n<li>Partner with cross-functional project leads and managers to coordinate planning and oversee dependencies, manage project issues/risks, facilitate escalations when needed, publish regular project status and manage project communications (e.g., newsletters).</li>\n<li>Run project meetings and represent the project team in broader cross-functional management meetings when needed, while holding team members accountable to deadlines and ensuring high quality deliverables.</li>\n<li>Ensure launch readiness, coordinate post-launch monitoring, be the go-to payments product and platform expert for the project management team and contribute actively to improving project management practices.</li>\n</ul>",
    "title": "Program Manager, Revenue Platforms"
}