{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTNCMc4JxcKBTg0qVyJJSF9V86yRSFPfcDkcdQsvG6sSOgASYQ8wlp7ePmVkvvbiTPun-KUZhfnBlf1Emvm7wIKE3Hp0iH_zJValBQJpsNAz_OSG3jRc4FK6ZuY%3D_V2&jobTitle=Sustainability+Operations+Lead%2C+Real+Estate+and+Workplace+Services&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-25T11:31:37.204Z",
    "description": "<p>The REWS Sustainability team is responsible for developing sustainability strategy and supporting frameworks for our global Real Estate and Development teams. We engage across teams to facilitate and deliver on our Google Sustainability commitments. Sustainability is embedded in every part of the built environment at Google. \n</p>\n\n<p>As the Operations Lead you&#39;ll focus on the REWS Sustainability Programs to develop regionally appropriate guidance and deliver outcomes related to Healthy Workplaces, Climate Resilience and Circularity. You will be responsible for developing the strategic roadmap and tools/resources to enable internal and external stakeholders to execute toward REWS Sustainability goals and collect data to measure success. You will work closely with internal partners to achieve industry leading sustainable facilities operation and engage with additional internal global programs teams to integrate sustainability across Transportation, Food, Events and Health and Performance.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5115000738840576",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:48:38.917Z",
    "publish_date": "2019-02-27T19:48:38.917Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience working in facilities management.</li>\n<li>5 years experience working with global program management, including internal and external stakeholder management, overseeing budgets, schedules and deliverables.</li><li>3 years of people management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in the integration of sustainability programs across large, global real estate portfolios.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with the REWS Sustainability Team Lead and other team leaders to develop strategies to achieve outcomes related to annual Google Sustainability goals. Oversee and manage internal Facilities, Real Estate and Global Programs collaborations and partnerships related to sustainability programs.</li>\n<li>Lead development of metrics and data collection process that validate success of outcomes related to annual Google Sustainability goals.</li>\n<li>Build and maintain relationships as a trusted partner of internal Facility Operations stakeholders.</li>\n<li>Develop quarterly and annual program work plans to ensure that all external consultants and internal stakeholders are coordinated. This includes key milestones and defining critical path objectives. Develop annual program budget and maintain program spend within approved limits.</li>\n<li>Maintain contracts related to this work, including but not limited to: 1) Collaborative engagements with industry experts and institutions. 2)Consultant and vendor scopes required to deliver tools and services to Google</li>\n</ul>",
    "title": "Sustainability Operations Lead, Real Estate and Workplace Services"
}