{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUtey_1WYdbArAXTynIuyIi2nizt4QXMdTj72XZNlLISOgASYQ8w07Qk-ZhhCyuOBXuPpBunvgFPaI7nlgWdrpda1Rnd0ZfRyeDAJ7l5DJmvL0JifWsrGHLKZOE%3D_V2&jobTitle=Product+Marketing+Manager%2C+Android+TV&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T16:31:37.265Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>As a Product Marketing Manager, you will join a small Android TV marketing team to shape the future of television. From developing product positioning to driving consumer research to evolving brand architecture, you will manage the Android TV platform narrative. In this role, you will bring these narratives to life via Google’s own marketing initiatives and partners’ campaigns. Within Google, you will also work closely with Product, Brand, and Retail Marketing teams and collaboratively as part of a cross-functional team with Go-To-Market and Business Development, Engineering/Product/UX, Corporate Communications, Legal and others.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/97000481689084614",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:55:41.902Z",
    "publish_date": "2019-02-27T19:55:41.902Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in B2C or B2B product, partner, or brand marketing within a technology space.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in product marketing, marketing research, brand architecture, and launch communications.</li>\n<li>Experience working with internal and external partners and driving impact both through joint agreements and effective relationships.</li>\n<li>Experience writing consumer-facing copy in the Googley voice. Track record of successfully developing marketing plans through actionable insights and recommendations.</li>\n<li>Track record of excellent performance and high productivity. Ability to prioritize for business impact among competing needs.</li>\n<li>Ability to influence across all levels and work effectively across functions, geographies, and corporate cultures.</li>\n<li>Excellent written and verbal communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead messaging, identity, positioning/value proposition, naming, brand architecture, and communication of Android TV. Partner with cross-functional leadership to drive product roadmap and strategy.</li>\n<li>Manage all aspects of marketing for launches of new products. Drive strategy and execution of global launches working closely with partners and regional marketing teams.</li>\n<li>Own strategy for key assets such as website, product videos, blog posts, and more. Scale Android TV marketing messages through key partner campaigns.</li>\n<li>Develop and execute scaleable creative guidance that drive Android TV awareness, usage, and partner sales. Partner with internal teams like Google Play, Google Maps, and Google Assistant in campaigns.</li>\n<li>Develop actionable consumer insights to inform product and marketing strategy through primary research projects and other consumer research techniques, working closely cross-functional teams including UX, Design, PM, and Support.</li>\n</ul>",
    "title": "Product Marketing Manager, Android TV"
}