{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVeysD4xGt6fAWyLmT418k1n-eGnedULKlhmLIJO4hQSOgASYQ8wTQ_1AhnnEjAjbNuVeSyAN4s7KtucmRd0bESQ0DR9RTCNYZLJZfk5rhDysy0_BgUjtn4gJWo%3D_V2&jobTitle=Treasury+Program+Manager%2C+Program+Management+Office%2C+Alphabet&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T22:01:50.755Z",
    "description": "<p>Finance Project Managers drive critical priorities for Google by leading and assisting in projects of all sizes. Drawing from your strong financial background, you work with a diverse team to manage projects from concept to implementation and keep Google-wide stakeholders informed as you go. You get down into the details of complex analyses without losing sight of the overall objective. When working on multiple projects at once, you intuitively know which issues to highlight and can bring key decision makers together to come up with effective solutions. Once a project is completed, you&#39;re able to clearly communicate the results and draw the key learnings for senior management. You are efficient and organized, making the most of everyone&#39;s abilities and holding the team to a high standard.</p>\n\n\n<p>The PMO team&#39;s goal is to support Alphabet and Other Bet Finance areas by accelerating the achievement of their strategic priorities, solve their toughest problems and to build out a PM skillset across the organization.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/99810783480685254",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-13T17:31:40.423Z",
    "publish_date": "2019-03-13T17:31:40.423Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>8 years of relevant work experience and experience as a business analyst, defining and documenting business requirements and processes with cross-functional teams.</li>\n<li>Experience in program management and end-to-end project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>PMP and/or Six Sigma certification or experience. Experience working on process/operational optimization.</li>\n<li>Ability to lead discussions in cross-functional groups and with executives to identify issues and resolutions.</li>\n<li>Ability to provide strategic thinking along with excellent business acumen and can use to support strategic and tactical initiatives.</li>\n<li>Deep understanding of treasury and general finance to guide decision making, solve problems, provide analytical insight and business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Structure projects with your stakeholders, define project goals and risks to execution, gather and define comprehensive requirements, design new business processes, effective change management to deliver on planned benefits and usher projects through the entire project lifecycle, including clearly communicating status, risks and remediation plans to executive stakeholders.</li>\n<li>Collaborate with Treasury, Accounting, Tax and cross-functional teams to document workflows, identify gaps, propose improvements and drive consensus to achieve agreed set of requirements</li>\n<li>Create business case and business requirements documents, develop test plans</li>\n<li>Establish and lead working group meetings. Deliver regular project status reporting, presenting to Executive sponsors</li>\n<li>Define and monitor key metrics in order to measure business impact of process improvements</li>\n</ul>",
    "title": "Treasury Program Manager, Program Management Office, Alphabet"
}