{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Moncks Corner, SC 29461, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaQuWBWa6UiC-jSIYEr5lT5iByZvSpLbxL9zQ37rIEsSOgCPMA3TWuvH6RcGLDQwuSqI-dfhWNSicSiydp7WdWYuTxt1zVjQeP9uBvYwY_5W5se_eGdBlm-NOqI%3D_V2&jobTitle=Global+Process+Manager&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:09.253Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Process Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Global Process Manager, you will facilitate process, design, optimization, and continuous improvement for Global Processes within the Hardware Operations organization and across Technical Infrastructure. You&#39;ll lead projects to define process for our most critical data center infrastructure.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4917644223512576",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:47:50.270Z",
    "publish_date": "2019-02-27T19:43:57.696Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BS degree in Computer Science or Engineering, or equivalent practical experience.</li><li>Experience in process standardization/improvement . Experience designing process and also leading organizational change to implement process or standard.</li><li>Technical experience with personal computers and internal components (RAM, Disk Drives, CPU, Motherboard, etc).</li><li>Ability to travel up to 25% of the time.</li></ul><br><p>Preferred qualifications:</p><ul><li>Master&#39;s degree in Computer Science or Engineering.</li><li>Six Sigma/Lean or comparable certifications.</li><li>3 years of Process Experience in industry-standard process design and methodologies.</li><li>Experience in a manufacturing environment.</li><li>Experience in creation and implementation of standard work.</li><li>Demonstrated interpersonal and communication skills, with the ability to work effectively with all organizational levels.</li></ul>",
    "responsibilities": "<ul><li>Define, manage, maintain, and improve processes within Google’s hardware and software infrastructure.</li><li>Act as the lead communicator on process between various projects and groups, and the functional areas.</li><li>Travel throughout Google to educate and be educated about Google infrastructure.</li><li>Encourage innovation, process improvements and solutions within the functional areas.</li></ul>",
    "title": "Global Process Manager"
}