{
    "application_instruction": "This role may also be located in our Playa Vista, CA campus.",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU9EdaC5GZVjUfeq4Z9IiMQM37vONzg_P1wpN9N9Sq4SOgASYQ8wHN2r3WS1sT-pmMJzo0C8no0JagVDOGsZkqs8E33W81hS-qD676SeVjc7Q94jEwvUEUR9cY4%3D_V2&jobTitle=Head+of+Customer+Experience+Center&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-09T00:31:43.800Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>As the Head the Customer Experience Center in Los Angeles, you and your team will be responsible for creating a space that bends the notion of possibilities. You will run a highly successful team, where members have diverse roles and responsibility to deliver on the Customer Experience Center vision and plan(s).\n</p>\n\n<p>In this role, you will be responsible to deliver excellent C-level programs and experiences. You will do this by combining data-driven presentations with breakout group discussion and ideation, working in close collaboration with other roles on the Customer Experience Center team (e.g., Content Strategist &amp; Designer and Data Visualization Specialist) as well as cross-functional stakeholders.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82092442032972486",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-09T00:31:43.800Z",
    "publish_date": "2019-03-09T00:31:43.800Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of combined experience in technology, advertising, management, and consulting.</li>\n<li>Experience operating a technology-driven experience/space.</li>\n<li>Experience facilitating workshops and leading conversations with business executives or other audiences.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to lead and comfortably communication across all levels of leadership.</li>\n<li>Ability to learn and embrace new technical platforms in a self-guided fashion.</li><li>Excellent operational abilities and and cross-collaboration skills.</li>\n<li>Excellent entrepreneurial leadership.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver on the expectations of a space and client experience(s) that inspires the transformation of partnerships with Google&#39;s largest advertisers, including overseeing all logistics to ensure seamless execution.</li>\n<li>Run a highly successful, innovative team committed to creating programs that enable customers to reach their business objectives.</li>\n<li>Coach the team to pivot and iterate where necessary (e.g., content, delivery, experience, etc.) to deliver max innovation and creativity at all levels, in addition to identifying what is working to drive scale.</li>\n<li>Lead and moderate C-level programs, articulating data-driven insights and recommendations for our largest customers, and help them understand how Google can drive their brand and business objectives.</li>\n</ul>",
    "title": "Head of Customer Experience Center"
}