{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTI8SWo-HANLPq_ftPX-Y1BhqRZHc2kGjoLPHY9t1uMSOgCPMA3TYi-kPDSrJs_1bASlzOFXDm4saJUbBMWvyzB7GGEPIr5pNP3HkKQXgAIKcSX_jx-4RTuZExo%3D_V2&jobTitle=Strategic+Real+Estate+Planning+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-18T21:01:35.049Z",
    "description": "<p>The Strategic Portfolio Planning (SPP) team develops global, strategic real estate plans that delivers clear solutions to complex real estate needs of Google. \n</p>\n\n<p>As a Strategic Real Estate Planning Manager on the Real Estate and Workplace Services (REWS) team, you are responsible for leading the development of regional growth strategies to satisfy complex and expanding business needs. You will use data, insights and problem solving skills to develop and present multiple space scenarios to REWS stakeholders ensuring we optimize our real estate portfolio. You will forecast and plan scenarios to help develop, drive and monitor the success of all real estate decisions.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5682715733196800",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:53:29.919Z",
    "publish_date": "2019-02-27T19:53:29.919Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business Economics, Administration, Finance, Strategic Planning, Statistics, a related quantitative analysis discipline or equivalent practical experience.</li>\n<li>10 years of leadership experience in real estate management or business/strategy consulting.</li>\n<li>Experience managing teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in developing real estate solutions with executives regional portfolio leads, planning team and business partners.</li>\n<li>Data analysis/data management experience. Ability to work with a variety of metrics, numbers and data from multiple sources and conduct basic statistical analyses, including correlations, linear and logistic regression, etc.</li>\n<li>Ability to synthesize data from various systems in HR, Finance and other departments and build business cases for a variety of business and real estate related decisions. Ability to explain complex analytics in a structured and clear manner.</li>\n<li>Ability to communicate effectively at all levels and operate with flexibility in a matrixed work environment. Ability to meet goals, manage expectations and draw out unique opinions and insight.</li>\n<li>Ability to bring out the best work in a diverse team while also fostering trust, respect and adaptability.</li>\n<li>Change management skills, including designing, implementing and maintaining globally scalable processes across a range of engagement types and collaborators.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a team of planners responsible for forecasting real estate demand and developing local real estate plans. Cultivate a collaborative, supportive and productive work environment for the team that fosters both consistent best practices and creative solutions across time zones.</li>\n<li>Support and enable all discussions on strategic planning or real estate portfolio planning in the Bay Area.</li>\n<li>Build an understanding of budget, financial analysis and financial governance.</li>\n<li>Communicate, influence and collaborate at all organizational levels and with vendor teams. Drive strategic recommendations through review and approval.</li>\n<li>Be an advocate for the local team and deliver clear presentations of the highest quality to senior leaders in the organization.</li>\n</ul>",
    "title": "Strategic Real Estate Planning Manager"
}