{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXYBHPXRlEjVC7mPc2IY0t4_CLZLGoRbCd-gyjs_edESOgCPMA3TYW7qjdqDygIduL8w0mJfWofvr2w9wtOwqqPr8a_W5oMc69SAfNcoaMbk3CmQ6xSYe7I8By8%3D_V2&jobTitle=Project+Manager%2C+Finance+Program+Management+Office&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:03.668Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>As a Program Manager in the Finance Program Management Office, you will be a leader helping write the next chapter of Alphabet’s evolution in a multi-year transformation program. You will work closely with multiple groups across Google and Alphabet, leveraging your knowledge of Finance processes and systems to develop solutions that meet our business. You will manage your assignments through the entire project lifecycle working closely with Finance, Corporate Engineering teams and Professional Services Partners to deliver on commitments. Additionally, you will work with cross-functional Finance teams to establish overarching strategy, goals and objectives, define requirements, design new business processes, structure and implement projects, manage delivery and communicate status to stakeholders. \n</p>\n\n<p>You understand execution risk and how to mitigate it. You know that effective change management is core to success this role, you will drive efforts with business teams to ensure planned benefits are delivered. You understand stakeholder management and effectively manage relationships across large and complex organizations and Professional Services partners. You will lead complex systems/process design, implementation and integration projects, leveraging your finance and technical expertise and challenge the status quo, striving for continuous improvement, operational excellence and a focus on designing for the future.\n</p>\n\n<p>We need strategic thinkers with excellent business acumen who can leverage a deep understanding of Finance processes to evaluate alternatives, guide decision making, solve problems, provide analytical insight and business judgment to support strategic and tactical initiatives across the Alphabet organization. Not bound by the status quo or your job title, you will seek out new ways to solve complex finance operational issues and have demonstrated you know how to find the right balance between risk, speed and cost. Relationships will be crucial to our success and yours. You will need to be able to navigate a large organization building effective relationships and be comfortable with ambiguity and tight deadlines. You are an innovative thinker who understands how it all comes together across finance from the transactions to the reporting.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6323885836533760",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T22:54:48.151Z",
    "publish_date": "2019-02-27T19:50:43.350Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of relevant work experience and experience as a business analyst, defining and documenting business requirements and processes with cross-functional teams.</li>\n<li>Experience using Finance systems and with Finance business processes (e.g., Record to Report, Acquire to Retire/Fixed Assets, Cost and Inventory Accounting, Statutory Reporting, FP&amp;A).</li>\n<li>Experience in end-to-end project management and the system development lifecycle, leading and supporting cross-functional transformation initiatives and facilitating discussions with executives.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA/CA/MBA, Master&#39;s degree or PhD.</li>\n<li>Ability to lead discussions in cross-functional groups and with executives to identify issues and resolutions.</li>\n<li>Ability to adapt to quickly changing priorities with excellent business judgment.</li>\n<li>Excellent change management, team management and process improvement skills.</li>\n<li>Excellent problem-solving, analytical and organizational skills.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with Finance teams to document workflows, identify gaps, propose improvements and drive consensus to achieve agreed set of requirements. Create business case and business requirements documents and develop test plans.</li>\n<li>Structure projects with stakeholders, define project goals and risks of execution, develop comprehensive project plans and drive projects through the entire project lifecycle, including clearly communicating status, risks and remediation plans to executive stakeholders. Drive quality delivery of project scope, on time and within budget.</li>\n<li>Establish and lead working group meetings and create regular project status and executive reporting. Track accomplishments, milestones, key issues and/or change controls and resolve issues that arise, considering impact to the project timeline and to other finance tracks.</li>\n<li>Work with Finance leaders to deliver change management to ensure new processes/technology are deployed effectively.</li>\n<li>Define and monitor key metrics in order to measure business impact of process improvements.</li>\n</ul>",
    "title": "Project Manager, Finance Program Management Office"
}