{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Sunnyvale, CA, USA; San Francisco, CA, USA; San Bruno, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeAl_asYx95xYc2DopMsniuJUxmIjSB586TQLP7qXWQSOgCPMA3T5VoY6G15YcQhQ9YsOScG3f9E7c5RaxGsj7Pa1nMByU6vgnAERDj3-92gFoV7DUnKKKiTClE%3D_V2&jobTitle=Software+Engineer%2C+Networking&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:43:48.862Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br><br>With your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n<p>As a software engineer working on networking systems, you will work on a specific project critical to Google’s needs. Current needs include high-impact projects in network telemetry, network monitoring, campus networking, wireless communications, as well as core data infrastructure work helping to expand our global data center presence. \n</p>\n\n<p>You are an engineer who can bring fresh ideas from areas of networking and distributed computing and has a passion for pushing technology forward.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5736696295260160",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T22:44:13.763Z",
    "publish_date": "2019-02-27T19:43:05.154Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or a related technical field or equivalent practical experience.</li>\n<li>Experience with networking software (e.g., OSI Model, TCP/IP, IPTables, NAT, Deep Packet Inspection, IPV4, IPV6, routing protocols, etc.).</li>\n<li>Coding experience in C/C++, Java, Python or Go.</li>\n<li>Experience developing large scale distributed systems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MS or PhD in Computer Science.</li>\n<li>Experience with Unix/Linux environments.</li>\n<li>Familiarity with Network Virtualization or Software Defined Networking (SDN).</li>\n<li>Experience with load balancing and Edge Computing concepts such as Content Delivery Networks (CDN).</li>\n<li>Understanding of 2 or more of the following Networking and Communications protocols: RCS, WebRTC, LTE, Wireless/WLAN, Evolved Packet Core (EPC), Fast Packet Processing, Traffic Analysis/Management, Caching, ForCES, OpenFlow, etc.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build our networking platforms, systems and infrastructure using your strong background in networked and distributed systems.</li>\n<li>Design, develop, test, deploy, maintain, and enhance networking software solutions.</li>\n<li>Manage individual projects priorities, deadlines and deliverables.</li>\n</ul>",
    "title": "Software Engineer, Networking"
}