{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcka5C1KtXUPfC5uflXTaSMk2xKO_0LDQ_2R73PtBJjh8SOQASYQ8wEOgs904VH-aG-mSudMEE-I5LLxEoSenSeX_jTQZwV963dG9IZZ_VIh155S7-9dQ5CAzA7A%3D%3D_V2&jobTitle=Account+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T17:01:44.745Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>As an Account Manager for Google Cloud, you&#39;ll be responsible for ensuring the success of established customers, driving business growth and ensuring customer satisfaction. In this role, you will represent all things Google Cloud Platform for strategic accounts, and interact closely with internal teams, such as Support, Product Management, Engineering and Sales.\n</p>\n\n<p>Through your technical expertise, relationship building skills, and understanding of customer context, you&#39;ll identify ways to be an advocate for the platform to grow the customers&#39; business and collect feedback from them to help drive product direction.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6620858105757696",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-02-27T19:47:36.956Z",
    "publish_date": "2019-02-27T19:47:36.956Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in business-to-business sales, account management, marketing, technology sales, or consulting.</li>\n<li>Experience with IaaS or PaaS sales.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in a direct sales, account management, inside sales or technical pre-sales capacity.</li>\n<li>Experience in the cloud, software, internet, or media industries and experience with CRM solutions.</li>\n<li>Demonstrated technical understanding of PaaS and IaaS.</li>\n<li>Ability to build relationships with external and internal partners.</li>\n<li>Goal-oriented, self-motivated and able to work independently, and learn and adapt quickly within a team environment.</li>\n<li>Developed communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop deep trusted advisory partnerships with Google Cloud Platform customers, and ensure customer success by collaborating with internal teams to build passion for Google Cloud Platform.</li>\n<li>Drive business cycles within established accounts by covering activities from opportunity identification to discovery and solutions.</li>\n<li>Focus on customer satisfaction and retention.</li>\n<li>Demonstrate relationship-building skills, provide technical guidance, develop key account plans, drive Quarterly Business Reviews (QBRs), share roadmaps, and solicit feedback.</li>\n<li>Maintain relationships with customer-facing internal and cross-functional teams to ensure seamless customer experiences.</li>\n</ul>",
    "title": "Account Manager, Google Cloud"
}