{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZJygSuUXhRcGJdHxIArDlIe9LYNfP9Yf-3T_HN9yxgSOgCPMA3TS3CbsDeUsllHZRZIlG0KlkbL4yu5xuKJEr2OJolULFFpotKw87fm6DgIna0wzNln8PLvMq0%3D_V2&jobTitle=Marketing+and+Analytics+Lead%2C+Online+Partnerships+Group&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:44.359Z",
    "description": "<p>The Online Partnerships Group (OPG) is a partner-focused organization that prides itself in providing great service, in creating innovative solutions, and most importantly, in having amazing people. We value having an open, inclusive and collaborative culture, where Googlers feel supported and able to do their best work. In offices around the globe, we foster and celebrate an environment where all team members feel welcomed and respected. OPG partners with online publishers and app developers around the world to grow their businesses using our portfolio of products including the AdSense, AdMob, and Google Ad Manager platforms. We offer a solutions-based approach across advertising, analytics, and site or app design, and pride ourselves in finding new opportunities for our partners to better engage users and advertisers. Over a million web publishers and app developers rely on our solution globally, and ultimately, we&#39;re proud to enable Google to be one of the foremost funders of digital content in the world.</p>\n\n\n<p>In this role, you&#39;ll work to uncover scalable ways to help our publishers grow their business and help the team deliver high-quality campaigns to publishers. You&#39;ll own the global growth marketing strategy and goals across partner advertising products and drive process efficiencies, testing and program performance through multiple marketing channels. You&#39;ll work to continuously look for ways to innovate and improve scale, reach, quality and impact of our campaigns. You will work on a global team and will manage stakeholders across multiple functions.\n</p>\n\n\n<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p>Google helps our partners find better ways to reach their audiences and manage their digital businesses. In return, our partners provide great content for our products, and they syndicate Google products to enhance their sites and apps. Global Partnerships team members expand and support these relationships by continually finding new opportunities and solving technical problems for our partners. The wider Global Partnerships team includes a variety of different organizations, including CorpDev, Emerging Business Development, Strategy and Operations, Google for Startups, Area 120 and our Display Advertising Business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5014443853545472",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:54:00.523Z",
    "publish_date": "2019-03-06T19:31:44.994Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>7 years of experience in marketing or analytics in the technology space.</li><li>People management experience.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in customer marketing, email marketing and customer loyalty programs.</li><li>Experience in data analysis or consulting.</li><li>Track record of delivering large-scale projects and managing multiple complex projects simultaneously.</li><li>Understanding of marketing perspectives for the online advertising industry.</li><li>Ability to analyze and distill data into actionable insights and relevant marketing program improvements.</li><li>Ability to influence at all levels and work effectively across functions and geographies. Excellent written and oral communication skills, with the ability to present to both internal teams and external partners.</li></ul>",
    "responsibilities": "<ul>\n<li>Shape growth marketing communications roadmap across channels (email, blog, social, etc.).</li>\n<li>Set accurate business growth targets. Measure and manage growth marketing programs by partnering with Marketing and Finance teams and analysts to assess impact and partner product adoption.</li>\n<li>Collaborate closely with cross-functional partners to align on product branding and messaging to meet our business goals.</li>\n<li>Manage a team of marketers and marketing analysts. Support the team in the development of new content, launch experiments and improve the process efficiency of our multi-channel delivery of campaigns.</li>\n<li>Optimize programs and identify new segments and opportunities driven by measurable results.</li>\n</ul>",
    "title": "Marketing and Analytics Lead, Online Partnerships Group"
}