{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZgGNFocck1qRNcy9ClBeQqneB88OBmvYaYDPxi3FgkSOgASYQ8w2yfHzrq53MHeucsso2cmz_eVXhfSmH-Bw51zznS2LiIV6uK4GIzuXkB8mV7_MWYljXX6reA%3D_V2&jobTitle=Director+of+Brand+Strategy%2C+Brand+Studio&loc=US",
    "categories": [
        "ADMINISTRATIVE",
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-23T23:01:40.402Z",
    "description": "<p>Brand Studio is a passionate team of creative thinkers and marketers. We protect and promote Google’s brand and reputation through programs, products and narrative experiences that express Google’s values in action across the world. As part of our team, you’ll define and create the visual and strategic elements that comprise Google’s brand and product identities. You’ll articulate standards that harmonize and bring a uniquely Google point of view to all of our products and communications. By embracing user insights, strategic thinking, beautiful design and provocative execution, you will create delightfully intuitive (and inventive!) experiences that will define the future of Google’s brand.</p>\n\n<p>Whether you&#39;re on a consumer product (e.g., Gmail, Search, Maps, Chrome, Android) or a business product (e.g.,Google Ads, AdSense, Google Marketing Platform, Analytics), the Director of Brand Strategy for Brand Studio will take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you will help shape the voice of the product and help it grow a consumer base. This means you will work with a cross-functional team across Sales, Corporate Communications, Legal, Webmasters, Product Development, Engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4902221122666496",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T20:46:19.888Z",
    "publish_date": "2019-02-27T19:54:02.747Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a relevant field or equivalent practical experience.</li>\n<li>15 years of experience in consumer marketing, brand strategy, or brand planning via an agency or consumer/brand-driven company.</li>\n<li>Experience in strategy consulting or data driven analytics.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in developing original and breakthrough work, along with experience in the technology category.</li>\n<li>Ability to influence creatives and agencies.</li>\n<li>Ability to work on multiple projects simultaneously.</li>\n<li>Ability to work as part of a fast-paced team with excellent communication skills.</li>\n<li>Ability to make sophisticated technology accessible and understandable to a wide audience.</li>\n<li>Interest in gadgets, inventions and new technologies.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate across Google to develop brand and communications strategies that bring stories to life and drive brand portfolio thinking across the organization.</li>\n<li>Lead brand co-marketing partnerships from strategy to execution, adapting centrally-developed global campaigns to local market needs.</li>\n<li>Manage creative briefs, agency selection and agency management to produce inspiring creative.</li>\n<li>Craft compelling product and organizational brand strategies for new and existing products and offerings.</li>\n<li>Act as a brand advocate, providing thought-leadership, inspiration and best practices, contributing to the success of brand strategy and marketing communications.</li>\n</ul>",
    "title": "Director of Brand Strategy, Brand Studio"
}