{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYr31MxnzSTNB56l4468Pto2woubyhSK_xn2HlLuDfMSOgCPMA3T0QB1JeDFw8sA5ZwvpwHI1yBJGOhia8uLrQ0oj_KOtU9dCnWPZPywnC5GBiBnOOXbnJNLuus%3D_V2&jobTitle=Policy+Enforcement+Manager+Lead%2C+YouTube+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-11-27T21:31:54.537Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>You will be responsible for working with a global team from Policy, Enforcement, Product, Engineering, Tools, Legal and other teams to prevent violative content from appearing on the site. </p><p>You work with cutting edge tools and technology including machine learning to detect and action violative content. You understand the latest trends and suspicious activities on the site, and develop creative solutions to address these issues. You evaluate potential abuse and complex signals on the platform and make decisions about the appropriateness of different content, including considerations of cultural and political sensitivities.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4832164793090048",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:03.531Z",
    "publish_date": "2019-03-07T01:32:03.531Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in content policy, anti-abuse or scaled operations.</li>\n<li>Relevant consulting or program management experience.</li>\n<li>Experience managing teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of experience identifying abuse trends or working in news or policy with passion for international issues, including freedom of expression, online controversial content, cyber crime, etc.</li>\n<li>Strong analytical skills, including using data to drive strategy and business action; experience with SQL, programing and spreadsheets.</li>\n<li>Comfortable working with different tools and software.</li>\n<li>Strong business judgment and outstanding influencing and communication skills; ability to build strong relationships with cross-functional partners.</li></ul>",
    "responsibilities": "<ul>\n<li>Lead a team of Policy Enforcement Managers including coaching, team prioritization and problem solving.</li>\n<li>Stay up to date on key trends and suspicious patterns, including deceptive online practices. Review controversial, and sometimes offensive video content in line with YouTube’s Community Guidelines.</li>\n<li>Manage escalations with a fast turn-around time to define and deliver the best action plan.</li>\n<li>Be passionate about working cross-functionally, thinking strategically, and keeping our users safe while protecting free speech.</li>\n<li>Be available on-call as required on weekends on a rotational basis to handle policy escalations, which require immediate resolution, from both internal and external stakeholders.</li>\n</ul>",
    "title": "Policy Enforcement Manager Lead, YouTube Trust and Safety"
}