{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckegt2-06i7_cjfwMEUkHRnlkui2PyeTyFP-lZSh1HA0SOgASYQ8wZhzNJiMH5gkRcXi_QnIWs4tzFeIRPu487gb_GTeuaL1ASp2tvwtnu1XtVLFITXzozJn-VgM%3D_V2&jobTitle=Content+Product+Lead%2C+Creator+Programs%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-05T13:31:36.976Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, which presents unique opportunities and challenges to support over a billion monthly users globally. Fast-paced, dynamic and proactive, the YouTube Support team provides seamless and excellent help to our creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it and to allow our users’ voices to help shape product solutions. As a member of the Support team, you&#39;ll analyze top user and creator issues, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide high-touch support, you&#39;ll enhance the YouTube global user experience by driving reach, satisfaction, and resolution.<br></p>\n\n<p>The YouTube Content Tools team is a dedicated tools team inside the YouTube Content organization and is responsible for two areas: organizing the Content organizations data and make it internally accessible and useful, and empowering YouTube business success through innovation and scalable technical solutions.\n</p>\n\n<p>As a Product Lead, you will work with the YouTube Content Tools development and data teams to realize the business’s visions for internal tools that will delight and empower our Operations team, and by extension our YouTube partners. You&#39;ll usher tools through their lifecycle, from requirements gathering all the way to launch and post-launch support. This includes managing project schedules, identifying risks and clearly communicating goals to business stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the progress and deadlines.\n</p>\n\n<p>In addition to these larger projects, you will be responsible for improving the overall tools ecosystem through defining best practices, documenting processes, and helping educate the broader YouTube organization on how they can best leverage the efforts of the Content Tools team.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/92384594436727494",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T00:32:02.306Z",
    "publish_date": "2019-03-07T00:32:02.306Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>Experience tracking and translating technical/non-technical discussions into actionable tasks and next steps.</li>\n<li>Experience in working across organizational boundaries to define, manage, and prioritize work.</li>\n<li>Experience in program management (i.e. project and issue tracking, release/risk management, etc.).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in a technical or product management roles.</li>\n<li>Familiarity with agile development processes.</li>\n<li>Ability to operate independently in a fast-paced, ambiguous, and global environment with proven success in project management, execution and multitasking.</li>\n<li>Track record in streamlining complex processes and implementing workflows designed to increase efficiency and improve user experience.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify, structure, and lead tools development projects to serve the YouTube Content Organization. Work with engineers to design, implement, launch, and support new processes and tools.</li>\n<li>Collect and analyze data to draw insight and influence strategic decisions and define a roadmap for technical solutions, with a focus on impact and user experience.</li>\n<li>Provide project management for engineering and product efforts related to tools projects you are managing.</li>\n<li>Work with stakeholders to provide ongoing support for tools that you launch, via such methods as documentation, troubleshooting, and training.</li>\n<li>Familiarity working with databases, with ability to to write basic SQL queries.</li>\n</ul>",
    "title": "Content Product Lead, Creator Programs, YouTube"
}