{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckez4urG6WxGsxygRmVDucXqq8ig6WoxH9xpcHxkzw1wSOgASYQ8wFq7CSbQARP7MnUXPmlWd7y4eih9dBPM_BssNwqRiG2iPjv_DyBdovd1lAGcydJEVPHgTfjA%3D_V2&jobTitle=Strategy+and+Operations+Lead%2C+Media%2C+Gaming+and+Telco&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-18T15:31:50.066Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As a Strategy and Operations Lead, you&#39;ll drive programs globally for the industries by understanding strategic segments, the product/solution fit for each segment and executing to priorities set by the global industry vertical lead.\n</p>\n\n\n<p>You&#39;ll leverage your problem solving skills, industry experience and executive relationships, to help grow adoption of Google Cloud Platform’s products and services. \n</p>\n\n\n<p>Using your influencing and relationship-building skills, you&#39;ll work with other internal teams and stakeholders to enable Google Cloud adoption in crafting a compelling set of value propositions and initiatives.\n</p>\n\n\n<p>You’ll collaborate with Engineering, Product, and Marketing teams to define, launch and take to market solutions that accelerate our customer success in the cloud. Your strategic mindset, analytical thinking skills, passion, depth of knowledge, and excellent organizational, communication and interpersonal skills will motivate our teams and establish trust amongst a diverse set of stakeholders and customers.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103278661542519494",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T15:31:50.066Z",
    "publish_date": "2019-03-18T15:31:50.066Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience working directly within, or consulting for the media and entertainment, gaming, or telco verticals.</li>\n<li>Experience with technologies and data, including cloud computing and video.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Experience driving digital and operational transformation for strategic companies in the industry.</li>\n<li>Track record in driving business growth and KPI attainment.</li>\n<li>Demonstrated ability to maintain performance with increasing levels of responsibility and independence.</li>\n<li>Action-oriented, with a sense of anticipation.</li>\n<li>Ability to work comfortably with business executives and leadership. Ability to multitask and meet deadlines, and stay calm under pressure.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with the management team to drive projects forward, assess risks, monitor tasks and work closely with Business Development, Production, Engineering and Sales teams to understand their requirements.</li>\n<li>Enable cross-functional collaboration across and within the organization. Help be the voice for teams and bring better visibility, status and risks/opportunities of important efforts.</li>\n<li>Drive thought leadership, and identify issues or roadblocks with existing processes. Create and promote solutions to keep processes running smoothly.</li>\n<li>Manage strategic programs, both internally within the vertical and throughout Google, and communicate with customers on tactical day-to-day projects.</li>\n<li>Partner closely with Product Management, Strategy, Business Development, and Strategy and Operations teams on the development of new processes and their implementations. Advocate for improving/enhancing existing capabilities where appropriate.</li>\n</ul>",
    "title": "Strategy and Operations Lead, Media, Gaming and Telco"
}