{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Atlanta, GA, USA; Cambridge, MA, USA; New York, NY, USA; Chicago, IL, USA; Kirkland, WA, USA; Los Angeles, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaQptlYgkr8OMGV8O6n-biGY2crha3uXOrF0ZadRufESOgASYQ8wKvty7GZJqXSnOeuXwpua6_7BvhtIUtFjlOTReCT4_2Qi56P35QF2declmyoNNWJ6J6DHUIE%3D_V2&jobTitle=Sales+Engineer%2C+Hybrid+Cloud%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T17:01:58.664Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As a Sales Engineer, you will work hand-in-hand with technical Sales teams as an enterprise hybrid cloud subject matter expert to differentiate and paint the vision of Google Cloud to our customers. You will help prospective customers and partners understand the power of Google Cloud, explaining technical features, helping customers design architectures, engage in proof of concepts, and troubleshooting potential roadblocks.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/136473070056415942",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-19T17:01:58.664Z",
    "publish_date": "2019-03-19T17:01:58.664Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or equivalent practical experience.</li>\n<li>Experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer facing role.</li>\n<li>Experience with legacy and modern application development, cloud service delivery, and deployment.</li>\n<li>Experience with containers and associated technologies.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other technical field.</li>\n<li>Experience with developing scalable architectures using API management, microservice frameworks, PaaS, and container orchestration systems, or other applicable platforms.</li>\n<li>Experience in advanced areas of networking.</li>\n<li>Experience with networking concepts and logging and monitoring of hybrid-cloud workloads.</li>\n<li>Understanding of application security patterns including web application security, service mesh and mobile security strategies.</li>\n<li>Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with the team to identify and qualify business opportunities, understand key customer technical objections and develop a strategy to resolve technical blockers.</li>\n<li>Provide in-depth enterprise infrastructure/cloud modernization expertise to support the technical relationship with Google’s customers.</li>\n<li>Guide customers through assessments of their existing legacy application environment(s), provide recommendations on a prioritization roadmap for application modernization, identify candidate applications for migration to hybrid-cloud computing models.</li>\n<li>Structure and execute prototyping workshops to prove out proposed new architectures, developing best practices, and documenting key blocking requirements for prioritization with engineering.</li>\n<li>Travel to customer sites, conferences, and other related events as required.</li>\n</ul>",
    "title": "Sales Engineer, Hybrid Cloud, Google Cloud"
}