{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Reston, VA, USA; Atlanta, GA, USA; Addison, TX, USA; Irvine, CA, USA; Moncks Corner, SC 29461, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQI0jxbN_uIdE4OZjy8VN6oYfunk5TBplgOjpcy_UeESOgASYQ8w72gHvTblTNfz7RIdaZCU98Qg3RcV4lyVGa2tZT3lsScXt_n3i48qTpxEERp2Vcmp4eR8e-A%3D_V2&jobTitle=Network+Deployment+Engineer&loc=US",
    "categories": [
        "NETWORK_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-13T20:31:49.143Z",
    "description": "<p>Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google&#39;s complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.</p>\n\n<p>The Network Deployment team is responsible for operating our network reliably and at scale. The team owns the full life cycle of all space, power, and network assets for Google’s data centers and metro points. The team is involved in every facet of network delivery from architecture and design to installation, configuration, activation, and commissioning. Once up, the team works to ensure that the network stays up, and is well positioned. \n</p>\n\n<p>As a Network Deployment Engineer, you&#39;ll be on the front-lines of our efforts. You will work with Network Architects and Engineers, Design Engineers, Infrastructure Engineers, Field Engineers, Strategic Negotiators and Technical Project Managers within Google, as well as construction and telecommunications Vendors and Contractors, to position the assigned metro.\n</p>\n\n<p>You will use your experience in optical transport, data centers, and colocation, as well as your familiarity with the local metropolitan areas, to which you are accountable, to affect positive outcomes and facilitate faster, better, and more efficient outcomes.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128026718234387142",
    "location": {
        "address_lines": [
            "Addison, TX, USA"
        ],
        "city": "Addison",
        "country": "TX",
        "country_code": "US",
        "display": "Addison, TX, USA",
        "lat": 32.96179,
        "lon": -96.82916850000001
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=15303+North+Dallas+Parkway%0ASuite+400&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=15303+North+Dallas+Parkway%0ASuite+400&size=1168x324&zoom=12&signature=p_c9D9SwCDy9PhdUTuPIk_cIoz4=",
        "large_2x": "/maps/api/staticmap?center=15303+North+Dallas+Parkway%0ASuite+400&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=15303+North+Dallas+Parkway%0ASuite+400&scale=2&size=1024x324&zoom=12&signature=kE2JU83KDl4A1GorUCgQQJ1N6Dg=",
        "small_1x": "/maps/api/staticmap?center=15303+North+Dallas+Parkway%0ASuite+400&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=15303+North+Dallas+Parkway%0ASuite+400&size=600x400&zoom=12&signature=n2ZNpfm8xdL90n1kEC3r833L3VA=",
        "small_2x": "/maps/api/staticmap?center=15303+North+Dallas+Parkway%0ASuite+400&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=15303+North+Dallas+Parkway%0ASuite+400&scale=2&size=600x400&zoom=12&signature=TP7Xy8W-8m4zgl1iAV78BXX9Ylg="
    },
    "modified": "2019-02-27T19:56:13.012Z",
    "publish_date": "2019-02-27T19:56:13.012Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>2 years of experience with optical network installation, maintenance and operation for service providers or enterprise networks.</li>\n<li>2 years of experience with ISP network operations, tier one-two or enterprise/IT network infrastructure.</li><li>1-year of experience in a telecommunications field. </li><li>Experience with Layer 1 through Layer 3 network services and technologies, including Internet routing protocols, DWDM, and transport systems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with managing and/or directing field operation technicians, engineers, contractors and/or vendors in a telco working environment.</li>\n<li>Experience working with local exchange carrier (LEC) and other telecom service providers, building landlords, electricians, construction operators, and non-technical end users.</li>\n<li>Working knowledge of one or more of the following coding/scripting languages: Matlab, C++, Python, etc.</li>\n<li>Ability to travel up to 50% of the time as required.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be responsible for oversight and QA of installation technicians for rack, stack and installation of networking equipment.</li>\n<li>Work on test routers, optical transport equipment, and other network devices for new and existing network nodes across Google&#39;s global network.</li>\n<li>Generate implementation plans and provide technical leadership and guidance during deployment activities.</li>\n<li>Work closely with project management, network engineering and the engineering team to identify potential problems in network installations, including in the areas of facility power (AC/DC), cooling, security/access, rack layout and cable management.</li>\n<li>Own network documentation, updating and maintaining network drawings and plans.</li>\n</ul>",
    "title": "Network Deployment Engineer"
}