{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUM5vEEUwBKnXbQXpeOlnynK8jjMUIUPAab1bSaCQjMSOgASYQ8w_zVSWrElI_0bF7zhTWUgwUZLTQQhDj9RFfodC0rIjAyLbZAFp_629_4xkx3xvw4jGA4QcoM%3D_V2&jobTitle=Strategy+and+Operations+Manager%2C+Sales+Solutions%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-25T20:31:46.689Z",
    "description": "<p>As a Strategy and Operations Manager, you will work directly with business executives and key leaders on critical business projects. You will own strategic initiatives that include assessing market opportunities, developing go-to-market strategies, and driving the associated business planning processes. You&#39;ll fully immerse yourself in data collection, draw insight from analysis, and then develop compelling, synthesized recommendations.\n</p>\n\n\n<p>You are comfortable operating under uncertainty, structuring complicated issues, and finding creative solutions to business challenges. You will work in a rapidly changing industry and demonstrate problem-solving leadership with limited oversight.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/104916574432830150",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:56:54.860Z",
    "publish_date": "2019-02-27T19:56:54.860Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in management consulting, corporate strategy, or project management at a technology or media company.</li>\n<li>Experience in database querying and dashboard creation.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Experience with large data sets, synthesizing insights, and recommending actions from data.</li>\n<li>Experience planning and managing at both the strategic and operational level.</li>\n<li>Knowledge of cloud technologies, products, and market landscape.</li>\n<li>Ability to be successful in a complex, globally-scaled product, sales, and engineering environment. Ability to present to executives and communicate with technical management teams.</li>\n<li>Excellent analytical, program management, and problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the weekly, quarterly and annual initiative planning process, including the development of business plans, go-to-market strategies, and project timelines.</li>\n<li>Work with the cross-functional Leadership team to drive alignment on business goals.</li>\n<li>Structure and execute operational and strategic initiatives by developing work plans, gathering and synthesizing relevant data, leading analyses, and developing final recommendations.</li>\n<li>Own strategic initiatives on both an on-going and ad-hoc basis, working collaboratively across the global organization.</li>\n<li>Act as the strategic lead and project manager for Americas Sales Solutions.</li>\n</ul>",
    "title": "Strategy and Operations Manager, Sales Solutions, Google Cloud"
}