{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Chicago, IL, USA; Austin, TX, USA; Irvine, CA, USA; Atlanta, GA, USA; Reston, VA, USA; New York, NY, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckb_JD3fiCAAxpnR3nub4Tr8__Cq6b_L9pt-fCBFYv4oSOgCPMA3TypkST9ylaLkheC2kCwT0II6BFZ4XINpxNo1PuwfyBhtQuVSm4uBxJ09ZcT2ZhcbqKHeI0Sg%3D_V2&jobTitle=Strategic+Cloud+Engineer%2C+Google+Professional+Services&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:01.479Z",
    "description": "<p>As a Strategic Cloud Engineer, you will provide exceptional technical guidance to customers adopting Google Cloud Platform services. You will provide best practices on secure foundational cloud implementations, automated provisioning of infrastructure and applications, cloud-ready application architectures, and more. You will provide prescriptive guidance in ensuring customers receive the best of what Google Cloud Platform (GCP) can offer and you will ensure that customers have the best experience in migrating, building, modernizing, and maintaining applications in Google Cloud Platform. Additionally, you will work closely with Product Management and Product Engineering to drive excellence in Google Cloud products and features.</p><p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5519173225742336",
    "location": {
        "address_lines": [
            "Irvine, CA, USA"
        ],
        "city": "Irvine",
        "country": "CA",
        "country_code": "US",
        "display": "Irvine, CA, USA",
        "lat": 33.6845673,
        "lon": -117.8265049
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&size=1168x324&zoom=12&signature=0scIUM00JYt6krl0dVLxeAYyxkg=",
        "large_2x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&scale=2&size=1024x324&zoom=12&signature=tnVdtRFMVL5Bk73hj05eZrf-Rs8=",
        "small_1x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&size=600x400&zoom=12&signature=TznNrJ_EcJIGp2o6LDqvVxmeYN4=",
        "small_2x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&scale=2&size=600x400&zoom=12&signature=acf_mmVD1V_QyuRIYyB2EC0lV_8="
    },
    "modified": "2019-03-18T23:01:49.550Z",
    "publish_date": "2019-03-18T23:01:49.550Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Mathematics, related technical field, or equivalent practical experience.</li>\n<li>4 years of experience with cloud technologies in any of the following: distributed compute environments, cloud-native application development, hosted services, storage systems, and content delivery networks.</li>\n<li>Experience in writing software in one or more languages such as Java, Python, Go, JavaScript, C++, or similar.</li>\n<li>Ability to travel up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience automating infrastructure provisioning and/or continuous integration/delivery.</li>\n<li>Experience architecting, developing software, or Internet scale production-grade cloud solutions in virtualized environments.</li>\n<li>Experience with scalable networking technologies and web standards.</li>\n<li>Knowledge of containerization and container orchestration technologies.</li>\n<li>Customer facing skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide domain expertise on public cloud and enterprise technology.</li>\n<li>Work with the customer to design modern technical architectures and solutions that enable their business objectives.</li>\n<li>Be a trusted technical advisor and resolve technical challenges for customers.</li>\n<li>Create and deliver best practices recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders.</li>\n</ul>",
    "title": "Strategic Cloud Engineer, Google Professional Services"
}