{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ2gC38KC9d3p6YoL2KvB9QCpmByZD_1Y29QpePZDsgSOgCPMA3TJ_cvKtzgBrk3xj0xd987a9B5dVc3ZK5pWPylHMvHAxnE05rac3Jnwo7rSeoRuNEHGqfiD_Q%3D_V2&jobTitle=User+Experience+Researcher&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:26.166Z",
    "description": "<p>User Experience (UX) Researchers work to answer the most challenging questions in design. In this role, you will reveal what our users need from our products by conducting primary research, exploring the behaviors and motivations of our users, and working with teams of Designers, Product Managers, Engineers and others to develop new features. You’ll inspire change at all stages of product development by delivering exciting oral, written and visual presentations about our findings. Most importantly, your job as a researcher is to help the UX team understand what would make a user’s experiences feel more intuitive, accessible, fun—and even magical.<br><br>With considerable experience, you evaluate all the features contributing to user experience, providing expertise, collaborating internally and occasionally leading projects. You contribute new processes and identify product and use requirements.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p><div><br></div>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5141440135102464",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:39:14.227Z",
    "publish_date": "2019-02-27T19:39:14.227Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Anthropology, Human Factors, Psychology, HCI/Computer Science or other related fields or equivalent practical experience.</li>\n<li>4 years of work experience.</li>\n<li>Experience conducting semi-structured interviews, contextual field visits, usability studies either live or remote (e.g. Userzoom or usertesting.com).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or Ph.D. in a related field.</li>\n<li>2 years of relevant work experience. Experience with internet search, advertising, and curation.</li>\n<li>Experience integrating user research into product designs and design practices.</li>\n<li>Experience in survey design (ie: Qualtrics). Working knowledge of statistics and experimental design.</li>\n<li>Demonstrated understanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process. Demonstrated passion for mobile, apps or development environments.</li>\n<li>Effective interpersonal, communication, negotiation and collaboration skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Conduct independent research on multiple aspects of products and experiences.</li>\n<li>Collect and analyze user behavior through lab studies, field visits, ethnography, surveys, benchmark studies, server logs and online experiments (A/B testing).</li>\n<li>Work with Designers, Product Managers, Engineers and other UXRs to prioritize research opportunities in a fast-paced, rapidly changing environment.</li>\n<li>Understand and incorporate complex technical and business requirements into research.</li>\n<li>Advocate research findings to diverse audiences through written reports and in-person presentations.</li>\n</ul>",
    "title": "User Experience Researcher"
}