{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckeupx1-Poq8rNXm5sF6W15Ta0V7YWGLjGjd153eN8MYSOQASYQ8w7QJqgPipyLwjBqNVYe_XIHhOnKxr4jEsxsjHI27j2oqGHfV8WEjIu1Q6-91wCHHsbFrAMg%3D%3D_V2&jobTitle=Monetization+Product+Specialist+Lead%2C+Partner+Ecosystem%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-21T22:32:01.838Z",
    "description": "<p>The Product &amp; Partner Go-To-Market (PPG) team launches and lands new products, policies, and content strategies that make YouTube the world’s top destination for video. Our team of expert Product Specialists provides a unified voice for Product across several other key teams — including Surfaces &amp; Apps, Content Creation &amp; Engagement, Monetization, and Rights &amp; Content Management — as well as the Partnership Enablement team, which brings product, policy, and content strategies to market via all the partner-facing teams across Google’s business.</p><p>The Product and Partner Go-To-Market (PPG) team is focused on activating and educating YouTube consumers, content partners, and our internal operations teams. Our multifaceted professionals work together with teams throughout YouTube to address our users’ most pressing needs to be successful on YouTube. We help develop go-to-market resources for products and policies that are strategically important for YouTube’s ecosystems. </p><p>As a Product Specialist, you will serve as a product expert and end-user lead that works closely with Product Management and Engineering as an integral member of cross-functional core product teams. You will work closely with YouTube’s product and operations teams, acting as an internal product expert for operations teams internationally and collecting and analyzing data to influence product roadmaps and the prioritization of product features.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/105419800315863750",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T22:31:43.095Z",
    "publish_date": "2019-03-06T22:31:43.095Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience working with cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience managing high performing teams.</li>\n<li>Track record of successful project management, execution, multi-tasking, and delegating.</li>\n<li>Understanding and passion for the YouTube ecosystem (e.i., viewers, partners, advertisers) and products.</li>\n<li>Ability to influence others. Effective executive presence, negotiation skills.</li>\n<li>Ability to take initiative and work independently on project deliverables and within a fast-paced ambiguous technical environment.</li>\n<li>Excellent communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of high performing product specialists that work on YouTube’s highly strategic growth program.</li>\n<li>Interface and align with Product, Operations, and Content leads.</li>\n<li>Help shape product strategy, maximize growth for existing products, craft go-to-market strategy for new products, and synthesize global market feedback.</li>\n<li>Provide strategic insights and lead continuous product improvement efforts at YouTube, working closely with product and engineering teams.</li>\n<li>Work cross functionally with Product Management, Engineering, Ads, Marketing, PR, Scaled education, Operations, and Content Partnerships teams to guarantee market readiness, communications, trainings, and support for launches. Manage technical issues from the field and provide guidance on resolution to partnership teams.</li>\n</ul>",
    "title": "Monetization Product Specialist Lead, Partner Ecosystem, YouTube"
}