{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbJoDKHLBvkYBU91Uusy61fBZrVQJNHi3ff4eSEZVq8SOgCPMA3TcznFO3biT9Jg49BffjZmw9b-9vC_OJuxY-D0icyvzje5g2Ea0bXsYyrr7QwTH3Vx7r8lxWQ%3D_V2&jobTitle=Analytics+Lead%2C+Google+Play&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:09.220Z",
    "description": "<p>The core mission of the Google Play Merchandising team is &quot;Delivering the right product at the right time and the right place for the right user.&quot; The Merchandising Business Operations, Strategy and Analytics team provides the key business insights needed by the Merchandising team to optimize Google Play business globally, including monitoring the current business, understanding content and user trends, reporting results on promotional activities, evaluating new features and deep dives to identify new business opportunities. </p>\n\n<p>As an Analytics Lead on the Google Play Merchandising team, you&#39;ll combine your love of data with great business judgment and communication skills in order to develop strategies with meaningful insight from user behavior globally. You possess great attention to detail, and summarize with brevity and impact, operating in the start-up nature of Google Play. Your work will help the Google Play Merchandising team shape product development and strategic/operational decision-making, with the goal of increasing Google Play Store performance across all of our verticals: Apps, Games, Music, Movies &amp; TV, Books and Newsstand. You&#39;ll provide quantitative support, market understanding and a strategic perspective to our partners throughout the organization.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5509723959001088",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:24:02.351Z",
    "publish_date": "2019-02-27T19:43:17.637Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience working as a Business Analyst, or in a management consulting, investment banking or internet/media industry role.</li>\n<li>Experience using SQL, spreadsheets and presentation tools.</li>\n<li>Experience using statistics techniques in business context.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or similar graduate degree in a management, technical or engineering field.</li>\n<li>Experience in utilizing advanced analytics to drive complex operational and strategic initiatives, while interacting with multiple business leads or Product Managers.</li>\n<li>Ability to simplify the complex and present to an executive and stakeholder audience with varying levels of technical experience.</li>\n<li>Demonstrated problem solving and analysis skills, combined with effective business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define, develop, automate and manage relevant metrics and dashboards to support ongoing merchandising business decision-making. Set standards and relevant benchmarks on how the Google Play Merchandising organization evaluates campaigns and promotions globally, by vertical and by region.</li>\n<li>Partner with the Google Play Merchandising team to identify and lead business insight projects across the global Google Play Merchandising organization.</li>\n<li>Utilize predictive models/machine learning to execute segmentations, improve measurement and drive user targeting.</li>\n<li>Develop content for, and participate in, merchandising business reviews.</li>\n<li>Drive insights to execution. Generate business consumable recommendations, work with merchandisers to run experiments based on analyses and scale those that succeed.</li>\n</ul>",
    "title": "Analytics Lead, Google Play"
}