{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUjTQ-D5v_c1y0XWmjqbHVf9vVyWUiG0BtpwXtEOgZ0SOgCPMA3Tsx7eTBn6H3rY6M_B5DdHYPpv3DDYDXKFcsCnNlGylSxRNl9i2nWp0z9KCd9AnKS_v6o_Zvs%3D_V2&jobTitle=Web+Solutions+Engineer%2C+Legal+Online+Operations&loc=US",
    "categories": [
        "LEGAL",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-13T17:01:51.617Z",
    "description": "<p>The Legal Online Operations Strategic Workflow Optimization Research and Development (SWORD) team focuses on bringing to life innovative technical solutions. Ultimately, we enable Legal Online Operations to make difficult decisions that are transparent and minimize legal risk.</p>\n\n<p>We offer a dynamic environment with high-impact projects, the opportunity to research new technical trends and a place to find close collaborations and fast-paced decisions from colleagues. The apps, tools, services and cross-engineering team collaborations we work on are used in resolving matters related to legal rulings and optimizing workflows between web applications, case management systems and other services within the Legal Online Operations domain. \n</p>\n\n<p>Your background in web application technologies and passion for working on the most complex legal matters will help make significant impact for our users.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5037475867328512",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:49.949Z",
    "publish_date": "2019-02-27T19:52:49.949Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Electrical Engineering, Math, related quantitative field or equivalent practical experience.</li>\n<li>Experience working with web technologies such as HTML, CSS, JavaScript and HTTP.</li>\n<li>Experience with one or more general purpose programming languages, including but not limited to: Java, C/C++ or Python.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Programming experience and proficiency with backend (Python, Java) and frontend (Angular 2/ TypeScript, JavaScript).</li>\n<li>Experience planning for and managing several large-scale, interrelated, complex technical projects and coordinating technical project team members to deliver quality results within the project deadlines.</li>\n<li>Experience identifying business needs, defining and building technical solutions to address business needs in a start-up environment.</li>\n<li>Exceptional technical and project management skills and cross-functional relationship-building skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Perform implementation reviews, advocate new product features and ensure the prompt and proper resolution of technical challenges.</li>\n<li>Guarantee the technical aspects of a partner’s integration (both new and ongoing) by providing necessary documentation and technical guidance.</li>\n<li>Build new internal tools, backend services and web applications for the Legal stakeholders.</li>\n<li>Write and review technical design documents, development and collaborative code reviews with an eye for best practices and scalability.</li>\n</ul>",
    "title": "Web Solutions Engineer, Legal Online Operations"
}