{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTLjXuQ0qDNfTV9RFekzWyrxKxAv-X2eOmlJYj8c2C0SOgCPMA3Tfvw84cAfpYd5psFgro7GOGaScJLPrbh8Aqz9PcJFS_RP0bM_cuViqKJZclV10sYLlFOUzIw%3D_V2&jobTitle=Technical+Program+Manager%2C+Colocation+Infrastructure&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T21:01:41.825Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>As a Technical Program Manager, you will be responsible for the evaluation, design, and construction of Google&#39;s space in colocation facilities across the globe. You will help us evaluate, plan, design, and build new and enhanced spaces in commercial colocation facilities. We are in a continuous state of evaluation, design, and construction and need team members who can help us execute on our vision to design and build spaces that last. In this role, you will rely on diverse skills ranging among engineering, design, and program/project management to create elegant solutions.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6353721355337728",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-02-27T19:53:30.097Z",
    "publish_date": "2019-02-27T19:53:30.097Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Engineering, Mathematics, Statistics, related field or equivalent practical experience.</li>\n<li>4 years of experience managing projects in a matrixed environment.</li>\n<li>Experience with two or more of the following: server hardware and software, network hardware and software, data center infrastructure and operations, and/or mechanical and electrical systems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working on technical projects either as a Program Manager, Business Analyst, or Product Manager.</li>\n<li>Experience with any of the following: large collocation data centers, site selection for high-technology, industrial-scale projects; real estate evaluation, acquisition, development, and construction; utility agreements; energy-related issues and clean energy initiatives.</li>\n<li>Ability to design and facilitate the implementation of large scale networking data-centers and/or colocation facilities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Review and thoroughly understand Google&#39;s Network Architecture Standards.</li>\n<li>Communicate with internal business managers to collect drivers and deadlines for delivering colocation spaces and associated infrastructure.</li>\n<li>Design spaces that meet today&#39;s needs and maintain flexibility for the future.</li>\n<li>Evaluate colocation facilities to ensure they meet internal reliability requirements. Create high-level project plans that identify resource needs and critical path.</li>\n<li>Review Proposals, Costs, and Submittals related to the build of the colocation spaces. Maintain Technical Relationships with colocation vendors and contractors.</li>\n</ul>",
    "title": "Technical Program Manager, Colocation Infrastructure"
}