{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTivUP2fFu2x-LbW6_zuz_g9_LORIIiFCmJiAINEyHUSOgASYQ8wehMAP7nb3FfT_muBZKDdyqG0XgJeA36uPlsbVOhVAKB6B9f97bS_oUtgIFQWX2BbZf54eYk%3D_V2&jobTitle=Relocation+Program+Manager&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T16:01:54.177Z",
    "description": "<p>The Google People Services, Operations function is the services and program management group within People Operations that makes HR stuff easy and intuitive for Googlers. Our global team optimizes people processes, from problem definition to execution. We partner with teams across People Operations and in engineering to bring innovation and technology to the way we attract, retain and grow Googlers worldwide. We focus on providing an amazing experience to past, present and future Googlers, and work in Google’s fast-paced environment to deliver 100+ operational services, manage the contingent workforce and implement HR programs across 70+ countries. Regardless of location or level of experience, members of the Operations team have the opportunity to create, develop and implement some of the most complex global operations around the world.</p>\n\n\n<p>As a member of the Candidate Operations team, you will be responsible for ensuring prospective Googlers have an excellent experience from receiving their offer through to their first day in Google, and beyond, aligning with our culture and values. You will be focused on implementing innovative, scalable processes and providing excellent customer service in relation to central programs such as relocation, immigration, compensation and day one orientation.</p><p>Great just isn&#39;t good enough for our People Operations team (you probably know us better as &quot;Human Resources&quot;). Made up of equal parts HR professionals, former consultants, and analysts, we&#39;re the advocates of Google&#39;s colorful culture. In People Ops, we &quot;find them, grow them, and keep them&quot;. We bring the world&#39;s most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next Googler, refining our core programs, developing talent, or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80524063857877702",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-12T16:01:54.177Z",
    "publish_date": "2019-03-12T16:01:54.177Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in policy and program design.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in implementing operations design.</li>\n<li>Experience identifying and resolving complex issues, assuming leadership roles in unfamiliar or ambiguous circumstances - solid sense of accountability and sound personal judgement.</li>\n<li>Ability to work independently in a fast-paced, constantly changing environment.</li>\n<li>Ability to establish and maintain effective relationships and partnerships with key stakeholders</li>\n<li>Strong interpersonal, teamwork and organizational skills.</li>\n<li>Excellent verbal and written communication skills, with an emphasis on tact and diplomacy.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage relocation operations (program/vendor management) for all inbound new hires and transfers to or within Americas (AMS), and manage compliance and control tasks across assigned global process areas.</li>\n<li>Own and operate (in conjunction with global relocation team) the Google relocation policy for AMS.</li>\n<li>Form vision, roadmap, and goals for Google’s AMS relocation program and policy, taking into consideration immediate needs, resourcing, policy goals and long-term strategy.</li>\n<li>Utilize problem solving and ownership to solve candidate mobility and on-boarding issues proactively across cross-functional areas.</li>\n<li>Partner with diverse internal stakeholder groups on new hire and internal transfer case management (People Partners/Consultants, Global Mobility, Compensation, Global Mobility Solutions, Immigration, Tax).</li>\n</ul>",
    "title": "Relocation Program Manager"
}