{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf84gvfDvZeW33llj2rRjfzj4jwdmALZi4abPMRrN1ISOgASYQ8wYi9Px_cZuntmkqgjA6pbaFHO0FF1Iexd73dzAWtZhjYGV4qb37kFzgjiGgQzmZSkJZvtxQY%3D_V2&jobTitle=Technical+Program+Manager%2C+Privacy+and+Security&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T16:32:11.653Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.<br><br>Using your technical and leadership expertise, you run Engineering-focused projects that are well-defined under supervision.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/106488481191994054",
    "location": {
        "address_lines": [
            "Palo Alto, CA, USA"
        ],
        "city": "Palo Alto",
        "country": "CA",
        "country_code": "US",
        "display": "Palo Alto, CA, USA",
        "lat": 37.4418834,
        "lon": -122.1430195
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=1168x324&zoom=12&signature=GOsGrZ9EmFQ3uc0juSXRlav_Xl4=",
        "large_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=1024x324&zoom=12&signature=WhIGOqmPY8srQgQr1foTtlDHCuw=",
        "small_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=600x400&zoom=12&signature=clZaI6MOROjEZw8MkX1WgHhMqS0=",
        "small_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=600x400&zoom=12&signature=xx5ozNYJWlySSyqNwNprOYpuunw="
    },
    "modified": "2019-03-12T16:32:11.653Z",
    "publish_date": "2019-03-12T16:32:11.653Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical discipline or equivalent practical experience.</li>\n<li>3 years of experience in HIPAA/FDA/GDPR/Privacy compliance.</li>\n<li>3 years or program or project management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Background in regulatory compliance matters.</li>\n<li>Familiarity with Google infrastructure.</li>\n<li>Ability to build tools for compliance evaluations.</li>\n<li>Ability to write both internal- and external-facing documentations.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Plan, define and gather compliance requirements, organize and drive readiness for product launch across functional/organizational teams. Maintain, monitor and manage compliance status for all our products, systems and services.</li>\n<li>Act as an advocate for user considerations across products.</li>\n<li>Work with Tech Leads to define privacy requirements for our early stage programs, ensuring we follow best practices and regulatory guidance for clinical trials and pilot programs.</li>\n<li>Assess our systems, services and data management for compliance, work with Legal and Privacy and Data Protection Office on identifying scope, severity of the gap and any outlying requirements.</li>\n<li>Drive compliance review process with internal teams or external agencies, serve as our compliance officer for external-facing issues. Write and guide compliance related documentations.</li>\n</ul>",
    "title": "Technical Program Manager, Privacy and Security"
}