{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUHs1U3GGl3GSX5sz9l3NHd53u06FcNZfVaDVzA1TnsSOgCPMA3TZNKaMuC_h1Vh7IvmJCjTsp_N5e5SFtcJVitmadR0CLALyV1r9kthEK3A9ZMfzNQXAP2T5lg%3D_V2&jobTitle=Product+Insights+Analyst%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-13T23:01:57.628Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Google Customer Solutions (GCS) Product and Sales Activation team helps drives the overall success of our GCS advertisers by creating effective solutions to meet advertiser business needs, supporting them with strategic initiatives, and advocating for products that better address the needs of Small and Medium Businesses (SMBs).\n</p>\n\n\n<p>As a Product Insights Analyst on the Product and Sales Activations (PSA) Strategy and Operations team, you’ll develop data-driven insights across all major advertising products and features globally. \nAdditionally, you will work directly with Sales, Product, and Marketing teams to monitor the impact of new launches and programs and identify emerging trends in advertiser behavior and product usage. You’ll test new approaches focusing on how to apply features to help advertisers grow at scale. In the process, you will gain valuable global experience, working with multiple organizations, sharing discoveries, and uncovering new insights to help businesses grow.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5285631689031680",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-18T21:12:25.951Z",
    "publish_date": "2019-02-27T19:52:45.950Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience building and automating reporting dashboards, spreadsheet, and presentation tools.</li>\n<li>Experience in SQL and relational databases.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Track record of successful project management, execution, multi-tasking, delegating, and collaborating with cross-functional teams to set goals and lead through vision, clarity, and passion.</li>\n<li>Ability to synthesize data into useful formats to drive actionable insights for Product and Sales teams.</li>\n<li>Ability to get things done and work independently.</li>\n<li>Ability to understand and contribute to a long-term strategic vision.</li>\n<li>Excellent analytical, strategic thinking, and creative problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Oversee advertising products and feature-oriented data across the GCS ecosystem.</li>\n<li>Construct analyses around a specific business question, write a clear, usable project plan, and execute with minimal guidance.</li>\n<li>Run ad hoc analyses to answer pressing questions.</li>\n<li>Build and support high-level dashboards and communicate findings and strategic recommendations to management. Maintain large datasets.</li>\n<li>Work with Product and Engineering teams to build, maintain, and refine reporting architecture for specific products.</li>\n</ul>",
    "title": "Product Insights Analyst, Google Customer Solutions"
}