{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbxdHZshKSQ8OwBqJqbY1RYbRvGAkXr74CekKjuq6RESOgCPMA3T4kntBj_tH-Z5CbvuJ1KuixZ4qO7WA0X_azku5m8Iwji_4sVSGexGibFb8WtRO7Jrh09GWAw%3D_V2&jobTitle=Program+Manager%2C+Sustaining+Operations&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-09T15:31:36.898Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Program Manager for Sustaining Operations, you will join the Google Home/Nest team and be a manufacturing operations professional capable of leading country expansion initiatives and technical/quality solutions during product sustaining, ensuring production readiness, capacity, material availability, and quality issues.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5253713590943744",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:48:09.395Z",
    "publish_date": "2019-02-27T19:48:09.395Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Industrial Engineering, an engineering discipline, or equivalent practical experience.</li>\n<li>4 years of experience in the electronics/computer field.</li>\n<li>Experience with typical hardware BOMs, process documentation and assembly, test processes, and hardware operations.</li>\n<li>Experience across all phases of a product from prototype to mass production to end of life.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Industrial Engineering, Supply Chain, Operations Research, Operations Engineering, or other relevant field.</li>\n<li>Experience working with global and cross-functional internal and external teams.</li>\n<li>Ability to solve cross-functional challenges with excellent analytical skills and original equipment manufacturer (OEM) management skills.</li>\n<li>Ability to face pressure with resilience to achieve goals.</li>\n<li>Excellent analytical, quantitative, problem-solving, creativity, and strategic skills.</li>\n<li>Excellent interpersonal and written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive cross-functional teams to optimize the supply chain for specific strategic reasons, while accounting for risks and changes in schedule or demand. Drive manufacturing operational readiness in the factory, leveraging partner resources while managing ongoing efficiency and improvement across factories from ramp to end-of-life (EOL).</li>\n<li>Anticipate production and operational risk, communicate and mitigate. Work closely with OEMs to manage line bring-ups, qualification, material availability and quality issues, and secure the right level of capacity base on quarterly and weekly forecast and horizons.</li>\n<li>Lead regular meetings to communicate plans with cross-functional operations and demand planning. Adapt plans based on changing customer requirements.</li>\n<li>Coordinate with OEM factory and Operations/Logistics teams to prioritize critical shipments/orders and ensure orders ship as scheduled.</li>\n<li>Ensure OEM reporting is accurate and timely and lead Quarterly Business Reviews with partners. Manage excess and obsolescence (E&amp;O) tracking and secure destruction. Develop processes to accomplish the above responsibilities and identify improvements.</li>\n</ul>",
    "title": "Program Manager, Sustaining Operations"
}