{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Austin, TX, USA; New York, NY, USA; Seattle, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRsaAEtR57MVwMUtmoYT65yKBk-pUgijRAqUbZfTBHcSOgASYQ8wtUbgOfH4eS5dXlrNnW98h4fFZLXT49jG9nFvHEnH3vnKFgynyRC9UwaDeqYjdZerP2dYF1o%3D_V2&jobTitle=Technical+Trainer%2C+Data+and+Machine+Learning%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-14T23:31:39.973Z",
    "description": "<p>As part of the team, you&#39;ll deliver training to strategic partners, customers, and Googlers. You have excellent teaching skills and an ability to explain complex Cloud technologies in a way that engages and inspires technical professionals. You&#39;ll focus on technical training classes, and you&#39;ll also support training activities at marketing events. You will also provide feedback to the Curriculum Development team to ensure ongoing high-impact of the materials. The primary focus of this role is to deliver courses from the Machine Learning and Big Data curriculum.</p>\n\n\n<p>You&#39;ll consistently deliver excellent training experiences to all of our learners, validate the correctness of materials, set appropriate expectations before/during class, ensure learner satisfaction with the scope and depth of what is covered, and share feedback and suggestions. In addition to delivering training, you&#39;ll evaluate, audit and coach other trainers, while working towards continually improving the scale, depth, and quality of the Google Cloud Platform Training experience.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/115494723071681222",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-02-27T19:49:54.320Z",
    "publish_date": "2019-02-27T19:49:54.320Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in Computer Science, Mathematics, Statistics, related field or equivalent practical experience.</li>\n<li>5 years of experience delivering technical training in technology to customers. Experience in client-facing technical consulting/educating.</li>\n<li>Technical experience programming in Python/Java and data science (machine learning/statistics/ETL).</li>\n<li>Ability to travel up to 50% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience providing training to a diverse set of partners, customers, and audiences, including software developers.</li>\n<li>Experience with creating, maintaining, and/or delivering technical content in a fast-paced technology area.</li>\n<li>Experience mentoring technical professionals adopting new technologies.</li>\n<li>Expertise in one or more technologies, experience speaking at industry conferences, contributing to open-source projects, and authoring magazine articles/books.</li>\n<li>Ability to conduct training, both locally or virtually.</li>\n<li>Comfort with working in a growing, dynamic and ambiguous environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver technical training on Data and Machine Learning to diverse audiences (e.g., partners, customers, Googlers, etc).</li>\n<li>Support training activities at marketing events, including delivering technical classes/presentations, leading Qwiklabs sessions, assisting with our training booth, and/or serving as a TA for bootcamp sessions.</li>\n<li>Evaluate, train, audit, and coach other trainers.</li>\n<li>Provide direct field feedback to the Curriculum Development team on content being delivered and act as an expert on new content or updates to existing content.</li>\n<li>Participate in training planning conversations with strategic customers/partners and work on tailoring content for those audiences.</li>\n</ul>",
    "title": "Technical Trainer, Data and Machine Learning, Google Cloud"
}