{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSpIcx5zZ16XEEetj_fA8Dgm-Mu2SzM25e0m6O4IId0SOgASYQ8wO9wS2paLmEszJ2-_iwAINtFeXdp_evYtlAZe4h4zb2vFQFIe7VQjU4IRG-zvANzZmL5tfOU%3D_V2&jobTitle=Strategic+Partner+Development+Manager%2C+Hardware+Business+Development&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T12:01:51.419Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Equipped with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.</p>\n\n\n<p>As part of the Google Hardware Business Development team, you’ll work on sourcing and structuring complex partnerships with some of the most strategic partners across Google Hardware (e.g. Google Home, Chromecast, Pixel phones, Google Wifi, Pixelbook, etc.). You will work closely with product, engineering and finance counterparts to identify first-of-a-kind partnerships that deliver against our core business objectives, while also providing feedback on product strategy.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/135862020227375814",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-12T12:01:51.419Z",
    "publish_date": "2019-03-12T12:01:51.419Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>10 years of experience working in business development, investment banking, management consulting or a similar environment.</li>\n<li>3 years of experience working in financial or analytical role.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree, MBA, JD. or equivalent practical experience.</li>\n<li>Experience in sourcing large partnerships in innovative ways.</li>\n<li>Experience working in roles focused on hardware, digital media or entertainment.</li>\n<li>Excellent communication skills, with the ability to formulate and articulate both technical and financial elements of an agreement, and comfortable presenting to management.</li>\n<li>Self-motivated and comfortable operating in a rapidly changing industry.</li>\n<li>Ability to travel as required.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead exploratory discussions with potential partners and structure partnership agreements.</li>\n<li>Evaluate opportunities and present recommendations to the Management team.</li>\n<li>Communicate and collaborate with a broad range of constituents (e.g. Product, Engineering, Finance, Legal, Marketing, Sales and external executives).</li>\n<li>Build, maintain and evolve relationships with third parties, working directly with some partners and through “one-to-many” models to reach large partner ecosystems.</li>\n<li>Develop product plans with technical stakeholders, taking into consideration how Google can best collaborate with relevant partner ecosystems.</li>\n</ul>",
    "title": "Strategic Partner Development Manager, Hardware Business Development"
}