{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfcTZ8aZ1h2gcyo0M1EU2Jos-UcV9VQSJJfWz63w1Z0SOgCPMA3TNf_iRTjU1WHrvPAGm5pZh_rUbsco4VG9iX_BluZ-KKifh-YWfUaN0_9bT-iGBB9ZzuBG028%3D_V2&jobTitle=Program+Manager+Lead%2C+Scaled+Operations%2C+YouTube&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-13T19:32:02.717Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>As a Program Manager Lead, you will manage and be accountable for the development, scaling of content operations workflows in close partnership with one or more outsourced vendors and various internal operations teams. You will be responsible for new process and service implementation, development of operational plans, critical issue resolution, business reviews and internal operations program management. Additionally, will contribute to the long-term operational strategy and service delivery model and continuous improvements of business processes.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6282071624581120",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:03.120Z",
    "publish_date": "2019-03-07T01:32:03.120Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience managing global content moderation operations teams.</li>\n<li>Experience outsourcing business for operations teams through advanced modeling and consultation methods.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s, JD degree or equivalent practical experience.</li>\n<li>Effective analytical and structured problem-solving skills.</li>\n<li>Excellent communication and collaboration skills exhibited in complex operational setting.</li></ul>",
    "responsibilities": "<ul>\n<li>Manage the scaled solution strategy for various Trust and Safety enforcement and controversial content verticals to ensure all end-to-end operations are optimized and ready for policy launches.</li>\n<li>Be accountable for your business’s Key Performance Indicators (e.g., Quality, Service Level, Productivity) and responsible for implementing strategies that address issues and drive business success.</li>\n<li>Lead teams globally for your respective policies to develop and manage project plans that address areas of risk and other issues identified during business reviews and analyses.</li>\n<li>Identify and improve program performance metrics on a quarterly basis (e.g., Quality, SLA, Productivity).</li>\n<li>Utilize database query, analytics and reporting tools to create quantitative justifications for proposed solutions and interfacing with Product Managers and Engineering teams to negotiate support for necessary tooling and system changes.</li>\n</ul>",
    "title": "Program Manager Lead, Scaled Operations, YouTube"
}