{
    "application_instruction": "<b>Application are now closed.  If you would like to be notified when applications re-open in Fall 2019, please leave your details at <a href=\"http://g.co/airesidency/contactme\">g.co/airesidency</a><a href=\"http://g.co/airesidency/contactme\">/</a><a href=\"http://g.co/airesidency/contactme\">contactme</a>.</b>\n\n\n\n\n\n<p><b>To start the application process,</b> click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):</p><ul><p><b>1. </b>In the “Resume Section:” attach an updated CV or resume.<br><b>2. </b>In the “Cover letter/other notes Section:” Copy and paste a cover letter which <b>must</b> include answers to the following questions:</p></ul><ul><li>What are your primary research interests and why do you think they are important?</li><li>How would participating in the AI Residency help you to explore your research interests and achieve your goals?</li><li>Give an example of an open-ended research question or project you’ve worked on. What made it challenging and how did you overcome those challenges? Alternatively, summarize and critique a machine learning paper you have read that you found interesting.</li></ul><p><b>**Although cover letters are optional for most job applications at Google (as noted on the website), it is a mandatory component for this application. Complete applications (cover letters included) will be prioritized for review over incomplete applications.</b></p><ul><p><b>3. </b>In the “Education Section:” attach a current or recent unofficial or official transcript in English if you have graduated in the last three years.</p></ul><ul><li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul><b><p>*Please note that we will ask you to provide a Letter of Recommendation once you have passed the initial Hangouts interview.</p></b><br><br><b>Questions?</b> See our FAQs at <a href=\"https://docs.google.com/document/u/1/d/e/2PACX-1vQPiZGZ0w9J2NuXCVpMovzJmoUpMqfM9ZjiYuhh2ZtVu2Zp8Q6t90MJVlTL668vg1jquMuDcFYKoRYB/pub\">g.co/airesidency/faqs</a><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; Cambridge, MA, USA; Seattle, WA, USA; San Francisco, CA, USA</b>",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T21:01:44.340Z",
    "description": "<p><b>About the Program:</b><br>\nThe <a href=\"https://ai.google/research/join-us/ai-residency/\">Google AI Residency Program </a> is a 12-month role designed to advance your career in machine learning research. The goal of the residency is to help residents become productive and successful AI researchers.</p>\n\n<p>As part of this program, Residents collaborate with distinguished scientists from various <a href=\"https://ai.google/research/teams/\">Google AI</a> teams working on machine learning applications and problems. Residents have the opportunity to do everything from conducting fundamental research to contributing to products and services used by billions of people. We also encourage our Residents to publish their work externally. <a href=\"https://ai.google/research/pubs/?collection=ai-residency/\">Take a look</a> at the impactful research done by earlier cohorts.</p>\n\n\n<p><b>Please note that by applying to this job, you may be considered for all of the locations: </b><a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-1600-amphitheatre-pkwy-mountain-view-ca-4482120160&amp;\">Bay Area (Mountain View and San Francisco</a>), <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-76-9th-ave-new-york-ny-10011-usa-4438890681&amp;\">New York City</a>, <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-355-main-st-cambridge-ma-02142-usa-4428680543&amp;\">Cambridge (Massachusetts)</a>, <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-1253-avenue-mcgill-college-montr%C3%A9al-qc-4432600826&amp;\">Montreal</a> and <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-111-richmond-st-w-toronto-on-m5h-2g4-4449840128&amp;\">Toronto</a>, Canada, <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-google-building-parkview-601-n-34th-st-4446050663&amp;\">Seattle (Washington State)</a>, <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-accra-ghana-4423140666&amp;\">Accra (Ghana)</a>, <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-yigal-alon-st-98-tel-aviv-yafo-israel-4438210683&amp;\">Tel Aviv (Israel)</a> and <a href=\"https://careers.google.com/jobs#!t=jo&amp;jid=/google/google-ai-resident-2019-start-fixed-term-google-building-110-brandschenkestrasse-4437810341&amp;\">Zurich (Switzerland)</a>. Residents are placed based on interest, project fit, location preference and team needs. All are expected to work on site.</p>\n\n<p>We encourage candidates from all over the world to apply. You may have research experience in another field (e.g. human-computer interaction, mathematics, physics, bioinformatics, etc.) and want to apply machine learning to this area, or have limited research experience but a strong desire to learn more. Current students will need to graduate from their degree program (BS/MS/PhD) before the residency begins. If a candidate requires work authorization for a location, Google will explore the available options on a case-by-case basis.</p>\n\n<p>Your application should show evidence of proficiency in programming and in prerequisite courses (e.g., machine learning, user-centered interfaces or applications, data science, mathematical analysis). This can be demonstrated through links to open-source projects, notable performances in competitions, publications and blog posts, or projects that showcase implementation of one or more novel learning algorithms.</p><p>There is always more information out there, and the Research and Machine Intelligence team has a never-ending quest to find it and make it accessible. We&#39;re constantly refining our signature search engine to provide better results, and developing offerings like Google Instant, Google Voice Search and Google Image Search to make it faster and more engaging. We&#39;re providing users around the world with great search results every day, but at Google, great just isn&#39;t good enough. We&#39;re just getting started.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/135633417237603014",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:51:51.550Z",
    "publish_date": "2019-02-27T19:51:51.550Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS degree or equivalent practical experience in a STEM field such as Computer Science, Mathematics, or Statistics.</li>\n<li>Completed coursework in statistics, algorithms, calculus, linear algebra, or probability (or their equivalent).</li>\n<li>Experience with one or more general purpose programming languages, including but not limited to: Python or C/C++</li>\n<li>Experience with machine learning; or applications of machine learning to NLP, human-computer interaction, computer vision, speech, computer systems, robotics, algorithms, optimization, on-device learning, social networks, economics, information retrieval, journalism, or health care.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Research experience in machine learning or deep learning (e.g. links to open-source work or link to novel learning algorithms).\n</li>\n<li>Open-source project experience that demonstrates programming, mathematical, and machine learning abilities and interests.</li>\n</ul>",
    "responsibilities": "<ul><li>Work with research mentors to formulate research project(s) and/or novel application(s) of machine learning.</li><li>Conduct research and publish it in competitive venues.</li><li>Implement algorithms, experiments and/or human-computer interfaces using frameworks such as TensorFlow.</li><li>Learn and understand a large body of research in machine learning algorithms.</li></ul>",
    "title": "Google AI Resident, 2019 Start (Fixed-Term Employee)"
}