{
    "application_instruction": "<p><b>Applications for this role are now closed.</b></p><p>To start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):</p>\n\n\n<ul>\n<li>1. In the “Resume Section:” attach an updated CV or resume.</li>\n<li>2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.</li>\n<ul><li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul></ul>\n<br><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Ann Arbor, MI, USA; Austin, TX, USA; Boulder, CO, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA; Palo Alto, CA, USA; Pittsburgh, PA, USA; Reston, VA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA</b>",
    "categories": [
        "BUSINESS_STRATEGY",
        "FINANCE",
        "PEOPLEOPS",
        "PRODUCT_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:47:00.848Z",
    "description": "<p><b>Timeline</b></p><ul><li><b>Applications:</b> September 17 - November 27, 2018 (11:59pm PST).</li><b></b><li><b>Interviews:</b> January - April 2019.</li><b></b><li><b>Internship:</b> 11-12 weeks starting between May and June 2019.</li></ul>\n<br>\n<p><i>We will review applications and interview candidates on a rolling basis from January through April 2019. Selected candidates will be asked to complete a supplemental form where they can express location and functional areas of interest. Updates will be provided as the status of applications change in the recruiting process. Candidates will be matched with teams based on their background and interests.<br><br></i></p>\n\n\n<p><b>About the program</b>\n</p><p>Our MBA Internship Program is a paid internship that will immerse you into the tech industry on a high-impact team. You’ll enhance your skill set, be challenged with rigorous work, grow your network and drive meaningful change in our business.</p>\n\n\n<p>Outside of your core work, you will participate in a high-touch program that exposes you to Google’s business operations, connects you with interns and Googlers, and invests in your personal and professional development. You may pick up a new technical skill, while also building a relationship with a 1:1 mentor and hearing from company leadership through an exclusive speaker series.</p>\n\n\n<p>Interns will be considered for potential full-time opportunities in their host organizations based on their internship performance.\n</p><p>MBA interns are placed in teams across the business according to their background and interests. Learn more about our <a href=\"https://careers.google.com/teams/\">fields of work</a>. Here are just a few teams that interns have joined in the past:</p><p><b>Business Strategy:</b> Deliver the analytical insights our leaders use to enable us to innovate. Whether it’s identifying acquisitions and investments, monetizing strategies for products, or developing partners in emerging markets such as Africa and India, Business Strategy Googlers anticipate opportunities and execute programs critical to Google’s short- and long-term growth.</p><p><b>Finance:</b> Fuel our moonshots by devising innovative solutions to complex problems in forecasting, accounting, compliance, and project management. From advising our product teams to managing day-to-day balance sheets, you’ll help keep our business on track to meet (or, better yet, exceed) our goals.</p><p><b>Google Cloud:</b> Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p><p><b>gTech:</b> gTech is a global support and operations team, with a mission to delight our customers with care so good, it’s got to be Google. Our team is the face of Google to most of our customers, and we want their Google support experience to set new standards, just like Google’s products do. Our team cares for customers by solving problems and scaling solutions, incubating new Google products, and sharing user feedback with internal teams to influence product development. We support a wide variety of products, from Ads to Google Fi and just about everything in between, and our customers include advertisers, consumers, partners, publishers, retailers, and our own Sales Googlers.</p><p><b>Hardware:</b> Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Only one thing consistently stands in the way between our users and the world&#39;s information - hardware. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p><p><b>People Operations (POps):</b> Keep Google going and growing. Our People Operations team (known elsewhere as HR) and administrative staff are the curious and creative colleagues that anchor us to our foundations and help us shoot for the moon. The POps team lives by the mantra &quot;find them, grow them, keep them,&quot; and is dedicated to staffing, development, and a distinct and inclusive culture. Not just coworkers, we&#39;re proud Google colleagues who help our company thrive.</p><p><b>Product Management:</b> You’re a curious and collaborative visionary, someone excited about solving the hard problems in technology. Google is and always will be a company that thinks big and takes risks. Architect the future of our products by bridging engineering and business as you manage a product&#39;s full lifecycle, from strategic planning to development and launch.</p><p><b>Sales, Services and Support:</b> Turn product innovations into vital client solutions. The backbone of Google’s success, the account managers, consultants and analysts in these roles are all dedicated to top-notch client service. Whether negotiating with Fortune 500 companies, solving technical challenges for small businesses, or surfacing product ads in just the right place, we develop new business opportunities while increasing the use of our product offerings.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5168180643037184",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-02-27T19:43:31.479Z",
    "publish_date": "2019-02-27T19:43:31.479Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Currently in the first year of a full-time MBA program.</li><li>Ability to complete a 11-12 week program beginning in May or June 2019.</li><li>Have authorization to work in the United States.</li></ul><br><p>Preferred qualifications:</p><ul><li>Interest in the technology industry and Google’s business.</li><li>Demonstrated critical thinking skills and independent motivation.</li><li>Excellent project management, interpersonal and organizational skills, with the ability to drive and implement ideas in a changing environment.</li><li>Analytical skills, and ability to solve highly strategic and difficult business problems.</li></ul>",
    "responsibilities": "<ul><li>Google Interns are given a lot of responsibility and the opportunity to give a meaningful contribution to their teams. Specific responsibilities are assigned to interns at the start of the program.</li></ul>",
    "title": "MBA Intern, Summer 2019"
}