{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfwtP8B86SHsp6YY8bJLUt57GcBXxeHu4Ixj30kq21sSOgASYQ8w1EDbBwzGY427OiQwlQ4XoLML8bHkZX8usVqjkr6oH0EZnyZqJRooIXsmeBuTvkfjflQHEG0%3D_V2&jobTitle=Privacy+and+Risk+Lead%2C+Global+Business+Organization%2C+Policy&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-01T17:01:48.033Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Go-To-Market (GTM) Operations Organization is a global team that serves as the strategy, operations, and product commercialization partner to the Sales, Service, and Partnerships leadership. We are shape go-to-market priorities to accelerate growth, bring to market the next generation of Ads technolog, support execution of sales priorities, drive efficiency across our processes, and build go-to-market infrastructures.\n</p>\n\n\n<p>As a Privacy and Risk Lead, you will participate on projects that impact multiple areas of the business, being a partner to counterparts and executives across Google and delivering insights and impact through your work. Additionally, you will lead strategic projects across the Global Business Organization (GBO), leading Ads policy decisions and implementation, ensuring adherence to new and existing data privacy changes and sales policies, and working closely with Program Management, Engineering, and Google Security to assess and minimize risks. \n</p>\n\n\n<p>In this role, you will contribute experience structuring ambiguous problems, leading analytical work streams, applying sound business judgment, influencing stakeholders, and communicating complex issues effectively. Additionally, you have experience in audit/compliance and/or consulting environments and work well in fast-changing, ambiguous environments.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/78946999916733126",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-01T17:01:48.033Z",
    "publish_date": "2019-03-01T17:01:48.033Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>4 years of work experience in consulting, software, internet, and/or media industries.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience leading complex operational and strategic projects.</li>\n<li>Experience in Policy, risk and/or legal issues within ads or technology industries.</li>\n<li>Ability to present to executives and communicate with a highly technical management team.</li>\n<li>Excellent business judgment, problem-solving, and analytical skills.</li>\n<li>Excellent relationship building, collaboration, negotiation, and program management. skills.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with cross-functional leadership to define, launch, and drive policy initiatives.</li>\n<li>Assess compliance with Sales policies.</li>\n<li>Structure and execute operational and strategic initiatives by developing work plans, gathering and synthesizing relevant data, leading analyses, and developing final recommendations.</li>\n<li>Lead cross-functional, global teams to get work done. Drive recommendations through to implementation and results.</li>\n<li>Communicate findings to management and to the broader organization.</li>\n</ul>",
    "title": "Privacy and Risk Lead, Global Business Organization, Policy"
}