{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckeyq7vrsbBnodXyFi1e0wnA3hVBzP7XtnCqDl0ns9x8SOgASYQ8wiOEhLGrEpZfm_qzoOClmT5R3D-O1EbbmtulW1uVYerUgpW_thBUoWFy4Rni16usxTQ0GJ9I%3D_V2&jobTitle=Director%2C+District+Systems+and+Energy&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T19:01:41.119Z",
    "description": "<p>As the Director of District Systems and Energy for our NorCal Real Estate Development organization, you will be responsible for delivering on the vision of establishing district systems (energy, water and waste) and renewable energy strategies into our large scale, mixed use districts and office projects. These developments and their environmental performance contribute to the resilience and success of Google’s business. \n</p>\n\n\n<p>This position requires an aspirational vision that aligns with Google’s values and principles, creation of a business plan, navigating regulatory issues, communicating to a wide range of audiences the strategy, establishing an operational and ownership strategy as well as providing leadership to the exceptional teams of consultants who bring this work to life.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80309718951568070",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:25.333Z",
    "publish_date": "2019-02-27T19:50:25.333Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in the establishment of district systems and operational aspect of district systems.</li>\n<li>Experience with renewables.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience building and leading multidisciplinary teams.</li>\n<li>Experience in establishing the business case, economics, and mechanics of dealing with district systems in a mixed use environment.</li>\n<li>Experience investigating innovative new relationship models to drive better and more consistent pricing and quality relationships.</li>\n<li>Ability to prioritize evolving initiatives in a fast-paced environment, translate ideas and capabilities into unconventional solutions, and deliver effective initiatives that exceed expectations and spur market transformation.</li>\n<li>Detail oriented with the ability to produce and deliver executive presentations, produce project status reports, and communicate deliverables to all stakeholders and management.</li>\n<li>Proven vision, leadership, and critical thinking skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Oversee the vision and delivery of Google’s integrated district systems for our real estate development projects. Balance long-term vision and strategy with near term goals, bringing to the forefront industry-leading innovation, research, and data.</li>\n<li>Address key issues, including climate resilience, business resilience, and economic solutions for implementing renewable energy and district systems.</li>\n<li>Drive the business model and financing strategy for district systems with a goal of making our mixed-use precincts net positive.</li>\n<li>Build relationships with local jurisdictions and governing agencies to allow us to move forward in achieving an aspirational vision of district systems. Collaborate with stakeholders and subject matter experts.</li>\n<li>Advocate district solutions that respond to Google’s unique culture, provide leadership in developing holistic and innovative solutions that will help us realize not just the environmental but the social and economic outcomes of sustainability.</li>\n</ul>",
    "title": "Director, District Systems and Energy"
}