{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZYcttueDcBXZzFL_nQM8wRm47Gq3AuZ0BQGp0X3jdsSOgASYQ8w6hUFEyp_XSowtkn0sZswNDXoeMCZMKYZBbs5WH9dXqd6finhIlha2Kb8Zjjh5Mc4sBVsHzQ%3D_V2&jobTitle=Real+Estate+Project+Executive&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-18T18:31:42.684Z",
    "description": "<p>Google operates on a global scale, but each office seeks to emulate the same Googley feel of our Mountain View, California home base. As a Workplace Service Program Manager, you build consistent, outstanding workplace experiences around the world. You design, implement and manage Google&#39;s service offerings. You&#39;re a great communicator who is comfortable taking on complex projects with a diverse set of stakeholders. You believe that great isn&#39;t good enough. You bring an analytical mind to constantly improve the efficiency and efficacy of your projects, from building new workplace tools and applications to mergers and acquisitions. You get satisfaction from knowing your clients are happy, healthy and productive, and are excited about joining a fast-paced, collaborative team that is reinventing what a workplace can be.</p>\n\n\n<p>As a member of the Google Real Estate team, you are on the front lines of Google&#39;s physical expansion. A critical thinker, you are part of a team with a wide range of responsibilities including the design and construction oversight of our next and ever expanding offices. You will help manage spatial requirements for a workforce that is growing at fast and will ensure the job is not only done to Google&#39;s high and industry-setting standards, but also in a way that promises long-term sustainability and care for our world&#39;s resources.\n</p>\n\n\n<p>As a Project Executive, you will lead a scope of services and associated teams involved in the planning and management of Google’s real estate projects. Additionally, you will be responsible for planning/development, financial analysis/administration and design/construction oversight of new and/or expanding corporate offices across Google’s portfolio.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/116368965946483398",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-03-18T18:31:42.684Z",
    "publish_date": "2019-03-18T18:31:42.684Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Architecture, Construction, Engineering, a related field or equivalent practical experience.</li>\n<li>10 years of experience in planning, design development, project management, and/or real estate development and leadership of corporate real estate assets.</li>\n<li>Experience in corporate design/construction project management/leadership.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Architecture, Business, Construction Management, Engineering, related field or equivalent practical experience.</li>\n<li>LEED-AP certification.</li>\n<li>Experience in a fast-paced technology environment, with the ability to navigate ambiguity while driving solutions.</li>\n<li>Ability to produce and deliver executive presentations, project status reports and communicate deliverables to stakeholders and management teams.</li>\n<li>Ability to think creatively and to provide non-standard and innovative solutions. Ability to influence strategic change and initiatives where prudent.</li>\n<li>Ability to prioritize evolving initiatives effectively and translate ideas and capabilities into effective initiatives. Excellent leadership and strategic skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead all aspects of the program, concept and design development, schedule and budget management, as well as construction of Google real estate. Manage tenant improvement and build-to-suit projects and ensure that organizational cultural values are maintained and exemplified in the workspace.</li>\n<li>Engage with customers, cross-functional partners and other internal organizations, demonstrating your ability to drive consensus and compromise when needed. Communicate project information and updates to Googlers and leadership appropriately.</li>\n<li>Contribute to market specific portfolio strategy and manage and track all aspects and details of the design, schedule, budget, and construction. Contribute to and implement a multi-year master plan process and update it periodically.</li>\n<li>Work independently on difficult real estate problems requiring in-depth analysis and evaluation of business situations and manage and participate in transactions process and entitlements for the properties, as defined by the real estate strategy. Perform build versus lease and retrofit versus new construction analyses, financial analyses, budgeting, tracking and schedule management for all aspects of the project.</li>\n<li>Negotiate proper design and construction resources on each project and develop and maintain optimal relationships with external consultants and vendors through rigorous request for proposal processes. Develop and maintain optimal relationships with internal stakeholders as well as lead external consultants and vendors through Google’s process and controls.</li>\n</ul>",
    "title": "Real Estate Project Executive"
}