{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU1zang_zHg7i_D1X5Kr3fa6izTJ5d-D8X8G71_12T4SOgCPMA3TEtFhQRylueqea4DQow7xeKGymkHBQhOvdD0lYVd2AkDgNLa_nCmZI6yYGgUesy2Hh0nhvlU%3D_V2&jobTitle=Technical+Solutions+Consultant%2C+Partner+Engineering%2C+Google+AI&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:34:06.489Z",
    "description": "<p>The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You swiftly problem-solve technical issues for customers to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Google Cloud business and in bringing our product portfolio into companies around the world.</p>\n\n<p>Google AI has embarked on a mission to improve the availability and accuracy of global healthcare, measured in quality adjusted life years. This is a team has already been making positive impact in healthcare with innovative approaches to applying ML to a number of areas such as medical imaging, records, genomics and waveforms. \n</p>\n\n<p>You will have opportunities to be immediately impactful by helping engineering accelerate on two key fronts: Ingestion of (input) data for ML model creation and Integration of (outbound) inference data into partner systems. \n</p>\n\n<p>As someone who has a passion for healthcare and cutting-edge technology, this role will offer you the opportunity to work with and learn from our amazing Engineering teams while novel solutions are literally being invented.\n</p>\n\n<p>Google is setting up external collaborations to develop products jointly by being embedded with partners/testbeds. You will be a part of a Google Brain team and involves strong coordination with other healthcare focused teams across Google. You will need to be comfortable charting a path in the medical domains and will represent Google with some of the top healthcare providers around the world.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6577943784652800",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:45:19.613Z",
    "publish_date": "2019-02-27T19:45:19.613Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Mathematics or a related technical field, or equivalent practical experience.</li>\n<li>10 years of relevant work experience in managing internal or client-facing projects to completion. Experience in troubleshooting clients&#39; technical issues, and in working with engineering, sales and service teams and customers.</li>\n<li>Experience in writing software in one or more languages such as Java, Python, Go, JavaScript, C++, or similar. Experience with any of the following: distributed compute environments, application development, mobile development, big data analytics, and cloud computing (including virtualization, hosted services, multi tenant cloud infrastructures, storage systems and content delivery networks).</li>\n<li>Ability to travel 50% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in working with senior-level engineers/researchers, product and/or program managers, clinician advisors, regulatory/quality, legal, UX, BD, privacy, policy, security, and marketing to deliver new products in healthcare</li>\n<li>Experience in building partner relationships and engaging cross-functional groups. Strong strategic and entrepreneurial thinker.</li>\n<li>Experience within the healthcare and life sciences environments within public/private cloud settings.</li>\n<li>Hands-on focus in cloud storage technologies and schemes, technical solutions consulting, and partner engineering.</li>\n<li>Demonstrable expertise in driving fast paced medical software/device development and integrations in regulated areas; machine learning/biostatistics/analytics background.</li>\n<li>Excel with minimal guidance, comfortable with learning new domains and driving product direction in ambiguous environments.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage and work hands-on with partner technical representatives to bridge their existing environments and solutions with Google Brain through Google Cloud. Develop proof-of-concepts allowing partners, together with Google Engineering, to build solutions that accelerate deployments.</li>\n<li>Deliver “best-practice” advice to partners on optimizing data input pipelines and inference integration strategies by documenting partners’ enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution</li>\n<li>Program manage the gathering, organizing and sharing of feedback to/from product/eng teams (e.g. coordinate on-site UX research, simulations, trials etc.) as well as partnerships/strategy teams (e.g. surface insights on how operational insights can influence legal/Go-to-Market tactics)</li>\n<li>Demonstrate thought leadership in partner engineering at this unique intersection between large quantities and complex structure of medical datasets to become a trusted advisor to partner stakeholders</li>\n<li>Travel to testbed site(s) starting at 50% onsite at testbed sites during the first 6 months of engagement and tapering down to 25% travel as deployment matures</li>\n</ul>",
    "title": "Technical Solutions Consultant, Partner Engineering, Google AI"
}