{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Austin, TX, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeGG21NB26-7Jj8FtwhTmlZsGZcBtQhsOVTyemrcR5QSOgASYQ8w9wsP4gQkScOBZFhgML_kAZ7f0UCwXL2NbiwA0f_TJREi29UeQ20emEg4TsRZ6rJ1_KcAisQ%3D_V2&jobTitle=Technical+Program+Manager%2C+Corporate+Data+and+Analytics&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-13T19:02:31.628Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>The Corporate Data and Analytics (CorpDNA) team under Data Works is responsible for Data Architecture, Data Engineering and Reporting and Analytics technologies that empower our partners in engineering and business to deliver critical corporate functions. \n</p>\n\n<p>Our team cultivates a warm and inclusive environment. We pride ourselves on helping one-another, crossing project or task boundaries to share advice and lessons learned whether in biweekly knowledge sharing sessions or the daily camaraderie we exhibit.\n</p>\n\n<p>As part of the CorpDNA team, you will independently lead projects that involve new technologies to drive data management and analytical solutions for our partners within and outside of Corporate Engineering</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/94672036573389510",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:34.639Z",
    "publish_date": "2019-02-27T19:49:34.639Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>10 years of experience in data warehousing, business intelligence, reporting and deep analysis.</li>\n<li>5 years experience in program management.</li>\n<li>Experience in implementing Analytics and Reporting solutions like Data Warehousing, Business Intelligence as a Program Manager or Team Lead.</li>\n<li>Experience in Finance, Human Resources, or Supply Chain.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Conceptual, logical and physical data modeling and data architecture knowledge.</li>\n<li>Experience with open data platforms like Hadoop, and NoSQL databases (such as Cassandra or MongoDB).</li>\n<li>Experience working in public cloud or hybrid cloud environments.</li>\n<li>Experience in data visualization tools and techniques.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create and maintain logical and physical database designs, including management of data repository, periodic reviews and tracking of issues for future enhancements.</li>\n<li>Ensure the integrity of data under the purview of the projects, including establishing security procedures to protect and maintain the highest level of confidentiality and data security.</li>\n<li>Partner with internal teams to define and implement solutions that improve internal business processes.</li>\n<li>Maintain highest levels of development practices including: technical design; solution development; systems configuration; test documentation/execution; issue identification and resolution; writing clean, modular and self-sustaining code.</li>\n<li>Integrate third party products with internal systems.</li>\n</ul>",
    "title": "Technical Program Manager, Corporate Data and Analytics"
}