{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcoK5O_wc7GMIHWQSC6fNZJeAqk5FDnUOw1oU6Fgft0SOgCPMA3TwGQ0AwjWjqURQo5tah8uhjXI6zyr57KwJDty_GgTcQLUez_NOGyQE_IB34gGL_UB4sebb6Y%3D_V2&jobTitle=Product+Technology+Manager%2C+Google&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:32:54.429Z",
    "description": "<p>gTech’s Product and Tools Operations team (gPTO) leverages deep user, operational, and technical insights to innovate Google&#39;s Ads products into customer experiences that are so intuitive (or automated) that they require no support at all. gPTO partners closely with gTech’s Support, Professional Services, Product Management, and Engineering teams to innovate and simplify our Ads products and build the productivity tools ecosystem for gTech users.</p>\n\n<p>As a Product Technology Manager, you will be the interface between the technical support and consulting teams, and other stakeholders, such as Product Management, Engineering, and Global Sales. From design and conceptualization through to early piloting and wide-scale deployment, you will oversee the technical execution and business operations of Google online advertising, analytics and platform products. You will work on developing product and technical strategy as well as prioritize projects and resources that assist our account management teams and partners. \n</p>\n\n<p>The team collaborates with Product Management, Engineering and Sales, to proactively improve the serviceability of products by evaluating product readiness, identifying product gaps, and consolidating product feedback. We are the single point of accountability within gTech to our product and sales counterparts for the success of the product lifecycle end to end.</p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products. <br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6323202939879424",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-06T20:01:57.593Z",
    "publish_date": "2019-03-06T20:01:57.593Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Computer Science, a related technical field or equivalent practical experience.</li><li>3 years of experience in a Product Management/Commercialization, Program Management, Sales Strategy or Operations role.</li><li>Experience working with Internet technologies, such as: HTTP, JavaScript, HTML, Ajax, Flash, cookies and XML.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>5 years of hands-on experience with Internet products and technologies.</li>\n<li>Experience in technical roles with Engineering.</li>\n<li>Ability to work cross-functionally with multiple teams and stakeholders.</li>\n<li>Effective design, project management, analytical, troubleshooting, consulting and problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Improve product feature offerings by providing partner feedback to internal cross-functional teams, including Product Management, Engineering and Business Solutions teams.</li>\n<li>Design effective launch programs with partners to ensure that new products and feature releases are tested before broad-scale deployment.</li>\n<li>Perform implementation reviews, advocate new product features, and ensure the prompt and proper resolution of technical challenges.</li>\n<li>Guarantee the technical aspects of publisher integrations by providing necessary documentation and guidance.</li>\n<li>Identify, drive, and optimize the business growth from new opportunities by leveraging Google technologies.</li>\n</ul>",
    "title": "Product Technology Manager, Google"
}