{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckV4nl6uQS3QoVis_ojd87jBPJTfVoHXaRVP0Lke_hssSOgCPMA3TR7fuI1wPUBt8AEVd35rkrZW5EqPbaXQI8203b5CwQ2X__aI4MEiHo8AXUAJimeil9qL5wjQ%3D_V2&jobTitle=Product+Design+Engineer%2C+Devices+and+Services+Accessories&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:00.277Z",
    "description": "<p>As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.</p>\n\n<p>As a Product Design Engineer you&#39;ll help to reinvent the shape of electronics: balancing comfort, performance, and appearance. You will work on a team that balances these in an innovative and harmonious design that complements and enables the technology. You are comfortable working on the borders of risk, actively communicating among a team to establish a design direction, creating prototypes that prove it, and working to scale that prototype.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Only one thing consistently stands in the way between our users and the world&#39;s information—hardware. Our Consumer Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Consumer Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5491815274971136",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-12T17:01:58.859Z",
    "publish_date": "2019-03-12T17:01:58.859Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Mechanical Engineering, Product Design, or related field, or equivalent practical experience.</li>\n<li>3 years of relevant work experience in consumer or handheld product design as an owner of a wide variety of parts using different materials and manufacturing techniques (e.g. injection, compression, insert molding, sheet metal forming and casting).</li>\n<li>Experience with Computer Aided Design (CAD) tools (e.g. PTC Creo or NX) and mechanical simulation tools.</li>\n<li>Experience in the mechanical design of plastic and metal components, Printed Circuit Boards/Flexible Printed Circuit Boards (PCB/FPCB) and acoustics used in consumer electronic products.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MS degree in Mechanical Engineering.</li>\n<li>5 years of experience in consumer electronics with a focus on accessories such as; docks, adapters, mouse, earbuds, webcam, etc.</li>\n<li>Experience in shipping multiple products in a lead or principal engineer role.</li>\n<li>Experience with fabrication.</li>\n<li>Experience collaborating across project teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the design and architecture of accessory programs from concept to production, including; subsystems and individual part designs.</li>\n<li>Oversee suppliers and partners of subsystems.</li>\n<li>Investigate cause design challenges to improve designs with the goal of successfully deliver products to mass production.</li>\n<li>Design for function, reliability, human factors, manufacturability and cosmetic requirements.</li>\n<li>Travel as required up to 20% of the time.</li>\n</ul>",
    "title": "Product Design Engineer, Devices and Services Accessories"
}