{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckS2OtcrZ0D6rlxTHG9QMEJFTczLbhWDtnpUGAInF6wsSOgASYQ8wH_-hlMExch2jjzCB0JhBp8i57zBDCWLFasnrY__92a79P0ZXF8GhOy1m10NIt_zmQ0eowS4%3D_V2&jobTitle=Program+Lead%2C+Hardware+Operations&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-01T17:01:48Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Program Lead in Hardware Operations (HwOps), you will help deploy and maintain the hardware components of Google&#39;s Compute, Storage, and Network infrastructure in the most efficient, secure, and scalable way possible.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/114975796935697094",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-01T17:01:48Z",
    "publish_date": "2019-03-01T17:01:48Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Mechanical/Electrical Engineering, Physics, or equivalent practical experience.</li>\n<li>7 years of experience as a hardware testing engineer.</li>\n<li>Experience leading initiatives with new product qualification testing and validation.</li>\n<li>Ability to travel up to 20% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or Electrical/Computer Engineering.</li>\n<li>Experience as a hardware testing engineer working with complex systems and/or data center focused products.</li>\n<li>Experience in servers, storage, and networks for data center infrastructure.</li>\n<li>Experience with failure analyses and testing of electrical, mechanical, and optical components for data center infrastructure.</li>\n<li>Ability to effectively partner with cross-functional teams, including Engineering, Tech, and Product leads.</li>\n<li>Excellent organizational, communication, and project management skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with engineers to analyze trends, perform root cause investigations, and drive corrective actions for products and operations.</li>\n<li>Manage comprehensive hardware acceptance testing coverage for Google data centers.</li>\n<li>Work cross-functionally with platforms, hardware testing groups, data center operations, supply chain operations, and quality organizations.</li>\n<li>Partner with Platforms to guide a product through the different stages of product introduction, pilot, and deployment into Google&#39;s data centers.</li>\n<li>Perform hands-on data analysis and develop dashboards.</li>\n</ul>",
    "title": "Program Lead, Hardware Operations"
}