{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXAEB2BOnJUjC_-QZKhfj9FPMpFJWvg5qFhF6fevMLcSOgASYQ8wD34Y6kFqleRtYX33lak1XkUhyv5COJgsBRKNEhsZMqe9mFz4tw0Wd4d56vmdn-JOAVJd4gc%3D_V2&jobTitle=Lead+Product+Marketing+Manager%2C+Security%2C+Brand+Studio&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-07T14:31:36.120Z",
    "description": "<p>Brand Studio is a passionate team of creative thinkers and marketers. We protect and promote Google’s brand and reputation through programs, products and narrative experiences that express Google’s values in action across the world. As part of our team, you’ll define and create the visual and strategic elements that comprise Google’s brand and product identities. You’ll articulate standards that harmonize and bring a uniquely Google point of view to all of our products and communications. By embracing user insights, strategic thinking, beautiful design and provocative execution, you will create delightfully intuitive (and inventive!) experiences that will define the future of Google’s brand.</p>\n\n<p>As a Lead Product Marketing Manager, you&#39;ll focus on online security, helping users stay safe online. This means helping them understand that we never stop protecting their data and that we respect their privacy by providing data controls so they can choose the privacy settings that work for them. \n</p>\n\n<p>Whether it’s the automatic protections we build into all of our products or our efforts to collaborate with the industry to help make the internet safer. You’ll bring to the team a combination of product marketing and brand storytelling skills to communicate Google’s online security narrative to users and thought leaders alike.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/133776409744024262",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:53:55.337Z",
    "publish_date": "2019-02-27T19:53:55.337Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree, or equivalent practical experience.</li>\n<li>8 years of experience working in brand marketing.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience delivering quality outputs with tight deadlines in a dynamic environment.</li>\n<li>Track record of successfully launching large-scale integrated campaigns and leading cross-functional teams, with exception leadership and project management skills to manage these complex projects with multiple stakeholders and priorities.</li>\n<li>Demonstrated ability to think strategically about complex challenges, leading to thoughtful recommendations, action plans, and campaigns.</li>\n<li>Demonstrated ability in, and high comfort with, leading in an ambiguous, high-pressure and fast-paced environment.</li>\n<li>A passion for, or knowledge about data privacy and security considerations across the tech industry.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build Google’s reputation in online security by creating and leading large, multi-channel global activations that communicate and demonstrate our ethos and commitments to both users and key opinion formers.</li>\n<li>Help shape, position and launch new security features in communications as well as in our own products</li>\n<li>Be the key day-to-day POC, collaborating with cross-functional team members across numerous Product teams, Policy, PR, and regional marketing teams to ensure alignment and clear communications around these sensitive topics</li>\n<li>Define creative requirements and manage the creative development process from brief development through creative concepting to launch across a wide variety of execution formats</li>\n<li>Manage a small team</li>\n</ul>",
    "title": "Lead Product Marketing Manager, Security, Brand Studio"
}