{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcqUZZD1AYZEpHM5fDsJKyjo3PQN7CPJqGCPT1OVRMQSOgASYQ8w4UfTc9dGIROErhr6sbdjlJQSXPMprrM-UlUeLIWsgIglDCPyVIRMtX_6pK1Qv9qTGo3lZdc%3D_V2&jobTitle=Strategic+Partner+Lead%2C+Broadcast+and+Media+Partnerships&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-28T14:01:45.960Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As Strategic Partner Lead focused on Entertainment and Media, you&#39;ll manage existing relationships, drive new business across our Broadcast and Media partnerships and become the face of Google to these partners, representing the breadth of solutions provided to the TV segment, including; distribution solutions, subscription services and ad platforms. Your primary focus will be to structure and close new partnerships that leverage Google’s video, display and mobile advertising serving and monetization platforms. \n</p>\n\n\n<p>You will anticipate how decisions are made, understand the details of individual campaigns, and persistently explore and uncover the business needs of your key clients. Additionally, you will work with the Partnerships leadership team and cross Product Area Leaders to drive cross Google engagement and help deepen our relationships with our Partners’ C-level executives by leading overall partner strategy, shaping and executing on joint business plans, and managing complex agreements.</p><p>Google’s Global Partnerships team powers extraordinary user experiences through meaningful partnerships. We build relationships that solve users’ needs, advance our partners’ goals, and further Google’s mission. Our team provides solutions for a range of partners — from helping publishers and developers grow their businesses through monetization solutions, to helping our long-term partners anticipate and navigate change in a way that delivers economic and reputational value. We build and distribute Google products through partnerships across a multitude of product areas, including Search, Assistant, Geo, News, Travel, and more. We collaborate across Google, ensuring a coordinated approach when engaging with our most complex and strategic partners.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/76499957332222662",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-12T16:32:14.846Z",
    "publish_date": "2019-03-12T16:32:14.846Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of relevant work experience, including 5 years of related sales, account management, strategy or business development experience.</li>\n<li>C-level relationship management and presentation experience.</li>\n<li>Experience in structuring agreements.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or JD degree.</li>\n<li>Project management experience and a demonstrated track record of effective business development, relationship management and strategic planning.</li>\n<li>Presentation experience including experience in delivering effective sales presentations, industry panels, and conferences.</li>\n<li>Understanding of media industry key platforms and trends (e.g. video, CTV, OTT distribution) and the online advertising ecosystem (e.g. ad serving, ad exchanges).</li>\n<li>Ability to discuss contracts, interpret legal documents, and work with attorneys to complete agreements.</li>\n<li>Demonstrated analytical ability, including the ability to analyze complex business opportunities across multiple product areas.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop renewal and product upsell strategy, discuss term sheets, manage internal approvals process, contract development and compliance processes. Develop deep understanding of partner’s business, priorities and work with Google leaders on overall partner cross-Google engagement strategy.</li>\n<li>Lead c-level engagement efforts, and support the Account team on strategic partner management, as needed. Lead the strategy for your partners, aligning a team of account managers to drive complex, strategic transactions across multiple Google product areas.</li>\n<li>Optimize our opportunities and relationships with top tier Broadcast and Cable network partners. Analyze data trends and client performance, develop solid strategic sales plans, and prepare and conduct strategic sales presentations.</li>\n<li>Collaborate with Google’s video leadership team on industry trends and development needs.</li>\n</ul>",
    "title": "Strategic Partner Lead, Broadcast and Media Partnerships"
}