{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUuWmle5DceWfQNWrCCUaLr81ZjLnrRNGClYymKAEYwSOgCPMA3TnkHURjuOe02EJpwQ19eiWQ65cq1ll5xhDYz6ptL8f69CauO7HXpeogYxYfy7MxbBo2Yek9U%3D_V2&jobTitle=Technical+Program+Manager%2C+Android+TV&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:47.531Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>Android TV is doing for TVs, what Android did for mobile - it&#39;s helping revolutionize the smart connected home by providing a platform for the living room that enables a thriving ecosystem for device partners as well as content developers.\n</p>\n\n<p>The Android TV platform is being adopted globally with TV manufacturers and operators. The critical element of TV is media — You can come in and align the media strategy across the company and help us execute across all our partner and internal programs, leading to the rapid deployment and enablement of our content partners to get reach and engagement on TV. Join us in rethinking how the TV experience should be in the living room.</p><p>Making the world&#39;s information universally accessible and useful doesn&#39;t stop at the desktop. The Mobile team builds tools to get you the information you need no matter where you are. Android has become the world&#39;s most popular mobile ecosystem, powering billions of devices, from smartphones to tablets, watches to TVs and everything in between. Whether adding to the core Android experience, forging new markets for digital content, creating immersive and portable versions of our products or managing relationships with a global community of developers, the Mobile team is giving you Google on the go.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4946521810468864",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:42:17.496Z",
    "publish_date": "2019-02-27T19:42:17.496Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or Electrical Engineering or equivalent practical experience.</li>\n<li>10 years of cross-functional Program Management experience working among several groups such as: Engineering and Design teams.</li>\n<li>10 years of experience in release management, test engineering or release engineering experience with one or more of the following: Python, Java, C, C++, JavaScript, web-development, distributed systems or mobile coding experience.</li>\n<li>5 years of technical hands on leadership and people management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>BS/MS Computer Science degree.</li>\n<li>10 years as a TPM or PgM.</li>\n<li>Release management, test engineering, or release engineering experience.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define and execute on processes to improve iteration rate and predictability of features requiring collaboration with vendors and partner OEMs.</li>\n<li>Identify and drive efforts to reduce influx of bugs due to regressions.</li>\n<li>Define and execute a process for managing Android media features.</li>\n<li>Work closely with Google engineers, QA, Engineers, and Release Engineers both locally and remotely, to resolve media issues. Design and implement processes that scale.</li>\n<li>Manage schedules, team deliverables, and communicate status to stakeholders. Identify areas of improvement in our releases, and our processes; define the problem, work with others on the solution, and follow-up on results.</li>\n</ul>",
    "title": "Technical Program Manager, Android TV"
}