{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Redwood City, CA, USA; Los Angeles, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQAphv42jugFJIOlPOCdv97l9o0C3b6kgLqi7BeD3x8SOgASYQ8wAp4b3Gjb99_iZDUmdRUw8bFUbA0eH3Gvk0dd1oYr7nObE_kfWNeOImCSjCcocVqFj86uA9U%3D_V2&jobTitle=Platform+Partner+Manager&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-18T14:01:42.945Z",
    "description": "<p><b>This role may also be located in our Playa Vista, CA campus.</b></p><p>Our clients&#39; needs are constantly changing, and so our products need to change with them. Strategic Partner Developers serve as our consultants to our customers, using research and analytics to build long-lasting relationship with our top partners. Your expertise of Google&#39;s products and our partners&#39; businesses allow you to identify new opportunities for their growth, launch new products, and expand the impact of our clients&#39; work. You possess strong relationship-building skills and are apt to work effectively with Google&#39;s partners, in order to best represent our users, products and programs and drive growth.</p>\n\n<p>As a Platform Manager, you will be responsible for building, influencing and growing relationships with Ecosystem Enablers who primarily provide a technology layer to operationalize elements of the google ad experience. You will work with these partners to help build their capabilities and capacity to advance their value proposition to the market by improving customer’s experience and performance with our ad products.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/90554907766989510",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-01T03:31:42.008Z",
    "publish_date": "2019-03-01T03:31:42.008Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>8 years of related experience.</li>\n<li>2 years of related partner management, technology-related commercial projects, product management, or consulting experience.</li>\n<li>Ability to travel up to 20% of the time to meet with internal stakeholders and external partners.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working as an engineer and/or product, technical/product specialists.</li>\n<li>Knowledge of Google Ads API and Google Ads product knowledge.</li>\n<li>Familiarity with AdTech industry and business models.</li>\n<li>Ability to define and structure internal support models to achieve plan.</li>\n<li>Ability to lead and manage multiple projects with a broad range of internal and external constituents simultaneously and the ability to think strategically about complex challenges and develop thoughtful recommendations and action plans.</li>\n<li>Comfortable working in a matrix organization and building consensus; driving toward results.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Leverage monetary and other resources to influence platforms to adopt Google recommended solutions. Resources that will help new partners to identify right Platform-Partner fit.</li>\n<li>Work with internal stakeholders to address any API migration, T&amp;Cs, or related escalations.</li>\n<li>Develop strategic business plans for the partners with eye toward identifying creative initiatives and ensuring partners are fulfilling the plans.</li>\n<li>Engaging with cross-functional teams like Marketing, Sales Engineering,,Product etc toward common goal of partner success.</li>\n</ul>",
    "title": "Platform Partner Manager"
}