{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSiIqPBJGx9Z4b33Nok2tLlYgQpwnZLi3hE6ztw9V5gSOgASYQ8wCOv9AtdLYrQaoSRC9FodGTEIK120mEBsZeJ9YUm6QtFINf45mCMMQZ0_P3gx92xOtz76B-Q%3D_V2&jobTitle=Strategy+and+Operations+Manager%2C+Global+Marketing&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-07T21:01:43.818Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>In this role, you will be part of Global Marketing at Google, an increasingly important driver of business success for the company across all products. Strategy and Operations is a core SWAT team of business thinkers who support the Chief Marketing Officer in setting global strategy, building the operational capabilities to scale with a rapidly growing function, and optimizing business growth. Your role is part Chief Strategy Officer, part Chief Operating Officer, and part Chief of Staff. You will work with teams and collaborate cross-functionally with key leaders across Marketing, Product, Finance, and Sales to solve our toughest challenges, lead high priority projects, and drive greater operational excellence.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87676567250969286",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:49:26.425Z",
    "publish_date": "2019-02-27T19:49:26.425Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>8 years of experience developing strategy for marketing organizations or management consulting firms.</li>\n<li>Experience with quantitative analyses.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s, or Phd.</li>\n<li>Experience in an analytical role and communicating findings to management.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>Excellent business judgment.</li>\n<li>Excellent problem-solving skills.</li>\n<li>Excellent written and verbal communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage and play a leading role in annual strategic planning globally, including budget and headcount processes. Coordinate quarterly executive management deliverables.</li>\n<li>Drive and support critical strategic projects for individual products and across the Marketing organization.</li>\n<li>Lead and oversee data-driven initiatives to support Global Marketing strategy. Develop a perspective on how to continuously improve marketing impact.</li>\n<li>Identify and incubate key marketing operations processes to improve overall organizational efficiency and effectiveness</li>\n</ul>",
    "title": "Strategy and Operations Manager, Global Marketing"
}