{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRmel_Qx_x-EVbt-WhIEDmXW4YHMeEr8ccuPeYPN-hgSOgCPMA3T4CqlD5DcPDoFXuWOkxYu_BEjA44rfMipjo6q5WMlOnP8GyNaA2eX6ogjWszk7F7Vp6EYXSo%3D_V2&jobTitle=Program+Manager%2C+Process+and+Systems%2C+Consumer+Hardware&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-28T17:31:55.576Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>The Process and Systems Team within the Consumer Hardware Supply Chain organization is responsible for developing transformative supply chain processes and systems centered around end-to-end planning and logistics. You&#39;ll have expertise in supply chain processes and systems, enabling them to develop solutions that scale. You&#39;ll partner with Demand and Supply Planning, Supply Chain PMO, Sales, Finance, Logistics, and regional teams in architecting scalable end-to-end processes and developing requirements and roadmap for planning and fulfillment systems.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4805823553142784",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:37:37.319Z",
    "publish_date": "2019-02-27T19:47:20.899Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Engineering, Operations Research or similar field, or equivalent practical experience.</li>\n<li>5 years of experience in managing cross-functional projects.</li>\n<li>3 years of experience in process design.</li>\n<li>3 years of experience in supply chain planning or related field.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Engineering, Operations Research or similar field.</li>\n<li>5 years of experience in a Supply Chain Planning domain.</li>\n<li>Experience in developing and landing end-to-end Supply Chain Planning systems and demonstrated ability to lead complex operational projects with a cross-functional team.</li>\n<li>Effective communication, project management and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with functional teams across Supply Chain Planning towards architecting scalable processes that align with business goals.</li>\n<li>Develop and align on comprehensive business requirements towards automating and scaling critical processes.</li>\n<li>Partner with IT teams towards building a cohesive roadmap of system solutions and features that align with process evolution and business goals.</li>\n<li>Manage the development throughout the lifecycle in partnership with IT teams, driving trade-offs and alignment between business requirements and system solutions to ensure smooth landing and adoption for maximum business impact.</li>\n<li>Define and execute change management and adoption plans for systems and process changes within the Consumer Hardware organization.</li>\n</ul>",
    "title": "Program Manager, Process and Systems, Consumer Hardware"
}