{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckS4J1JJlr3bplMkF8NrXuHo1bQ0trbf6Xj0XJU0_iPASOgCPMA3T4YdX7Gt3B1KFg9oULN_PARcwxNLY_JJfjjyvE-CTXr5hfn_oFo99SudYJ7e2mkCcEyUtDlU%3D_V2&jobTitle=Manufacturing+Test+Development+Engineer&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "MANUFACTURING_SUPPLY_CHAIN"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:12.779Z",
    "description": "<p>Google&#39;s custom-designed equipment makes up one of the largest and most powerful computing infrastructures in the world. The Manufacturing Operations team is responsible for providing the manufacturing capability to deliver this state-of-the-art physical infrastructure. As a Manufacturing Engineer, you evaluate the product designs and create the processes, tools and procedures behind Google’s powerful search technology. When vendors build parts for our infrastructure, you’re right there alongside ensuring manufacturing processes are repeatable and controlled. You collaborate with Commodity Managers and Design Engineers to determine Google’s infrastructure needs and product specifications. Your work ensures the various pieces of Google’s infrastructure fit together perfectly and keep our systems humming along smoothly for a seamless user experience.</p>\n\n<p>As a Manufacturing Test Development Engineer, you will be responsible for the manufacturing test strategy and associated implementation with our vendors and contract manufacturers. You will evaluate the product design and create the process, tools, and procedures to properly test our products and systems in volume manufacturing. You will collaborate with the Product Design team, along with Hardware Engineering and Manufacturing to determine test requirements, to establish test methodology and to test fixture implementation. In this role, you&#39;ll help drive the strategy and approaches we use for testing Google&#39;s most critical infrastructure for compute, accelerators, networking, power, cooling, and monitoring systems.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6428775577485312",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:44:10.414Z",
    "publish_date": "2019-02-27T19:44:10.414Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS Degree in Electrical Engineering, Computer Engineering or Computer Science, or equivalent practical experience.</li>\n<li>5 years of experience in manufacturing or product validation test development with an emphasis on servers and data center infrastructure.</li>\n<li>4 years of experience working with Python, Go, or C/C++.</li>\n<li>1 year of experience in working in manufacturing environments.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>8 years of experience in manufacturing or product validation test development.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop test software and automating tests. Manage the development of test fixtures, test software and integration into the manufacturing flow.</li>\n<li>Enable the Contract Manufacturer (CM) by developing appropriate factory training and facilitating associated trainers. Improve factory test methods and instructions, maximizing efficiencies with factory tooling design and implementation.</li>\n<li>Help scale the deployment of associated initiatives by identifying and isolating manufacturing defects in our critical infrastructure prior to deployment.</li>\n<li>Conduct test development in Python, develop new test strategies and platforms, analyze new rack and computing configurations and create test plans for new product introduction.</li>\n<li>Conduct code reviews, debug test failures, and develop and deploy the tests and validations that will be used for Google&#39;s server platforms, accelerators, and machine racks.</li>\n</ul>",
    "title": "Manufacturing Test Development Engineer"
}