{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSwDhppE87lDrtNZp8Yyv1ehBIPNp1K3_YsRP6XR9bESOgASYQ8wfHFeo6zWegHPv-Euh59nGcdBq-lJCi-ShGcBwXHUnpGgo-1FOTUviauGvxAShQzIJLy7H5Y%3D_V2&jobTitle=Global+Product+Lead%2C+Strategic+Migrations+and+Reporting&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T21:01:46.241Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Google Customer Solutions (GCS) Product and Sales Activation Performance team is responsible for commercializing performance advertising solutions for small- and-medium-sized businesses globally.\n</p>\n\n<p>Our mission is to enable GCS growth by allowing customers to achieve the most value from our products today and shaping our products for tomorrow.\n</p>\n\n<p>Our team is responsible for driving sustainable growth and product adoption. We identify opportunities through data-driven analysis, developing business cases for those opportunities, build consensus with stakeholders across multiple organizations (Sales, Product, Marketing), and program manage these cross-functional teams to drive GCS advertiser success.\n</p>\n\n<p>In this role, you will represent the GCS business in both managing strategically significant product migrations and also global product leads for Google Ads reporting.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/101105522310030022",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:55:52.486Z",
    "publish_date": "2019-02-27T19:55:52.486Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of relevant work experience.</li>\n<li>Experience with project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of experience in Sales Operations, Digital Advertising Account Management/Strategy, or Management Consulting.</li>\n<li>Excellent project management skills, with a proven ability to form working groups, manage, and stay on track to ensure deliverables are met.</li>\n<li>Ability to set a goal and vision for a cross-functional team and translate this into tactical quarterly goals.</li>\n<li>Demonstrated problem solving and analytical skills in SQL, combined with excellent business judgment.</li>\n<li>Excellent communication skills, confident in presenting updates to senior-level audiences and communicating with highly technical management and product teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the migration process from end-to-end, leveraging relevant data to set the strategy. Utilize stakeholder management skills to ensure a smooth migration.</li>\n<li>Utilize a deep understanding of both internal and external factors in order to coordinate and manage executive briefing documents and deliverables.</li>\n<li>Gain an understanding of the Google Customer Solutions business, both internally and externally, in order to represent GCS accurately to product and engineering teams.</li>\n<li>Work with the wider Product and Sales Activation team to ensure customer and seller feedback is incorporated into our Google Ads reporting.</li>\n<li>Be a visionary who understands and communicates the big picture, while also grasping, anticipating, and solving for problems along the way.</li>\n</ul>",
    "title": "Global Product Lead, Strategic Migrations and Reporting"
}