{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdKbc7RCzGFloibuJL567b_KdKeteogpICcnp-fD_iMSOgASYQ8wZtGcZEoYz0enyhdGUPtXlispSGJBaQ0S_RsALL_6UXzQmRDzIE2mfFia1h3u99hEX6croxM%3D_V2&jobTitle=Technical+Field+Readiness+Lead&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T17:31:51.928Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>Google Cloud leads in technologies that help teams work together and companies innovate faster with the scale and security of Google infrastructure. Ensuring continued success with these technologies requires management of tools and processes, and the enablement programs that will drive rapid, consistent, and scalable support (e.g., on-boarding, education, certification, training, etc.). \n</p>\n\n<p>As a Technical Field Readiness Lead, you will join the Google Cloud Learning and Enablement team, contributing your experience, organizational skills, and your ability to build and scale training and readiness programs. You will be responsible for defining the technical framework for training and readiness for existing and new Google Cloud Platform Products and Services. This framework will include defining the training requirements for technical field roles (i.e., Sales Engineers, Consultants, Customer Success Managers, Solution Architects, etc.), creating the content strategy, and delivering key modules for the readiness program. Additionally, you will leverage contacts in Marketing, Engineering, Product Management, Developer Relations, Sales, and field stakeholders to ensure field technologists are well-equipped with the necessary skills, experience, and knowledge. In this role, you will rely on excellent written and verbal communication skills, while working closely with Marketing to drive planning and execution of key events and conferences for internal and external technical audiences.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/122962271174304454",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-19T17:31:51.928Z",
    "publish_date": "2019-03-19T17:31:51.928Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of experience in Sales/Customer Engineering or Professional Services.</li>\n<li>2 years of experience with cloud technologies in any of the following: distributed compute environments, cloud-native application development, hosted services, storage systems, remote Linux/Unix system administration, or content delivery networks.</li>\n<li>Experience writing software in one or more languages such as Python, Go, JavaScript, Java, C++, or similar.</li>\n<li>Ability to travel domestically and internationally up to 30% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor’s degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience.</li>\n<li>2 years of experience in Training and Enablement with increasing influence and responsibility.</li>\n<li>Ability to think strategically and take broad concepts and vision to develop and effectively execute on structured plans, actions, and measurable metrics.</li>\n<li>Ability to develop and manage relationships at all levels without direct authority.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Perform detailed needs assessments in coordination with the Field, Marketing, Engineering, Product Management, and Developer Relations teams. Translate business/technical needs into training offerings and programs.</li>\n<li>Deliver technical training for onboarding and ongoing enablement to technical field audiences.</li>\n<li>Oversee the development of technical training content by partnering with curriculum development teams, product managers, vendors, and/or other subject matter experts. Assist in the development of the master plan and calendar for field enablement activities throughout the year.</li>\n<li>Plan and execute key enablement events and conferences with the appropriate pre and post-event activities to drive learning and retention.</li>\n<li>Design, implement, and assess metrics to measurement of training programs’ impact, effectiveness, appropriateness, and utility. Measure and report on the effectiveness of technical enablement investments.</li>\n</ul>",
    "title": "Technical Field Readiness Lead"
}