{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckedDdO7cEAv5K_rDAIwVVQivX9j1FFQ9G_tB2tecvPUSOgASYQ8wK9X5PstMN5mZjUG0QtXGDm6127NyrunkgDZlb9Mv-2UkU5_KE0dH3k0IfoSlpvcohWsRMuo%3D_V2&jobTitle=Finance+Manager%2C+Data+Center+Operations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-21T22:01:38.910Z",
    "description": "<p>Financial Analysts ensure that Google makes sound financial decisions. As a Finance Manager, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Excellent at working on multiple projects at a time, you are focused on the details while finding creative ways to address big picture challenges.<br><br>You are both a manager and a mentor, providing financial leadership and analytical support to partners of the core Finance team as well as giving your own team the support they need to become financial gurus. You&#39;ll keep management informed on key financial metrics and work to improve financial operation practices throughout your region.</p>\n\n\n<p>Google Cloud helps organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.\n</p>\n\n\n<p> As the Finance Manager of Google Cloud Data Center Operations, you will leverage your finance and operations experience to influence executive leaders regarding investments in Google Cloud’s infrastructure. You will lead a broad scope of initiatives and project teams to help plan and manage Google Cloud’s compute and storage capacity. You will lead a team of finance professionals and partner with the broader organization in a matrix team structure to identify opportunities.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/110224528690291398",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:56:41.384Z",
    "publish_date": "2019-02-27T19:56:41.384Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Economics, Statistics, a related field or equivalent practical experience.</li>\n<li>10 years of experience in financial analysis, financial processes, and business strategy.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>People management experience.</li>\n<li>Project management experience and a track record of leading complex cross-functional projects.</li>\n<li>Knowledge of tech industry.</li>\n<li>Ability to create and foster cross-functional networks and to manage without authority.</li>\n<li>Effective communication, interpersonal, problem solving and analytical skills, combined with effective business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Amplify investment decisions based on financial metrics.</li>\n<li>Partner with Sales teams to develop near- and medium-term demand and capacity requirements.</li>\n<li>Identify opportunities and drive execution plans to expand gross margins. Develop unit cost metrics to be used for pricing and margin analysis.</li>\n<li>Drive system automation efforts for key financial metrics. Add your insight to provide executive leadership with a view of the business by product, location, etc.</li>\n<li>Implement asset tracking module to be able to associate business growth generated with compute and storage infrastructure utilized.</li>\n</ul>",
    "title": "Finance Manager, Data Center Operations"
}