{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZvuIjRbXxXtzMoUyxOOdoETllWT85Sh2XR4Lqls1MASOgCPMA3TVWfoz9JhcKnD0zreSMimaVWjsUsVsFA3eOCrxRW5dG05fu0SoDoEWMKFyzmbIS8xgT73H4o%3D_V2&jobTitle=Digitization+Operations+Technical+Specialist&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:36:57.085Z",
    "description": "<p>At gTech’s Users and Products team (gUP), our mission is to help users get the most out of Google. We represent the voice of Google&#39;s users and many of our partners globally, sharing insights with the larger Google organization to enable exceptional customer and product experiences. <br><br>gUP builds innovative solutions that take user experience and engagement with Google to the next level, supporting users across products, countries, cultures, incomes, and identities. We advocate for users through partnerships with product areas at Google (and some Alphabet businesses), supporting Google’s consumer products ecosystem and enabling numerous launches for Google’s consumer products each year. <br><br>We are committed to building an ever more diverse, equitable, and inclusive gUP, and consider this the foundation upon which individual, team, and user success are built. We&#39;re also committed to innovation not only in the content of our work, but in the way we work. Check out <a href=\"https://rework.withgoogle.com/blog/googles-algorithm-powered-internal-job-marketplace/\">this blog post </a>on our Chameleon program.</p>\n\n<p>The Digitization Services team&#39;s mission is to: “Unlock the world’s offline information through digitization at any scale.” We provide partner management, subject matter expertise and management of various digitization operations in support of multiple Google product areas. We support innovative products like Google&#39;s visionary Book Search project and other scanning initiatives for Google Arts and Culture, YouTube and Google Brain.\n</p>\n\n<p>Our team works with a multitude of internal and external partners to create assets that users can interact with on various Google properties. Specifically, we plan, set up and manage industrial-scale facilities dedicated to digitizing various items. We also develop and manage processes for moving those items between our scan centers and partners. \n</p>\n\n<p>As a Digitization Operations Technical Specialist, you will build and maintain custom software and hardware solutions used for digitization of various materials, automate and develop tools used by the operations team and provide in-depth analysis and insight into technical issues and opportunities.\n</p>\n\n<p>This job entails working with various operations and engineering teams to maintain technical infrastructure, design new tools, automate data analysis, optimize processes and use the latest of Google&#39;s internal technologies to build needed business intelligence. You should possess a mix of technical strength and drive to challenge the status quo. You will work closely with other support and software engineers and operations teams.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6279425752367104",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T22:53:55.712Z",
    "publish_date": "2019-02-27T19:43:07.335Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical field or equivalent practical experience.</li>\n<li>Linux/Windows systems administration experience.</li>\n<li>Experience with one of the general purpose programming languages including but not limited to: Bash, JavaScript, PowerShell and Python.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Linux/Windows administration experience in lab environments.</li>\n<li>A history of delivering technical solutions to business problems in a semi-autonomous work environment.</li>\n<li>Strong communication and collaboration skills exhibited in complex operational setting.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design, implement, test and launch internal tools and technical infrastructure.</li>\n<li>Maintain existing software and hardware infrastructure in on-site and off-site scan center environments.</li>\n<li>Provide security, monitoring and patch management for scanning infrastructure including third-party equipment.</li>\n<li>Analyze work processes to determine inefficiencies and opportunities for automation.</li>\n<li>Collaborate with a global team of support engineers, software developers and operations staff to support a wide range of projects.</li>\n</ul>",
    "title": "Digitization Operations Technical Specialist"
}