{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckchwBtVYPxCgirOaTWHz23Qet87pmekHmk_p3SdoCpESOgASYQ8wqFds0nZOhLEC63Qb2y_Pjo8E6ju35jmkEEUxuRjCQYkttxzFw3hXhjYqlbxNhQ0-HI5eWEk%3D_V2&jobTitle=Master+Data+Management+Program+Manager%2C+Cloud+Business+Transformation+Organization&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-14T19:31:27.764Z",
    "description": "<p>The Cloud Business Transformation Organization is responsible for programs that enable Google Cloud to go to market enterprise ready and at Google scale. Our team partners with Product, Sales, Engineering, and other cross-functional partners to develop systems, tools, and processes. We empower our sellers and channel partners with the tools and data they need to be more productive and successful. </p>\n\n\n<p>As a Master Data Management Program Manager, you will be part of the team to create the architecture and implement Master Data Management (MDM) solutions to identify sources-of-truth for multiple data domains across various business functions. In this role, you will drive the single source of truth across multiple systems, manage and govern data pipelines to facilitate key metrics reporting, and develop solutions to enable data-driven decisions for the growth of Google Cloud business.\n</p>\n\n\n<p>In this role, you will operate within a matrix environment, managing multiple stakeholders, and program managing Master Data Management (MDM) projects for creation and maintenance of Customer MDM hub, Product MDM hub, and Individual MDM hub potentially expanding to other areas. You will work closely with Google Cloud business stakeholders, business data leaders, business process manager, and Google Cloud&#39;s Engineering teams to gather/analyze/prioritize data requirements, define roadmaps for execution, lead functional and process design, lead prototyping/testing/ training, perform impact analysis, and establish the procedures, processes, and policies for creation/change of master data. Additionally, you will work with the data lead to work cross-functionally with Product teams and conduct appropriate organizational change management to ensure the team and the extended community are trained and executing per policy.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/138255661738664646",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:14.508Z",
    "publish_date": "2019-02-27T19:54:14.508Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Experience with Informatica MDM/data quality solutions and/or other MDM vendors.</li><li>5 years of experience in an MDM role, designing and creating the architecture of MDM solutions, data modeling and/or, business data analyses.</li><li>Master Data Domain experience in one or more of the following data domains (e.g., Product, Customer, Individual, Vendor).</li><li>Experience in data analysis and database querying (SQL).</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in the industry, designing, building, managing sales and marketing MDM solutions</li><li>Experience with data governance concepts and processes. Experience and knowledge of metadata management and tools.</li><li>Experience managing and overseeing vendors, contractors, and temporary workers.</li><li>Experience applying data mastering principals or working in reference data management.</li><li>Experience in systems implementation, including data migration and data integration processes.</li></ul>",
    "responsibilities": "<ul>\n<li>Manage all aspects of program deliverables from project inception to full lifecycle implementation, vendor resource oversight, and status reporting for strategic and tactical MDM initiatives working with key internal stakeholders.</li>\n<li>Serve as a liaison between Business, Functional areas, and Engineering to ensure that Master Data related business requirements are clearly defined, communicated, well understood and considered as part of operational prioritization and planning.</li>\n<li>Work closely with all levels of the organization including educating on master data issues and opportunities, communicating the impact on complex integrated business processes, and establishing the master data quality metrics and goals.</li>\n<li>Work with business partners and related data leaders/data managers to ensure requests for master data maintenance and updates are properly authorized and approved. Partner with the Engineering teams to monitor, set up service level agreements (SLAs) and manage the MDM tool support for the business.</li>\n<li>Work with business stakeholders for prioritization and subsequently the Engineering teams on tools roadmap for reference and master data. Manage multiple project schedules and make complex tradeoffs as part of the PMO to deliver the best outcome.</li>\n</ul>",
    "title": "Master Data Management Program Manager, Cloud Business Transformation Organization"
}