{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSGSnKVk4vViQsJtu8uY-f6KWVMyxb-H9yqaJyFQxU8SOgCPMA3T0SN2o5jfBv3EZvNZHwxNixopyF88QAhwBEF9sG-O2hxy7hZRd-w7_moJ4mkHt4JfwXm_elg%3D_V2&jobTitle=Technology+Auditor%2C+Internal+Audit&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:02:47.576Z",
    "description": "<p>Internal Audit‘s mission is to protect and enable growth across Alphabet, Google and our Bets with objective, practical insights. We do this by monitoring the risk environment across Alphabet and providing insights to enable effective risk management. We work closely with teams and leadership to achieve a strong control environment that enhances and protects organizational value. We serve as one of the company’s various lines of defense for staffing and developing our team to be control experts who deliver objective and reliable results. As a member of the team, you’ll advise the business and engineering groups to identify areas of risk and make valuable recommendations on controls. You’ll have the opportunity to influence change and decisions for business initiatives including product launches and system implementations. You enjoy working in a dynamic environment, are passionate about technology and are able to focus on key issues and the details that come with it.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5976871311441920",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-14T17:31:51.272Z",
    "publish_date": "2019-03-14T17:31:51.272Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in MIS, Engineering, Computer Science, Mathematics or equivalent practical experience.</li>\n<li>5 years of experience in software engineering, risk management, audit, compliance, systems integration, consulting, or related industry.</li>\n<li>Experience in any of the following: audit, risk assessments, compliance, information security, IT integration, engineering, or compliance frameworks (MRC, ISO 27001, PCI, HIPAA, NIST, SOC).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CISA/CISSP/PMP/CIA/CPA/CFE or related experience.</li>\n<li>Experience in the following: technology consulting, system auditing, privacy, cyber-security, e-commerce, e-money licensing, digital or online advertising, cloud, online payment regulations, anti-money laundering, online media and entertainment, online content licensing royalty management, software development, supply chain systems and processes, hardware manufacturing, financial processes and systems, mergers and acquisitions, large project systems integration, risk management, or data analytics.</li>\n<li>Experience with internet technology from a technical, regulatory, or commercial perspective.</li>\n<li>Experience auditing and/or working with large scale, distributed technical infrastructure.</li>\n<li>Understanding of at least one object-oriented programming or scripting language.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and assess the impact of risks (compliance, operational, regulatory, reputational) through assurance and solutions management activities. Improve the effectiveness of governance, risk management, and internal control activities.</li>\n<li>Execute audit programs, operational process reviews, and review of system implementations, applications, and other IT-related risk areas.</li>\n<li>Work with cross-functional teams, including Engineering, Product Management, Operations and Finance, while providing IT risk expertise.</li>\n<li>Interact with subject matter experts to understand and communicate how key technology elements address specific risk.</li>\n<li>Prepare audit reports to document audit scope, procedures, and findings. Collaborate with management to agree on remediation action required and perform follow up assessments as needed.</li>\n</ul>",
    "title": "Technology Auditor, Internal Audit"
}