{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ0KmKNo6mGt1CjMA82VJ75R-Ncy_QiEgwXD7VQjFLASOgASYQ8wrrEYH5cLZUkmteNaDfIWzUHk8xgm3yfnHbV5KZzW3YnJhb2WNw2p4xmYC0-4HwdyGAEgXV0%3D_V2&jobTitle=Strategic+Sourcing+Manager&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T18:31:54.192Z",
    "description": "<p>At Google we spend hundreds of millions of dollars with vendors every year. The Supplier Sourcing team gets things done for Google, from tasks like buying hardware, software and professional services to managing facilities and various technology services globally. Through the strong and unique relationships we have with internal stakeholders and the right vendors, our team ensures that Google gets the best value for our purchases. As a member of a larger team, you drive a number of procurement-related activities such as guiding vendors through our shifting needs and supplying internal clients with sound purchasing advice. You craft and lead a multi-step sourcing process and innovative e-auctions to finalize high-dollar, high-risk proposals and contract negotiations. In some cases, you secure competitive rates for Google by translating our business needs into familiar &quot;commodity&quot; terms for the marketplace.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87617788341822150",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:56:49.033Z",
    "publish_date": "2019-02-27T19:56:49.033Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>4 years of relevant work experience, including experience in Procurement/Strategic Sourcing or management consulting in the Supply Chain Management/Procurement/Strategic Sourcing practice areas.</li>\n<li>Experience with the RFI/RFP process and managing eAuctions.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to influence all levels and work effectively across functions and geographies, internal and external stakeholders.</li>\n<li>Excellent oral and written communication skills, with the proven ability to present proposals to executives for quantifiable, data-driven solutions.</li>\n<li>Strong negotiation skills and a strategic outlook.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Learn about Google’s key purchasing requirements, including how our sourcing strategy aligns with broader business strategies. Build strong relationships with internal stakeholders globally, to understand their current and future requirements.</li>\n<li>Collaborate with the wider supplier sourcing team to produce, implement, and support sourcing strategies that ensure best value.</li>\n<li>Conduct solicitations for and execute against high-dollar, high-risk, complex procurements, corporate wide. Identify opportunities for increased competitive bidding, smarter supplier relationships and more efficient finance processes.</li>\n<li>Pro-actively conduct market analysis/benchmarking, track market trends and emerging technologies, and develop metrics to manage supplier performance. Conduct competitive bidding using a multi step sourcing process and utilization of eAuctions.</li>\n<li>Develop and manage supplier portfolios and undertake supplier negotiations through relationship-building to maximize business benefits. Serve as a thought leader to Finance and the rest of the organization for the strategic sourcing of the categories for which they are responsible.</li>\n</ul>",
    "title": "Strategic Sourcing Manager"
}