{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Sunnyvale, CA, USA; New York, NY, USA; Kirkland, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZGjbITx0njZUVIHU65ar5cIdcQqsex0Nj44v5t3-WESOgCPMA3TPe3lIS_v-JJTOQAdm0yEjarlF_uXUi1CZCL9LnHnWutotuCyL1OP-j08wFvwDEg_ZEtLcCo%3D_V2&jobTitle=Privacy+Engineer&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:28.860Z",
    "description": "<p>Whether working on our cloud systems, researching the latest in anonymization, or keeping Google’s internal systems humming, our Privacy Engineers work to create great products that provide great benefit to consumers and at the same time treat their data respectfully, with transparency, and in line with reasonable practices.\n</p>\n\n<p>Both Product and Infrastructure are looking for Privacy Engineers to work on a wide range of important privacy design areas, such as the Google Assistant, and machine learning privacy. We work on protecting users on our platforms and products and in promoting privacy-enhancing design; we do so in partnership with Developer Relations teams. We range from back-end and front-end experts and work cross-functionally with product strategy teams (e.g., Engineering, Legal, Policy, Developer Relations) and partners (e.g., device manufacturers and third-party developers).</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6674442504830976",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-11T17:03:05.936Z",
    "publish_date": "2019-03-11T17:03:05.936Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or a similar technical field or equivalent practical experience</li>\n<li>3 years of experience in a related role and experience with concepts and practices such as threat modeling, data anonymization and classification, auditing access to data, and review of requests for data access.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Code maintenance and review experience in one or more general purpose languages.</li>\n<li>Understanding of technical privacy issues (cookie management, encryption), and experience with the software development lifecycle.</li>\n<li>Understanding and history of applying research to real world problems.</li>\n<li>Patience and negotiation skills with a track record of achieving good user outcomes.</li>\n<li>Ability to communicate across disciplines (e.g. engineering, legal, policy).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Guide engineering teams during product development to ensure that their data collection and usage practices are transparent, protect user privacy, and mitigate risk. Play a critical role in Google’s product design process and launch cycle.</li>\n<li>Conduct technical and policy reviews to identify and escalate potential privacy concerns.</li>\n<li>Lead and manage proactive development of new privacy features and tools.</li>\n<li>Contribute to product/business strategy and public policy and legal initiatives to address and mitigate privacy risks. Conduct outreach to Googlers on Privacy topics.</li>\n<li>Respond to privacy incidents, if they occur, including collecting information on scope and root cause as well as managing remediation.</li>\n</ul>",
    "title": "Privacy Engineer"
}