{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcEW7P8iyskNLNPtjWSvMM37oUiobHXAEzfVFGdjhrUSOgASYQ8wWiI-NYknDx2iNGmdVguYKiCHpkhhpWdRdyQU6AC9L6MySHeFUJFmnyQdF_SOntMtIkyVT_Q%3D_V2&jobTitle=Plant+Engineer%2C+Data+Center+Operations&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-21T22:01:38.696Z",
    "description": "<p>As a Data Center Plant Operations Engineer, you will advocate excellent environmental practices. The Data Center team designs and operates sophisticated and efficient electrical and HVAC systems. Our Engineers are continually seeking different approaches to reducing operational costs while improving efficiencies through the operation and maintenance of water pumps and treatment systems, HVAC, UPS, generators, electrical distribution, and control and monitoring systems.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142696680471306950",
    "location": {
        "address_lines": [
            "Council Bluffs, IA, USA"
        ],
        "city": "Council Bluffs",
        "country": "IA",
        "country_code": "US",
        "display": "Council Bluffs, IA, USA",
        "lat": 41.2619444,
        "lon": -95.8608333
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Council+Bluffs%2C+IA+51501%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Council+Bluffs%2C+IA+51501%2C+USA&size=1168x324&zoom=12&signature=5Qf6VG_G5ezC-ufeZu5Zp-e4Vzs=",
        "large_2x": "/maps/api/staticmap?center=Council+Bluffs%2C+IA+51501%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Council+Bluffs%2C+IA+51501%2C+USA&scale=2&size=1024x324&zoom=12&signature=mZlLLUrIW52zA7Iss0GZjWQnf2k=",
        "small_1x": "/maps/api/staticmap?center=Council+Bluffs%2C+IA+51501%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Council+Bluffs%2C+IA+51501%2C+USA&size=600x400&zoom=12&signature=ecyMj1-bDY78ftli8LAjT7yMYkE=",
        "small_2x": "/maps/api/staticmap?center=Council+Bluffs%2C+IA+51501%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Council+Bluffs%2C+IA+51501%2C+USA&scale=2&size=600x400&zoom=12&signature=Y0uWx_ScJwsQd3_493GQqfwKpxw="
    },
    "modified": "2019-02-27T19:50:25.643Z",
    "publish_date": "2019-02-27T19:50:25.643Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Mechanical Engineering, Electrical Engineering or equivalent practical experience.</li>\n<li>7 years of experience at journeyman level or relevant experience in facilities within a critical environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MEP certification/license.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide effective shift leadership for successful critical system troubleshooting, unit commissioning, repairs/replacements with little to no supervision in quality, quantity, and timeliness as assigned.</li>\n<li>Operate critical plant equipment as authorized by facilities manager.</li>\n<li>Provide coordination/input for global facilities programs such as CMMS, BMS, vibration analysis, training, and thermography.</li>\n<li>Respond to critical data center events and alarms and be responsible for being a point of escalation on operational issues.</li>\n<li>Communicate effectively with clients.</li>\n</ul>",
    "title": "Plant Engineer, Data Center Operations"
}