{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTMD2g3i2EpxF_pBC21snRUVONWxGgkQvu048uoycWUSOgASYQ8w8mKjSnyjMjRCNgE3V0_XShNlZVat-Cq4y5_6pIKdq52IHSjanfR3vrA5Hpyp9-vyptnWQSw%3D_V2&jobTitle=Head+of+Apparel%2C+Google+Shopping&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-27T18:31:39.407Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Armed with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.</p>\n\n\n<p>Google Shopping aims to revolutionize shopping by building great end-to-end user experiences for shopping journeys. Apparel and Accessories is one of our largest shopping categories, and we are building experiences across Search and Shopping Ads. We want to give our users a differentiated, delightful shopping experience for Apparel, Accessories and Fashion across Google - Google Search, Google Assistant, Google Shopping, YouTube - whether they’re on mobile, desktop or even a Google Home device! \n</p>\n\n\n<p>You&#39;ll lead the softlines strategic growth categories for Google, with a particular focus on apparel. You&#39;ll bring industry expertise to develop a vision and strategy for growing these categories. You&#39;ll work with Business Development, Engineering, and Operations teams to expand assortment and improve offerings. You will also work closely with the Product Management team to build category-specific shopping experiences that improve purchase conversion.</p><p>Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The team partners with Publishers and App Developers of all sizes to promote their ad inventory, working with Google&#39;s broad range of partner solutions including AdSense, AdMob and Google Ad Manager, across mobile, display, and video formats, helping our partners and their audiences get the most out of the web. In addition, the Partnerships team supports Google’s own product teams with essential partnerships to help power Google’s user experiences in search, maps, travel, shopping, payments and more.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/96148771689112262",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:54:58.412Z",
    "publish_date": "2019-02-27T19:54:58.412Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience in Apparel Category Management or Merchandising within the Retail industry.</li>\n<li>5 years of e-commerce or digital experience in the retail space.</li>\n<li>Experience with e-commerce site experience optimization (e.g. user journey, site aesthetic and organization, SKU productivity).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in an online marketplace or similar consumer technology company.</li>\n<li>Experience with consumer websites.</li>\n<li>Experience with profit and loss responsibility.</li>\n<li>Demonstrated track record of achieving strategic goals on time.</li>\n<li>Demonstrated project management skills, with the ability to scope and manage a set of diverse projects.</li>\n<li>Developed communication and attentive listening skills, with the ability to explain concepts and tailor messages to different audiences.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define vision and strategy for apparel, accessories, and fashion. Ideate next-gen ideas on how we should re-imagine apparel shopping on Google and implement feature improvements in categories successfully.</li>\n<li>Partner closely with Product, UX, Engineering, and Business Development teams to to design and drive a multi­-year roadmap, balancing short­ and long­ term goals.</li>\n<li>Determine what are the critical metrics to monitor and gain insights on the category assortment, pricing and inventory in order to drive strategy and execution.</li>\n<li>Lead strategies to meet business goals and maximize profitability and adapt to shifting circumstances in a business environment.</li>\n<li>Fosters a strong team environment and use data and insights to influence others.</li>\n</ul>",
    "title": "Head of Apparel, Google Shopping"
}