{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRXi0qHqh-BmJPqlBSPAgnazLDjAzAIQUzXqsEAFcHoSOgCPMA3TWKz4i0-GFK1O25XIThePa0xUXKbDLp2GV1sgtzK4hjB8CnBwuwR1uiUjz35Fw-4jOdmLAGo%3D_V2&jobTitle=Software+Engineer%2C+Android+Applications&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:01.083Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to handle new problems across the full-stack as we continue to push technology forward.<br><br>With your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n<p>Since its inception, Google has built products that change the way people all over the world live and access information - looking up recipes, finding their favorite song, turn-by-turn directions, checking their email, and so much more. How and where people view this information continues to change as the world becomes an increasingly mobile place.\n</p>\n\n<p>As an Android Applications Software Engineer, you’ll drive new innovations and build beautiful user experiences on the largest mobile platform in the world. You’ll work with world-class mobile developers and resources to drive the next generation of apps at Google. Whether building native applications on Google’s core products and services - Search, Gmail, YouTube - or pioneering new visions - like Android Auto, Android Things, Android Security, Android Platform, Google Now on Tap, Android Wear, Cardboard - you’ll impact people’s lives wherever they interact with our products - in their homes, on the go, or someplace in between! \n</p>\n\n<p>You will develop applications primarily in Java and using the Android SDK. You might design and develop open-source Android applications that are part of the Android Open Source Project or closed-source Google applications that are the interface to Google services on Android.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5493777370382336",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-02-27T22:32:00.393Z",
    "publish_date": "2019-02-27T22:32:00.393Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or related technical field or equivalent practical experience.</li>\n<li>1 year of relevant work experience in software development.</li>\n<li>Experience building Android applications using Java/C++</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>4 years relevant work experience in software development.</li>\n<li>1 year of Android application development experience.</li>\n<li>Experience with one or more general purpose programming languages including but not limited to: C/C++, C#, Python, JavaScript, Go, Objective-C, Swift.</li>\n<li>Knowledge of the Android SDK performance tools and optimization techniques.</li>\n<li>Interest and ability to learn other programming languages as needed.</li>\n<li>Working proficiency and communication skills in verbal and written English.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design and implement new user-facing features in Google’s products.</li>\n<li>Build the libraries and frameworks that support large, complex web applications like Gmail, Google Search and Google Maps.</li>\n<li>Write scalable, performant server-side code. Build on top of our infrastructure to create the services that support an amazing mobile experience.</li>\n</ul>",
    "title": "Software Engineer, Android Applications"
}