{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXkqttHtPas7XbK0HYdLsaBsXmPUm3Jk7VaGdx3vVvESOgCPMA3TvPEPeQDtJbM5DB79hdL6rKixKmvDVug4nF4GGuJUxGesfEqayuMRyplGXN-pLlqgmIKb2Go%3D_V2&jobTitle=Partner+Technology+Manager%2C+Actions+on+Google+%28AoG%29%2C+Velocity&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-10T17:01:42.668Z",
    "description": "<p>Google relies on gTech’s Velocity team (gV) to transform and improve people’s lives through big-bet products and services like Search, Google Assistant, and Actions on Google. Our mission is to activate, accelerate, and scale Google’s biggest bets by being trusted advisors to internal and external partners.</p>\n\n<p>As a Partner Technology Manager, you will be responsible for driving the global AoG partner strategy across verticals and the key foundational developer capabilities needed to make partners and the overall developer ecosystem successful. You will lead a team of managers and individual contributors to achieve Google’s AoG partner goals and will be accountable for company-level objectives and key results for AoG.\n</p>\n\n<p>Your team will be responsible for enhancing the Assistant product by adding delightful, innovative and assistive experiences by working with key strategic partners. These initiatives are critical for Google’s future growth and require high-velocity decision-making with many teams across Google. We are looking for an experienced people leader who is passionate about building a highly effective organization with strong managers and is an experienced coach and mentor.\n</p>\n\n<p>AoG is a high-complexity business and you will help define and lead the strategy with numerous cross-functional teams as well as multiple product areas. You will develop tiered account/operational strategies, define business targets and be operationally disciplined to use metrics to achieve the team’s medium and long term objectives. You will be a leader who can deeply understand the technical challenges that partners will face to effectively influence product strategy.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6712133514887168",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T23:05:39.874Z",
    "publish_date": "2019-02-27T19:50:40.329Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, a related field or equivalent practical experience.</li>\n<li>10 years of experience in partner engineering, product management, project management or engineering management.</li>\n<li>5 years of experience in managing teams.</li>\n<li>Experience with web and mobile technologies (HTML, CSS, JavaScript), frameworks (AngularJS, Node, etc.) and design.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience leading and implementing high-impact projects with cross-functional teams.</li>\n<li>Ability to manage multiple time-sensitive projects with competing priorities while working independently to drive projects to completion with minimum guidance and high attention to detail.</li>\n<li>Ability to streamline complex processes and implement workflows designed to increase efficiency.</li>\n<li>Exceptional partner engagement skills and demonstrated ability to effectively influence and lead cross-functional stakeholders.</li>\n<li>Effective project or program management skills.</li>\n<li>Excellent oral/written communication, interpersonal and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of exceptional partner technology managers and solutions consultants to establish business operational processes and core metrics for success.</li>\n<li>Develop and manage strategic initiatives across cross-functional stakeholders to onboard new partners, improve the overall on-boarding process and support product launches globally.</li>\n<li>Define, establish, measure and report on metrics to analyze the partner experience and internal efficiency, including customer service SLAs and support volumes.</li>\n<li>Oversee all aspects of the AoG strategic partner efforts, partner with the business to evaluate the productivity of business operations and proactively identify areas for efficient use of scarce resources.</li>\n<li>Construct executive level presentations and present complex analytical findings in a clear, concise and decision-impacting manner. Build rigorous analytical frameworks and tools to measure key results.</li>\n</ul>",
    "title": "Partner Technology Manager, Actions on Google (AoG), Velocity"
}