{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Chicago, IL, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYVJHwmxmUSeTIklkiXvWKMgGKHp0E_UCsErx8zu-loSOgASYQ8wjegBsfS62VyPh8Dyi44uwE6qqPV5v9QODFIub3asa_t_1JPFGp2YPOrGYXBj_bnL0RtzrEI%3D_V2&jobTitle=Technical+Specialist%2C+Search+and+Measurement%2C+gTech&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-31T17:31:37.757Z",
    "description": "<p>gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities.</p>\n\n<p>As a Technical Search and Measurement Specialist, you will be responsible for providing hands-on technical expertise on Google&#39;s emerging ad technologies. You will help customers achieve their business goals by solving complex Search marketing challenges, while also helping advance customer measurement and attribution maturity with your deep knowledge of Google Analytics. You will work closely with Sales teams to drive product adoption, develop solutions that address their needs and identify new opportunities to grow Google&#39;s business. You will also recognize opportunities for process improvements and automation that makes our team’s more efficient.\n</p>\n\n<p>You are a consultant who can build relationships with both technical and non-technical partner and you understand the intersection between marketing and data. You can architect solutions that leverage Google technology to help customers meet their business goals, and then lead implementations that span multiple products.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80470012902417094",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-02-27T22:32:09.122Z",
    "publish_date": "2019-02-27T22:32:09.122Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of experience with digital marketing, web analytics and internet technologies.</li>\n<li>Experience with Google Ads, Google Analytics, JavaScript and/or SQL.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Google Ads and Google Analytics&#39; advanced features.</li>\n<li>Experience with enterprise Cloud, measurement and attribution technologies.</li>\n<li>Proficiency in one or more of the following areas: Java, Python, Cookie Lifecycles and/or APIs.</li>\n<li>Ability to translate complex product and technical concepts to non-technical and executive audiences.</li>\n<li>Ability to work independently and manage multiple projects simultaneously. Excellent consultative skills.</li>\n<li>Excellent problem solving, troubleshooting and data-driven analysis skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Architect and deliver innovative solutions for Search marketing, web analytics and ad measurement and attribution.</li>\n<li>Perform implementation reviews and product mix analysis, advocate for new product features and assist clients in adopting these features via upgrades and migrations, including documentation and technical guidance to ensure successful technical implementations.</li>\n<li>Ensure the prompt and proper resolution of any technical challenges.</li>\n<li>Improve product offerings by providing client feedback on features to Google Product Managers and Engineers.</li>\n<li>Review current processes and design/develop tools, processes and workflows to increase team productivity/efficiency.</li>\n</ul>",
    "title": "Technical Specialist, Search and Measurement, gTech"
}