{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdHdxC1b_SN88djiXTG_DpN3i38FvvGK983mJbfOFtQSOgASYQ8wxeVd9xt70Ty8js5KXs0nGZUiengq6t-6PEtrYO6ds8zfr8I8i7UW9WOzoyhQaXjlBSzxFZY%3D_V2&jobTitle=Opportunities+Strategist%2C+Go-To-Market%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-25T15:31:37.710Z",
    "description": "<p>The Go-To-Market team brings products, policies and content strategies to market across our partner-facing teams, helping to drive awareness and adoption of our products across our creator and partner ecosystem. The Partnership Enablement team owns all the enablement levers to power the partner-facing teams including activations (product launches, platform and policy changes and content strategies), opportunity and lead identification, trainings, tracking and reporting on goals, CRM enablement, content strategies, and project management of priority cross-functional initiatives.</p><p>As an Opportunities Strategist, you&#39;ll work closely with Product Specialists, Activation Data Analysts, and Content Partnership teams to identify opportunities across regions, programs, and teams on activations for creators on YouTube. You&#39;ll use a high-level view of products that impact our managed artists, creators and partners, and you’ll identify untapped opportunities to drive success. </p><p>You’ll size and stress test opportunities and develop proposals for rollout, and complete analyses on previous activation initiatives to uncover adoption signals to continuously evolve addressable audiences and market sizing. You&#39;re able to work in ambiguous and changing environments, enjoy searching for new opportunities to improve, and take the lead on defining and executing solutions.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139277450967163590",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:07.139Z",
    "publish_date": "2019-03-07T01:32:07.139Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>7 years of analytical/project management experience in management consulting and/or sales operations within internet/media.</li><li>Experience with data analysis across datasets, using database query system, spreadsheet and statistical modeling software (e.g., SQL, JavaScript, R, and/or Python).</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA or graduate degree in management or a technical field.</li><li>Strategic consulting, sales support, and market research experience.</li><li>Deep knowledge of and passion for YouTube platform and ecosystem.</li><li>Ability to present to executives, communicate with management teams, and collaborate effectively with a broad set of stakeholders.</li><li>Excellent influencing skills across teams. Distinctive problem solving and analytical skills.</li><li>Excellent written and verbal communication and interpersonal skills, including ability to structure a compelling storyline and build presentation decks and briefing documents that support the narrative.</li></ul>",
    "responsibilities": "<ul><li>Identify opportunities across regions, programs, and teams for priority product launches to help our creators connect and grow responsibly.</li><li>Analyze and interpret data, define viewership patterns and growth metrics, and deliver recommendations based on data.</li><li>Deliver briefing materials for discussions with senior executives, help leaders understand business challenges and opportunities, and influence them to align around decisions and actions.</li><li>Work with Product Leads and Product Specialists to define the right annual and quarterly product adoption metrics and targets. Track progress of the annual and quarterly OKRs.</li><li>Develop metrics-driven leads criteria to identify and target relevant products to creators, artists and media companies.</li></ul>",
    "title": "Opportunities Strategist, Go-To-Market, YouTube"
}