{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckT-AmkoTvoId2HalZVQyQDF6DArpmTo-QbMYzEpkONMSOgCPMA3TNSdXZBhhXVqrn9TjzGGwOdF_hXSyFUq3TFwAB_VbqIK7YEItSAn0yUNr4VhHCtB_N0vnKk0%3D_V2&jobTitle=Project+and+Process+Manager%2C+Agency+Collections&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-29T15:32:16.320Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p><p>The Customer and Partner Operations team manages Google&#39;s processes globally across all product areas, including Ads, Digital Goods, Cloud and Hardware. We ensure Google’s growth is transformed in an efficient, controlled and compliant manner. Our team powers Google by creating innovative ways to manage our complex processes, making processes more efficient and scalable, minimizing operational risk, integrating Google and new products, connecting with new partners.</p><p>The Agency Collections team manages the collection from many of Google’s most complex customers.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6747475067207680",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T23:11:37.501Z",
    "publish_date": "2019-02-27T19:46:04.748Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Operations, a related field or equivalent practical experience.</li>\n<li>4 years of experience in audit, payments, compliance or banking.</li>\n<li>Experience in managing outsourced operational activity.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience with running large outsourced operational processes.</li>\n<li>Experience in data extraction using SQL or other scripting languages.</li>\n<li>Experience working in a cross-functional, fast-paced environment leading complex operational initiatives to successful outcomes.</li>\n<li>Experience with cross-functional teams and ability to influence key stakeholders.</li>\n<li>Ability to autonomously drive and prioritize multiple initiatives. Excellent communication skills.</li>\n</ul>",
    "responsibilities": "<ul><li>Design and manage the suspension process for large sequential liability agencies.</li><li>Partner with key stakeholders, engineering and vendors to improve complex financial processes, perform effective escalation management and provide “quick fix” solutions.</li><li>Provide customer feedback analysis, operational monitoring, troubleshooting and error resolution to prevent inaccuracies, reduce process latency and drive process excellence.</li><li>Provide performance reporting and analysis to senior management.</li><li>Manage outsourced operational activity, including service level agreements, adherence to documented processes and quality of results, performed by third party vendors.</li></ul>",
    "title": "Project and Process Manager, Agency Collections"
}