{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUFemZpVsVWb1TqYAvsWGM_wTDjViqoqj3lg-uYB49ISOgCPMA3TRCrLVwDwNvvt2or_HKXHSuCI-yvwTyv4wp93E-Ru6mlO79UMNBi8J-izTArBRftz5XtoVvc%3D_V2&jobTitle=Policy+Enforcement+Team+Lead%2C+YouTube+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:06:39.174Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p>\n\n\n\n<p>As the Policy Escalations Team Lead, you are responsible for delivering high-quality policy support on the most sensitive policy escalations, from external sources to internal escalations. You lead our front-line operations on policy issues and are comfortable delivering decisions and recommendations under tight time pressure, often with senior executives with competing viewpoints.\n</p>\n\n<p>You will build relationships with legal, policy and PR stakeholders and help implement policy solutions to urgent policy issues.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4796690219597824",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:00.985Z",
    "publish_date": "2019-03-07T01:32:00.985Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience in internet services, process improvement or customer support.</li>\n<li>3 years of experience managing, coaching and developing a team.</li>\n<li>Ability to work non-standard hours and differing work rotations/shifts as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Crisis management experience.</li>\n<li>Experience delivering customer experience against core metrics, as well as process improvement.</li>\n<li>Experience working in a fast-paced and constantly evolving environment and ability to remain calm under pressure.</li>\n<li>Experience or demonstrated interest in content policy or anti-abuse operations.</li>\n<li>Strategic and analytical capabilities, including using data to drive strategy and business action. Sound business judgment.</li>\n<li>Outstanding influencing and communication skills. Ability to build relationships with cross-functional partners.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead, grow and motivate a team to handle complex customer, press, regulators and executive escalations.</li>\n<li>Deliver operational performance across all escalations paths and team members, ensuring that all escalations are triaged, tracked, investigated and resolved appropriately. Ensure team coverage plans during off hours.</li>\n<li>Improve processes and performance continuously by analyzing, identifying and prioritizing operational improvement opportunities. Articulate and quantify impact of required tools changes to deliver operational improvement opportunities if needed.</li>\n<li>Close the loop on all escalations by sharing observed trends and insights with Policy Enforcement Managers to amend policy guidance. Share and document any identified operational gaps in our enforcement processes so the Operations team can address them.</li>\n<li>Review graphic, controversial and sometimes offensive and disturbing video content.</li>\n</ul>",
    "title": "Policy Enforcement Team Lead, YouTube Trust and Safety"
}