{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcka3cJH_bBsZzu9iJEXtQeAufqa0ugXxFWozHRbJ_PbkSOgCPMA3TcgauXh6uMKeQNrMc5wxThT7VF32a8-IKnYdIPheXkdu20kTl82o2WJRQgr1-C6nNmj8aFZE%3D_V2&jobTitle=Head+of+Publisher+Intelligence%2C+Online+Partnerships+Group&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:32.344Z",
    "description": "<p>The Online Partnerships Group (OPG) is a partner-focused organization that prides itself in providing great service, in creating innovative solutions, and most importantly, in having amazing people. We value having an open, inclusive and collaborative culture, where Googlers feel supported and able to do their best work. In offices around the globe, we foster and celebrate an environment where all team members feel welcomed and respected. OPG partners with online publishers and app developers around the world to grow their businesses using our portfolio of products including the AdSense, AdMob, and Google Ad Manager platforms. We offer a solutions-based approach across advertising, analytics, and site or app design, and pride ourselves in finding new opportunities for our partners to better engage users and advertisers. Over a million web publishers and app developers rely on our solution globally, and ultimately, we&#39;re proud to enable Google to be one of the foremost funders of digital content in the world.</p>\n\n\n<p>As Head of the Online Partnerships Group (OPG) North America Publisher Intelligence (PI) team, you will be responsible for managing a business analyst team responsible for helping OPG make the best decisions possible using data. Team members are responsible for scoping, initiating, and delivering on analytical projects, such as modeling publisher behavior, creating complex SQL workflows, and evaluating the impact of projects and products via statistical methods.\n</p>\n\n\n<p>Furthermore, PI team members are responsible for turning their analysis into action, socializing their recommendations with stakeholders across OPG and sometimes across Google to drive changes to business processes, go-to-market approach, and product strategy.</p><p>Google helps our partners find better ways to reach their audiences and manage their digital businesses. In return, our partners provide great content for our products, and they syndicate Google products to enhance their sites and apps. Global Partnerships team members expand and support these relationships by continually finding new opportunities and solving technical problems for our partners. The wider Global Partnerships team includes a variety of different organizations, including CorpDev, Emerging Business Development, Strategy and Operations, Google for Startups, Area 120 and our Display Advertising Business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6386046222925824",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:38.523Z",
    "publish_date": "2019-02-27T19:52:38.523Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of work experience as a data analyst, business analyst, product analyst or consultant.</li>\n<li>Experience managing and querying datasets using SQL or other languages.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor&#39;s or graduate degree of a quantitative nature (e.g. Statistics, Computer Science, Mathematics, Engineering, Finance, etc).</li>\n<li>Experience with scripting and data analysis languages, such as Python and R.</li>\n<li>Experience managing a team of analysts.</li>\n<li>Effective presentation and verbal/written communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the North America PI team including delivering on people management excellence in skills and career development.</li>\n<li>Provide leadership in identifying and initiating analytical projects that will drive business impact.</li>\n<li>Lead overall project prioritization for the team in conjunction with our other regional counterparts.</li>\n<li>Ensure the team delivers on data analyses and infrastructure on-time and according to expectation.</li>\n<li>Lead individual analytical workstreams, often to senior level stakeholders across Google, influencing fundamental investment and go-to-market strategies.</li>\n</ul>",
    "title": "Head of Publisher Intelligence, Online Partnerships Group"
}