{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbPe3ET7ljVVdUL53rVrpCf7Xx-lKvdk31lhEcZd-H4SOgCPMA3TgGcXufxggXAmqqkpwfCAJDhQ5wJqsc0LZBUT30t_8kRRUNNF0SfR9KU1JyagijLSSCsBV7U%3D_V2&jobTitle=Program+Manager%2C+Network+Operations+Supply+Chain&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-26T14:31:42.336Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As a Program Manager, you&#39;ll manage the material allocation and purchase requirements for projects across multiple locations within your region to best meet project requested delivery dates. You will need to work closely with our customers to ensure material availability meets their project schedules and requirements. You&#39;ll utilize your experience to drive regional and global process and operational improvements in material supply planning. You will also have responsibility for performance against material fulfillment KPIs, and identify and drive process and operational improvements that continually improve performance against the key metrics.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5085180805709824",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:47:09.405Z",
    "publish_date": "2019-02-27T19:47:09.405Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience in Supply Chain inclusive of Strategy and Portfolio Planning, Demand Planning, Materials, Operations, Financial Management, Executive Communications and Data Analytics, with visualizations.</li>\n<li>5 years of experience in global supply chain across multiple disciplines, in related technical/networking fields.</li>\n<li>5 years experience with project management, proficiency in financial modeling.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience defining system and/or process requirements, building, integrating, and/or delivering large-scale network systems.</li>\n<li>Experience communicating to different audiences across all organizational levels.</li>\n<li>Demonstrated spreadsheet software and database capabilities.</li>\n<li>Ability to work independently with minimal guidance and flexibility to take on a wide variety of projects.</li>\n<li>Ability to create models and maneuver within spreadsheet software and databases to manage supply chain processes.</li>\n<li>Effective written and oral communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the portfolio of programs. Define and lead a program structure designed to drive cross-functional initiatives focused on improving overall predictability, reliability, and efficiency of the supply chain.</li>\n<li>Develop effective communication plans across and outside the organization and ensure alignment of team members and key stakeholders.</li>\n<li>Utilize program management expertise to develop, drive, and implement multiple supply chain projects simultaneously. Develop change management and prioritization strategies to ensure seamless implementation of programs into operations.</li>\n<li>Use analytic and financial modelling to identify improvement opportunities, justify the business case, and drive buy-in and support of key programs.</li>\n<li>Ensure performance against key metrics while also focusing and developing each individual team member. Establish best practices and build program management capabilities across the entire org.</li>\n</ul>",
    "title": "Program Manager, Network Operations Supply Chain"
}