{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVyQel1BQxMDtKvoIoOgg5oZwZP30JKdLacLRogTKj0SOgASYQ8wzOmT4eeYHFN7l5Ey4IxyE5CKC4DrMF27aEu-uktD97Mbax4dpmhc4rTfJK-1c1CacWMMCYs%3D_V2&jobTitle=Program+Manager%2C+Strategy+and+Operations%2C+Consumer+Hardware&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T16:01:57.220Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>The Strategy and Operations Program Manager will be responsible for driving strategic initiatives and OKRs, as well as efforts to introduce industry best practices, processes, and tools across the Sourcing and Procurement organization.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/124717177094709958",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-11T16:01:57.220Z",
    "publish_date": "2019-03-11T16:01:57.220Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of experience working in strategy roles in management consulting or supply chain/operations strategy in a hi-tech or Consumer Electronics company.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li><li>Ability to work effectively independently and as part of a team, and to inspire trust by demonstrating sound judgment and integrity.</li>\n<li>Ability to travel. Some local and international travel may be required.</li>\n<li>Excellent project/program management skills and the ability to keep multiple priorities moving at the same time.</li>\n<li>Excellent communication and presentation skills.</li>\n<li>Excellent planning, analytical and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead internal and external intelligence efforts to identify Sourcing/Supply Chain best practices, tools, processes; lead internal and cross-functional teams in implementing these solutions.</li>\n<li>Partner with key leaders within the Sourcing &amp; Global Operations teams to develop our long term vision, strategy, and objectives and operating key results (OKRs).</li>\n<li>Lead development and program management of OKRs and strategic initiatives within the organization, partnering with internal and cross-functional teams to develop the workplan. Identify dependencies and paths to resolution, manage operating review cadence, and ensure initiatives are rolled out effectively to the team.</li>\n<li>Participate in and help lead/facilitate key Strategy and Operating Reviews and implementation working sessions.</li>\n<li>Proactively identify challenges and dependencies across the organization and create programs, processes and/or tools to solve them.</li>\n</ul>",
    "title": "Program Manager, Strategy and Operations, Consumer Hardware"
}