{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTAW_nvtInU7RVGe_smcuwrInS2WnZ-emiVv9C-PcUkSOgCPMA3Tfj4Kwa7FFjldS8xCCf5B3NxoYNBLpbhNi4-PPFTj2YFizvc3IrKDiGGdrgKW7111vuCrnh0%3D_V2&jobTitle=Technical+Account+Manager%2C+Google+Cloud+Professional+Services&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-14T19:31:58.558Z",
    "description": "<p>Our Professional Services Organization in Google Cloud delivers product and implementation expertise to our strategic customers to help them get the most out of their Google Cloud investments.</p>\n\n<p>As a Technical Account Manager (TAM), you&#39;ll draw on your customer-facing skills and technical acumen to help customers get the most value from their Google Cloud investments. Your previous experience with program management, enterprise technology implementation, strategy development and customer advocacy, will play a critical part in your day-to-day work driving success and advancement of our customers.\n</p>\n\n<p>You will lead the successful adoption of Google Cloud at organizations, guiding them through the strategic and technical facets of their Google Cloud transformation journey. You will handle the successful delivery of Professional Services engagements to drive customer adoption of Google Cloud services. As a TAM, you will also regularly present technical materials to diverse stakeholder groups and engage effectively with executives of large enterprises on both technical and non-technical matters.</p>\n\n<b>This role may also be located in our Playa Vista, CA campus.</b><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4620371932020736",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T20:19:55.442Z",
    "publish_date": "2019-02-27T19:46:57.076Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Math, related technical field or equivalent practical experience.</li>\n<li>3 years of customer-facing experience, interfacing with executives and helping drive technology transformation programs.</li>\n<li>Experience in working with a cross-functional, geographically-dispersed team and customer base. Experience working with technical teams.</li>\n<li>Ability to travel 30% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Management, Engineering or technical field.</li>\n<li>8 years of customer-facing work experience.</li>\n<li>Experience in application/workload migration to Google Cloud Platform or related applications.</li>\n<li>Experience in cloud operations, technical support and/or operations (e.g., capacity planning, product release management, etc.).</li>\n<li>Experience collaborating with channel partners, systems integrators and third-party developers to deliver high-impact solutions.</li>\n<li>Excellent written communication and management skills, with a focus on translating business requirements into technology solutions.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage post-sales relationships with customers. Work with technical and implementation leads, customers, and partners to drive successful adoption of Google Cloud.</li>\n<li>Provide best-practice advice and lead large Google Cloud transformation programs with our strategic customers. Develop best-practice recommendations for Google Cloud partners based on the experience gained during customer engagements.</li>\n<li>Establish C-level executive relationships, advocate for customers to overcome adoption blockers and lead across multiple work streams and teams to maintain customer momentum.</li>\n<li>Guide customers through their cloud transformation journey, building strategic roadmaps and driving achievement of key milestones. Serve an advocate for business transformation, enabling teams to embrace cloud technologies.</li>\n<li>Drive customer feedback to stakeholders to ensure the best possible production experience, and assist in prioritizing product requirements by communicating customer needs and impact.</li>\n</ul>",
    "title": "Technical Account Manager, Google Cloud Professional Services"
}