{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdqVD0nJPoMhKQpXQIimPKqY9HUDUUYZIm-SmJRAmjgSOgCPMA3TDOXi9VEJSk-ZZj6xhr8dQtyMFbuWAAyHLX9JFJPBbhkrRj0ihU3XrFYy7lQKKUBbsWusEys%3D_V2&jobTitle=Global+Events+Space+Design+Manager&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-27T05:01:25.530Z",
    "description": "<p>The Global Events team is responsible for supporting, consulting and delivering experiential events to Googlers and their customers so they may thrive through learning, collaboration and social interaction. The team works with a variety of vendors to provide great service, AV production and end-to-end event consultancy and support. As the Global Events Space Design Manager, you&#39;ll think about Googlers and their customers’ journey and how they experience events. Within the design and development process, the Global Events Space Design Manager will lead and support the vision of Google, REWS and the Global Event team.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5437774682062848",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T21:20:15.765Z",
    "publish_date": "2019-02-27T19:53:49.344Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Design, Architecture/Interior or equivalent practical experience.</li>\n<li>11 years of work experience.</li>\n<li>8 years of professional design work experience with a focus on event-related design, theater, event center, corporate event space and/or hospitality industry design.</li>\n<li>Experience with event production operations and flow.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Understanding of permitting process, construction terminology and building systems, and overall project sequence and timing, with knowledge of event production technology requirements.</li>\n<li>Ability to balance design, with operational needs and budget objectives resulting in exceptional venue environments.</li>\n<li>Proven vision, leadership and strategic skills to prioritize evolving initiatives in a fast-paced environment. Ability to turn ideas and capabilities into effective initiatives that engage users.</li>\n<li>Detail oriented, with the ability to think, plan, and execute on multiple projects in different phases simultaneously with little direct supervision.</li>\n<li>Visual design skills, excellent written and verbal communication of design issues with the capability to think outside the box and bring creative, non-standard, and innovative solutions to the table.</li>\n<li>Demonstrated verbal communication skills, with the ability to lead meetings and interact with executive level staff.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead and/or participate in team meetings and discussions to further progress global alignment with engagement and development of key tools, programs, processes, etc. Partner with global events, business units, internal and external audio/visual, event production, technology, facilities management, security, global food and real estate teams to ensure excellent event design and end-to-end experiences for users and external guests.</li>\n<li>Be the subject matter expert on industry event space designs and trends, and take ownership of development of design principles and design guidelines for event space related real estate design and development projects that will enable Google to scale. Develop new guidelines in alignment with events production, AV engineering, global events, business units, the global food team, and real estate team to meet their priorities and needs. Update, modify and manage ecosystem of existing guidelines on an annual or semi-annual basis.</li>\n<li>Manage and support a global team of design and project managers and synthesize their collective needs to further evolve the program in the right direction. Manage multiple design and support partners within and between projects.</li>\n<li>Collect and interpret data to verbalize the case for and execute Global Events team design strategy for event venues (internal auditoriums, event production spaces, event centers, amphitheaters, etc.) within key real estate projects providing clear, effective and timely communication of intended design guidelines, direction, and changes to all applicable project team members and consultants.</li>\n<li>Understand and identify the unique complexities of projects within event spaces in order to objectively identify capable resources, including specialty designers, event production and event consultants, and add guidance to budgeting on all levels of overall capital expenditure spend per project, soft costs per project, design features and elements, and value engineering.</li>\n</ul>",
    "title": "Global Events Space Design Manager"
}