{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfHhoMjRHwSepAkLuma-HO4tqCrXgEiDi6eRi2YKTn0SOgASYQ8wMWi5H6PA6ftoPRYlkfgrHLaoemWPIyZktx0bw2aGpuCfnL8P2rKXAST8X-YhFBcC00c5190%3D_V2&jobTitle=Business+Systems+Integration+Lead%2C+Google+Cloud+Go-To-Market+Partnerships&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-30T21:31:33.314Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n<p>The Google Global Cloud Partner Program and Strategy team is focused on accelerating the adoption of Google Cloud by attract and growing partners who can engage new customers and make them successful. \n</p>\n\n<p>As the Business Systems Integration Lead, you will be responsible for defining the roadmap, connecting Google products into the Partner Systems and Tool platform. The Google Global Cloud Partner Program and Strategy team is dedicated to delivering programs that create value in our partners’ businesses. Our goal is to reward and recognize our partners’ successes as they harness the collective strengths of our organizations to deliver an excellent experience for our customers. The Business Lead for Partner Systems Integration will work closely across the Global Partner Program team, Partner/Channel Marketing, Partner Managers, Product, and Engineering in the Product business and Channel and Field Enablement. The Business Lead for Partner Systems Integration will report to the Head of Partner Programs Infrastructure and be part of a team focused on providing global partner systems and tools.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/111369289677578950",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:15.501Z",
    "publish_date": "2019-02-27T19:49:15.501Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in partner programs at a enterprise, software or cloud company.</li>\n<li>Experience in partner programs or partner system and tools. Experience with enterprise application integrations.</li>\n<li>Experience translating business requirements into technology solutions and vice versa.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Computer Science, related Engineering field, or equivalent practical experience in client service and/or management consulting.</li>\n<li>Experience in project management, interfacing with multiple cross-functional and/or geographically dispersed teams.</li>\n<li>Experience with competitive partner programs.</li>\n<li>Ability to manage numerous infrastructure projects simultaneously and drive them to successful completion, working closely with a wide range of stakeholders and under tight timelines.</li>\n<li>Ability to remain organized and deliver towards goals.</li>\n<li>Excellent written and verbal presentation and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build an excellent partner platform to support all capabilities (e.g., application, enablement, growth, billing, transaction processing, and reporting) across all partner types (e.g., Reseller, Services, SaaS, Distribution, MSP) in collaboration with the Google Product teams and Corporate Engineering. Integrate platform with first and third-party tools.</li>\n<li>Lead the business design and requirements for needed integrations into the partner system platform, ensuring cohesive business processes, data flows, and successful service level agreements (SLAs).</li>\n<li>Influence and work with Product Areas and Corporate Engineering to streamline existing integrations.</li>\n<li>Participate in vendor assessments in order to make recommendations that align to the needs of the global Partner program.</li>\n</ul>",
    "title": "Business Systems Integration Lead, Google Cloud Go-To-Market Partnerships"
}