{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckb02F3JRkYnU66kgxZY_twp4scT3q2c1BWjf8v6nkqQSOQASYQ8wRXGNSua9pFev8sO4fPTeuKRazBDQ4iqp7bsrpygh3aMPTAlwzEiqZFP4k1JO7cWsmKeJOA%3D%3D_V2&jobTitle=Third-Party+Strategy+and+Operations+Manager%2C+Customer+Onboarding%2C+Google+Ads&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-12T19:01:48.573Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Google Customer Solutions (GCS), Acquisitions Sales Organization drives the acquisition of new advertisers for Google by leveraging several channels (e.g., Partners, Inbound, Outbound) and the Marketing organization. This role supports the third-party (3P) partners organizations, a global network of Managed Agencies and Channel Sales partners that create new Google business.\n</p>\n\n\n<p>In this role, you will be part of the Acquisitions, Channel Sales, and AppDev team (ACA), a central team responsible for strategy and operations across GCS Acquisitions channels. Our team leads the design and planning for Sales programs that generate incremental growth for Google. We work in partnership with cross-functional teams across Sales, Marketing, Finance, and Engineering. Experts in developing strategy and delivering process improvements, team members are both analytical and strategic, taking a pragmatic approach to driving high impact.\n</p>\n\n\n<p>As a Third-Party Strategy and Operations Manager, you will focus on our Customer Onboarding Sales efforts for our Managed Agency channel. You will lead projects that accelerate growth and improve productivity across new to Google customers that work with advertising agencies. This role will require you to develop solutions to complex, ambiguous, and high-visibility business challenges in collaboration with Sales leaders, ensuring smooth execution and implementation of these strategic solutions through the Sales channels. Additionally, you will be a source of operational experience and provide business understanding to the Onboarding Leadership teams. You will add value to multiple business challenges, demonstrating excellent business judgment and operational efficiency. You will take initiative in getting things done and communicating with stakeholders within a global environment.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/127162441965413062",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:55:48.972Z",
    "publish_date": "2019-02-27T19:55:48.972Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience in a management consulting, corporate strategy, sales operations, or business development role.</li>\n<li>Experience in project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>Experience working with agencies or in partnerships/business development.</li>\n<li>Experience researching and analyzing key business drivers, trends, and operating metrics.</li>\n<li>Experience identifying opportunities for product, program, and process improvements.</li>\n<li>Ability to structured analysis of data and synthesize data into useful formats to bring actionable insights.</li>\n<li>Excellent problem-solving and analysis skills, combined with effective business judgment and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build and manage Customer Onboarding strategy to enable our agency partners and identify scalable ways to export our best practices and grow existing business partnerships. Codify best practices, build playbooks, and define partnership opportunities</li>\n<li>Develop and manage multiple cross-functional programs and projects to grow the business and/or improve operational performance.</li>\n<li>Support annual/quarterly business planning processes and create models to simulate different scenarios. Design and coordinate pilots, track/report on progress and make a recommendation on global implementation, successfully establishing trainings and global initiatives.</li>\n<li>Coordinate project delivery with cross-functional stakeholders including Engineering, Sales management, Marketing, Finance, and external vendors.</li>\n<li>Work with Global Operations team and Regional Sales leads to gather business requirements for Sales systems, build implementation roadmap, and identify performance metrics for roll-out.</li>\n</ul>",
    "title": "Third-Party Strategy and Operations Manager, Customer Onboarding, Google Ads"
}