{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVgAri36qdc4D6D3I6wPbr5PjcSCN9CZDlN6cTDSSu0SOgASYQ8wk03IuKFTXuf5gvImR9F6UO3OmvPg08quqvN_9yUpO10sfREEEK5zbfsSKbTr-SI_YyCkAdo%3D_V2&jobTitle=Associate+Manager%2C+Industry+Relations&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T21:31:40.506Z",
    "description": "<p>Reach for new revenue-generating heights as a Sales Googler. Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. You leverage your entrepreneurial drive to target, educate and persuade new customers to embrace Google&#39;s latest advertising products and technologies. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, understand the details of individual campaigns and persistently explore and uncover the business needs of your key clients. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>To be successful in this role, you’ll need to be n excellent relationship builder, compelling communicator and deeply knowledgeable about Google’s ads products and how they fit into the larger ads ecosystem. You’ll have an opportunity to work on issues facing the ad industry today, such as artificial intelligence, measurement, brand safety, consumer privacy, ad fraud, and ad blocking.\n</p>\n\n\n<p>You are a self-starter, entrepreneurial, and intellectually curious. You have great people skills, are a strong communicator/presenter and can combine creativity with organizational skills to manage numerous projects on tight deadlines. You are a team player, gets things done and delivers strong results.</p><p>Google’s Global Partnerships team works with a wide range of partners to bring the best of Google to power their business. The team partners with Publishers and App Developers of all sizes to promote their ad inventory, working with Google&#39;s broad range of partner solutions including AdSense, AdMob and Google Ad Manager, across mobile, display, and video formats, helping our partners and their audiences get the most out of the web. In addition, the Partnerships team supports Google’s own product teams with essential partnerships to help power Google’s user experiences in search, maps, travel, shopping, payments and more.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103288059736269510",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-06T21:31:40.506Z",
    "publish_date": "2019-03-06T21:31:40.506Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in advertising sales, marketing, consulting or media.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working in sales, digital and social media marketing, consulting or other media specific industry.</li>\n<li>Experience working in a fast-paced agency environment.</li>\n<li>Established relationships and presence within the agency marketplace.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage relationships with key advertising trade associations, meeting regularly with organization contacts.</li>\n<li>Work closely with cross-functional internal teams, such as Sales, Product, Marketing, Policy, Partnerships and Communications to stay coordinated on industry challenges and highlight relevant opportunities for Google teams.</li>\n<li>Create engagement plans for each partner to ensure Google is effectively involved in all key areas.</li>\n<li>Monitor developing industry trends and serve as bellwether for company.</li>\n<li>Help plan Google’s presence at key industry conferences, attend conferences to extract learnings and manage and allocate budget toward initiatives that align with Google’s priorities and maximize impact.</li>\n</ul>",
    "title": "Associate Manager, Industry Relations"
}