{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfFa5Wbu9bFDx9rzIWkpLQCcfet_2b2sf7x_WuknnUwSOgASYQ8wRpzBFvfN3LnKIt-FPWXSk6l-Hy6HqPQDMuFzN6-VY_UCEkLpExBfmM6si4hPh7ffomMudZI%3D_V2&jobTitle=Partner+Engagement+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-30T18:31:42.575Z",
    "description": "<p>As a Partner Engagement Manager, you will draw on your technical, communication and organizational skills to help customers get the most value from their Google Cloud Platform and G Suite investments. Your previous experience with enterprise infrastructure implementations, cloud platform design, Big Data solutions, and application development will play a critical part in your daily work, driving success and advocating for our most critical strategic customers. You will manage all aspects of Google Cloud adoption, helping customers accelerate their journey to our platform and optimize their business and technical operations.</p>\n\n<p>In this role, you will develop deep and lasting relationships with business executives and IT stakeholders and an understanding of their business requirements and goals. Building on this knowledge, you will lead the shared strategic roadmaps to drive customer partnerships, provide technical guidance and program leadership, and facilitate customers’ digital transformation to maximize their value on Google Cloud.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/110106586472424134",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T22:32:09.897Z",
    "publish_date": "2019-02-27T22:32:09.897Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Mathematics, a related technical field, or equivalent practical experience working with technical teams.</li>\n<li>6 years of experience performing customer-facing services consulting with a focus on infrastructure and/or data systems.</li>\n<li>Technical experience in at least two of the following areas: data center infrastructure, operating systems, networking, security, system administration, service management modernization, or data architecture.</li>\n<li>Ability to travel domestically and internationally up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree, or PhD in a management, technical, or engineering field.</li>\n<li>Experience working with a cross-functional and geographically dispersed team and customer base.</li>\n<li>Experience in cloud operations and technical support or operations (e.g., capacity planning, product release management, etc.).</li>\n<li>Experience working with channel partners, systems integrators, and third-party developers to deliver successful solutions.</li>\n<li>Experience in application/workload migrations to Cloud architecture.</li>\n<li>Ability to present technical materials effectively to diverse stakeholder groups and to engage effectively with executives of large enterprises on both technical and non-technical matters.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive the customer partnership for key strategic customers. Establish executive relationships, conduct customer QBRs, advocate for customer to rapidly knock down adoption blockers, and coordinate across multiple work streams and teams to maintain customer momentum.</li>\n<li>Manage the post-sales relationship with customers to maximize value.</li>\n<li>Team with customer technical and implementation leads and partners to manage and drive successful adoption of Google Cloud.</li>\n<li>Guide customers through the entire innovation lifecycle, building strategic roadmaps and driving achievement of key milestones. Serve as leader and advocate for business transformation, enabling teams to embrace cloud technologies.</li>\n<li>Provide best practices and accelerated support for Google Cloud Platform and G Suite Solutions.</li>\n</ul>",
    "title": "Partner Engagement Manager, Google Cloud"
}