{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZACOYM6g7hk4kxVo90n7IPO32t6ADZ90ukFVGVVZKESOgASYQ8wvkxuTDOJns7uT0uYmKJjDdQYvaLm38IPtIu7YNKvIgYYE3O3oBTutvIpw6Z-lsBBvp4zUxw%3D_V2&jobTitle=UX+Engineer+Manager&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-15T18:31:44.316Z",
    "description": "<p>UX Engineers are the synthesis of design and development. They take Google&#39;s most innovative product concepts and bring them to life in an effort to push the boundaries of user interface design. Google is known for its design aesthetic and technical know-how. In a UX Engineer job, you&#39;ll need both types of skills to develop the next generation of products. You&#39;ll partner with Researchers and Designers to define and deliver new features, test new concepts and assist with final implementation. Details are critical as you iterate on complex interactions, animations and pixel-perfect visual designs.</p>\n\n<p>Our team has an ambitious vision: to build applications that enable people to seamlessly collaborate and accomplish complex tasks together. We’re on a mission to build apps that will be a refreshing change from products and tools that companies so readily accept.\n</p>\n\n<p>As a UX Engineer Manager, you will work on the front end of our products and the features used our customers. The work is challenging, fast paced and always changing.</p><p>User experience (UX) is at the forefront of how we create intuitive, innovative, and beautiful products that people love. We strive to learn and understand our users’ needs, behaviors, and emotions to yield insights that inform product strategy and guide the design of the experiences we create. Our multidisciplinary UX teams include designers, researchers, content strategists, and engineers who are passionate about quality, usability, and performance. We collaborate closely with product managers, software engineers, and many others to solve complex challenges and craft powerful experiences that highlight our products’ unique capabilities and personalities. Our work touches billions while exemplifying a key principle that is core to Google’s philosophy: “Focus on the user and all else will follow.”</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/127780996712932038",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:12.996Z",
    "publish_date": "2019-02-27T19:50:12.996Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>8 years of relevant experience in front-end engineering and design.</li>\n<li>3 years of relevant managerial experience of teams.</li>\n<li>Experience with JS, HTML and CSS.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with modern JavaScript frameworks (e.g. Backbone, Angular, or Ember) and CSS pre-processing frameworks (e.g. Sass or Less).</li>\n<li>Experience with a scripting language (e.g. Python, Ruby, etc).</li><li>Experience with and a passion for user-interface design.</li>\n<li>Ability to communicate to all levels of users (internal and external), developed problem-solving abilities, adaptable, proactive and willing to take ownership.</li>\n<li>Developed sense of web design and attuned to the fundamentals of user experience, including accessibility.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build, manage and grow a team of UX Engineers.</li><li>Lead and define technical direction for your team and the broader UX Engineering organization.</li>\n<li>Contribute directly to projects as an individual contributor.</li>\n</ul>",
    "title": "UX Engineer Manager"
}