{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYDMnrs_oV--GDJvNHRfmkaUDY2RGQUmkNIRfoAk3uQSOgCPMA3Tr1uFyu5DAbQ2pI2fPBtMSbs0y4zntqexFcpc2lFbtRr4Eq8BaFfxpDmNr5TcID-Ops8SQ58%3D_V2&jobTitle=Director+UX%2C+Driving%2C+Navigation+and+Maps+Automotive&loc=US",
    "categories": [
        "USER_EXPERIENCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-10T20:01:38.523Z",
    "description": "<p>Every day millions of people across the world rely on Google Maps, whether they are finding their way through a crowded city or driving on freeways with congested traffic. Geo’s mission is to assist people as they navigate and explore their world, wherever they are. Google Maps plays a foundational role in accomplishing this mission and we’re just getting started.</p>\n\n<p>We are looking for an exceptional User Experience (UX) leader to help define how Google will assist people as they navigate their world over the next 10 years. In this role, you will lead the Google Maps Driving and Google Maps Automotive UX teams to design the best maps experience on devices and in cars, optimized for driving with intuitive functionality.\n</p>\n\n<p>As an experienced UX Director, you will lead and grow our global UX team. You have proven design and facilitative leadership abilities and enjoy a mix of hands-on research, product strategy, team management and bringing innovative products to market. You will help define and drive the future of Google design. In this role you will apply your passion for design, engineering and the impossible to guide research and design processes, mentor talented members of your team and collaborate with leaders within UX and Engineering across all of Google’s products. You will identify and set platform strategy, envision complex user interactions and inspire teams to push the boundaries of what’s possible. You possess a clear vision of the future of UX and have the courage to pursue forward-thinking design.</p><p>The Geo team builds the most accurate, comprehensive, and useful maps for our users. More than a billion people rely on Google Maps services to explore the world and navigate their daily lives. That includes sailing down the Amazon river, choosing where to get a bite of pizza, flying over a 3D version of New York City and saving time commuting. <br><br>Geo helps merchants get their businesses on Google, and more than a million developers use the power of Google Maps to enhance their apps and websites. They are solving complex computer science problems, designing beautiful and intuitive product experiences and improving the accuracy of our geo data, all in order to plot a course for the future of mapping.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4837956175200256",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:46:58.950Z",
    "publish_date": "2019-02-27T19:46:58.950Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in Design, HCI, Interaction, a relevant industry or equivalent practical experience.</li>\n<li>15 years of experience in a C-level role creating strategy and designing products.</li>\n<li>Experience in front-end mobile and web technologies.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Outstanding UX portfolio, demonstrating clear insights, problem solving and simple solutions.</li>\n<li>Experience in the automotive field.</li>\n<li>Experience working collaboratively with senior designers, product managers and engineers.</li>\n<li>Track record of key contributions to innovative, successful products.</li>\n<li>Excellent communication skills with the ability to listen, articulate positions and advocate designs.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Bring a compelling product vision to the Driving, Navigation and Maps Automotive experience, working with Product Management and Engineering to create a strategic vision and roadmaps.</li>\n<li>Lead all phases of UX design work, including research, concepts, prototypes, detailed design and implementation.</li>\n<li>Attract, hire and grow a design team across sites. Drive cross-functional UX reviews to gather constructive feedback and align team to mission.</li>\n<li>Collaborate successfully with Product Managers, Engineering Directors and VPs to make tradeoffs to get the right UX built.</li>\n<li>Advocate holistic and end-to-end experiences for all users.</li>\n</ul>",
    "title": "Director UX, Driving, Navigation and Maps Automotive"
}