{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRbF-2VfkM-XVtk31qRg5ISoZ0grJuMzdl2BZwnpTRQSOgASYQ8w3Kc8c4iU5P2Hxii0IK4mqHZtiQ8d6oZs_5AUH9twcE4kIvMNdp3CwLfbNwgBaDrgRCSIcG8%3D_V2&jobTitle=Campaign+and+Program+Manager%2C+Startups+Marketing%2C+Google+Cloud&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T15:01:57.637Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>Google Cloud for Startups is looking for a marketing lead who will drive marketing strategy and operations for our three primary markets/region - North America, Europe, the Middle East, and Africa (EMEA), and Japan and Asia-Pacific (JAPAC). \n</p>\n\n\n<p>As a Campaign and Program Manager, you will be a core member of the startup leadership team and be responsible for leading a team of field marketers across these primary regions.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/125722568809161414",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-14T11:01:54.505Z",
    "publish_date": "2019-03-14T11:01:54.505Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience in developing global marketing programs or comparable experience.</li>\n<li>Experience using performance metrics for marketing programs.</li>\n<li>Experience leading teams</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with CRM systems (e.g., Salesforce), Marketing Automation tools (e.g., Marketo), and tracking tools to assess campaign effectiveness.</li>\n<li>Experience working at, for or supporting developers or startups.</li>\n<li>Experience as a strategic partner for multiple customers.</li>\n<li>Experience operationalizing projects with clear communication and timelines.</li>\n<li>Track record of driving process and tool improvements for operational scale and productivity.</li>\n<li>Ability to build effective relationships with a diverse range of audience. Excellent project management skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide feedback and context on critical requirements within the regions and drive close alignment and collaboration with the global demand team to ensure that the campaigns’ framework and planning can be leveraged and activated to assist your regional plans.</li>\n<li>Work closely with the head of Google Cloud for Startups and leadership team to forecast, track, and report on the budget and spend across regions.</li>\n<li>Drive the creation of campaigns/programs/event playbooks that clearly outline the strategy, objectives, messaging, themes, and reasons for key initiatives within the regions. Work with the marketing managers in demand generation, content, core product marketing management to ensure campaign and program consistency across platforms and channels.</li>\n<li>Work and collaborate with cross-functional teams to guide and influence campaign and program development and roll out.</li>\n<li>Partner with Marketing Operations to track the global performance of marketing programs. Establish and continuously optimize metrics.</li>\n</ul>",
    "title": "Campaign and Program Manager, Startups Marketing, Google Cloud"
}