{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckd0PIPyMIVq_b_6PnXqr1olzvN7XZDEKZk3DQQFjd-8SOgASYQ8wZoDiXYbyawjEk1Knfl3FZewzt-VvY3DWYKIIqEsWOugSZAugk6GND_XMumzLGxkOaYnSJnA%3D_V2&jobTitle=Video+Strategy+and+Operations+Manager%2C+Product+and+Sales+Activation&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T16:01:49.269Z",
    "description": "<p>The Business Strategy and Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Product and Solutions Activation (PSA) team is part of the Google Customer Solutions (GCS) organization and is responsible for creating performance and brand solutions for small and medium-sized businesses (SMBs). We’re responsible for driving sustainable growth and product adoption across the GCS channel for our product areas.\n</p>\n\n\n<p>The Video Strategy and Operations Manager, in the Product and Sales Activation team (PSA), is responsible for thinking about the Video Ads business holistically, working on strategic and operational initiatives that will enable the business reach strategic goals.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/143726385861403334",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-07T16:01:49.269Z",
    "publish_date": "2019-03-07T16:01:49.269Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience in Management Consulting, Business Strategy and/or Product Strategy.</li>\n<li>3 years of experience leading and developing teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or advanced degree.</li>\n<li>Experience leading complex operational/strategic initiatives and large-scale change management.</li>\n<li>Experience and comfort with large data sets. Experience working with SQL.</li>\n<li>Ability to structure a compelling storyline and build presentation decks/briefing documents that support the narrative.</li>\n<li>Demonstrated project management skills and ability to simultaneously handle multiple priorities.</li>\n<li>Developed written and oral communications skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead cross-functional operational projects and strategic projects, both on an on-going basis and on an ad-hoc basis. Frame, structure analyses, surface and prioritize solutions, and deliver impact.</li>\n<li>Understand and analyze drivers of the video business performance on an on-going basis. Surface actionable insights to improve the business and unlock new revenue streams.</li>\n<li>Partner cross-functionally and build strong relationships with Product, Engineering, Sales, Sales Finance, Revenue Strategy and Operations, etc. to deliver against the project goals.</li>\n<li>Be a thought partner to other part of the organization and demonstrate the ability to problem-solve and simplify complexity.</li>\n<li>Lead and foster a high performing small team that delivers results and collaborates well with each other and across teams. Inspire, coach and develop team members to drive change.</li>\n</ul>",
    "title": "Video Strategy and Operations Manager, Product and Sales Activation"
}