{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Lithia Springs, GA, USA; Council Bluffs, IA, USA; The Dalles, OR 97058, USA; Lenoir, NC, USA; Berkeley, CA, USA; New York, NY, USA; Reston, VA, USA; Clarksville, TN, USA; Moncks Corner, SC 29461, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckR8nM9VFe2DbHvrnjBukjPncWwHFZ5rz1JSujVq5wEESOgASYQ8wQLsoab9NZgUKPDUQYNE2TrhY9VB3n7jjFJyGEbZ_XlbVQ3dqlRJRSXUgmwDcPtJPioNmbFs%3D_V2&jobTitle=Global+Operations+Excellence+Manager%2C+Global+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T17:32:01.012Z",
    "description": "<p>As a Global Operations Excellence Manager, you&#39;ll grow and manage a team focused on building the global tools, processes and programs that will allow our Data Center fleet to scale sub-linearly (e.g. Operations Playbook, Work Notification Tool, Operations Assessment, Innovation, etc.).\n</p>\n\n<p>You will also work closely with the Operations Excellence Steering Committee (OESC), which is comprised of a group of DCOps leaders, that provides direction, resources and acts as the approval authority for the teams building the tools and systems that support global datacenter operations.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/84187417558295238",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-11T17:32:01.012Z",
    "publish_date": "2019-03-11T17:32:01.012Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in technical field or equivalent practical experience.</li>\n<li>10 years of global people management or project management experience.</li>\n<li>Experience in the operation of datacenter, semiconductor, pharmaceutical, power, nuclear, or other 24X7 mission critical industries.</li>\n<li>Experience with 24x7 operations policies and practices in a relevant discipline such as critical operations, maintenance, control systems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in managing strategic complex projects across different groups and disciplines.</li>\n<li>Demonstrated understanding of Data Center design, construction and deployment practices.</li>\n<li>Demonstrated skills in; requirements gathering, resource organization, task prioritization, scheduling and achieving objectives on schedule and within budget.</li>\n<li>Excellent leadership, analytical, quantitative reasoning, problem solving, creativity and strategic skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive high quality deliverables and a great team environment. Create a team growth plan, establish operational metrics, and be directly involved in hiring/recruiting talent.</li>\n<li>Execute OESC mission and objectives; Define, track and execute OESC OKRs. Manage OESC projects priorities and manage project marketplace resource pool. Enforce OESC approval authority and decision making process.</li>\n<li>Drive global standards and processes with internal and external partners. Manage global relationships with Facilities Managers, Technicians, Program Managers, Security, Quality, EHS, Construction, Finance and Leadership, and travel up to 30% as required.</li>\n<li>Manage the OESC product managers and project marketplace delegates; Coach and support the delegate project managers running OESC projects. Create program charters and job description for the delegate roles. Raise and manage OESC (delegate) headcount based on OESC priorities and objectives.</li>\n<li>Promote OESC vision and interface with stakeholders in Data Center Operations and other groups (HwOps, DCRE, etc); Advocate and ensure OESC vision and promote OESC as the authority for DC Operational Excellence. Create and manage communication channels between OESC and DCOps as needed.</li>\n</ul>",
    "title": "Global Operations Excellence Manager, Global Data Centers"
}