{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTwsTyumu8Kdt6A7R2_d0PG2d-mEmHUv5cD3FGEuDlMSOgASYQ8wpQImevfbSsIfVs09ciNDqRHpGdQ7vaLThChzrkQXECxFqcaEbgnYXUPHaStKRH9mMIYvWDc%3D_V2&jobTitle=Agency+Business+Development+Manager&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-07T04:01:47.766Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Google Customer Solutions Sales teams are made up of trusted advisors, who maintain a relentless focus on customer success by bringing the best Google has to offer. The Traditional Media Agency (TMA) team, a subset of Google Customer Solutions, is responsible for driving incremental business growth via our full-service, creative and media agency partners. As an Agency Business Development Manager, you will focus on strengthening long-term relationships with our managed traditional media agencies and drive business growth through agency-managed accounts with large brand and performance opportunity.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128203964555371206",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:44:27.466Z",
    "publish_date": "2019-02-27T19:44:27.466Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of relevant experience in sales or marketing at an agency, technology or media company.</li>\n<li>Ability to travel up to 20% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with techniques including effective questioning, objection handling, competitive selling.</li>\n<li>Proven success managing a sales portfolio in business development, client relationship and servicing skills, and solution-based selling.</li>\n<li>Demonstrated ability to lead and manage multiple projects with a broad range of internal and external constituents simultaneously.</li>\n<li>Demonstrated ability to think strategically about complex issues and develop recommendations and action plans.</li>\n<li>Demonstrated thought leadership; ability to influence executive stakeholders.</li><li>Strong analytical and problem solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver against goals while prioritizing and delivering an outstanding \nexperience to Google&#39;s top managed agency partners.</li>\n<li>Collaborate and consult with major agencies with the goal of extending \nrelationships, increasing the client and agency base and optimizing their advertising.</li>\n<li>Own and strengthen primary agency relationships from executive C/B-level \ndown to specific account teams including Media Planners and Buyers.</li>\n<li>Analyze data trends and client performance. Develop solid strategic plans and prepare and conduct strategic presentations.</li>\n</ul>",
    "title": "Agency Business Development Manager"
}