{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX5qfPPiw5AkEJnYWRRD0oreozTrRtGHKeVabpI4kbESOgCPMA3TTvQcJfnBY7U_C0DczFs_bbV341wjaD0eIZW3pVhVT0qf5S1RK8KkYgnawZoCGqrprb4uo-A%3D_V2&jobTitle=Global+Product+Lead%2C+Advance+Measurements%2C+Product+and+Sales+Activation+Performance&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:35:28.770Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>The Google Customer Solutions (GCS) Product and Sales Activation Performance team is responsible for commercializing performance advertising solutions for Small and Medium Businesses globally.\n</p>\n\n<p>Our mission is to fuel GCS growth by enabling customers to achieve the most with our products today and shaping our products for tomorrow. We are the product and business experts behind the GCS teams responsible for driving sustainable growth and product adoption. </p><p>We identify opportunities through data-driven analysis, develop business cases for those opportunities, build consensus with stakeholders across multiple organizations (Sales, Product, Marketing), and program manage these cross-functional teams to drive GCS advertiser success.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5734999602823168",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:50:51.410Z",
    "publish_date": "2019-02-27T19:50:51.410Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of relevant work experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Demonstrated ability to work, collaborate and consult cross-functionally. Ability to set a goal and vision for a cross-funtional team and translate this into tactical quarterly goals.</li>\n<li>Developed strategic thinking with demonstrated ability to lead complex operational and strategic initiatives.</li>\n<li>Distinctive problem solving and analytical skills, combined with impeccable business judgment.</li>\n<li>Developed communication skills with confidence in presenting solutions to senior-level audiences and communicating with highly technical management and product teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop GCS product and go-to-market strategy for products serving advertisers focused on Lead Generation. Lead cross functional teams to execute against strategy with high bar for operational performance.</li>\n<li>Partner with Sales, Product, Strategy and Operations and Support teams globally to identify, prioritize and deliver key improvements in serving Lead Generation advertisers across ad formats, automation, measurement, analytics and support. Create proposals that demonstrate why these needs are critical and be a key influencer to product and support roadmap.</li>\n<li>Work with regional sales teams to develop and execute product go-to-market enablement plans for marketing solutions.</li>\n<li>Define and track success metrics, including product adoption targets, health indicators, sales activity/behavior. Develop and refine best practices and collateral.</li>\n<li>Be a visionary who understands and communicates the bigger picture, but who can also grasp, anticipate, and solve for problems along the way.</li>\n</ul>",
    "title": "Global Product Lead, Advance Measurements, Product and Sales Activation Performance"
}