{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Washington, DC, USA; Austin, TX, USA; Boulder, CO, USA; Chicago, IL, USA; Mountain View, CA, USA; New York, NY, USA; Reston, VA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXsIybi0UNez_PuV05xq585NMPkZ3yQHSBFxj22SRgkSOgCPMA3ThdjshnlYjcC1dzZ2tsCF0XsXVVAmYdGy5_7o_vtjf8rYrLdUgTKzGfIaFG7fLxN0T7ZC7QU%3D_V2&jobTitle=Sales+Engineer%2C+Google+Cloud+Platform+%28Government%29&loc=US",
    "categories": [
        "SALES",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:35:31.002Z",
    "description": "<p>When leading companies choose Google Cloud it&#39;s a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p>\n\n<p>Google Cloud Platform is a set of modular cloud-based services that allow you to create anything from simple websites to complex applications. It externalizes the best of how we run the worlds largest &#39;software-as-a-service&#39; (SaaS) company and makes our infrastructure, software and processes available to all. Google Cloud Platform delivers the public cloud-on-demand provisioning of infinite capacity running on infrastructure without any upfront commitment.\n</p>\n\n<p>Traditional developers are just now discovering the unique power and instant scale made available to them through Google Cloud Platform - Compute Engine, App Engine, Container Engine, BigQuery, Cloud Storage, and more. Whole new industries and solution spaces are being defined and developed right now and cloud services are leveling the playing field across the board.\n</p>\n\n<p>We&#39;re on a mission to completely change the world of enterprise computing, and in this role you&#39;ll not only have a front-row seat for the action, you&#39;ll be helping shape and execute the strategies to help customers. You will become a trusted advisor to our clients and prospects, and help them get as much value out of our Platform as possible. You will use both technical and business skills to move agreements forward as efficiently as possible. We optimize for growth and ensure customer success by providing end-to-end services to our clients.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6738015016910848",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-02-27T19:43:08.944Z",
    "publish_date": "2019-02-27T19:43:08.944Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field or equivalent practical experience.</li>\n<li>5 years of experience as technical sales engineer in a cloud computing environment or equivalent experience in a customer facing role (including working as a member of a professional services or systems engineering team).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other technical field.</li>\n<li>Experience in, and understanding of, data and information management, especially as it relates to Big Data trends and issues within businesses. Hands-on experience using and/or managing databases. Know your way around Map Reduce, Hadoop, Spark, Flume, Hive, Impala, Spark SQL, BigQuery.</li>\n<li>Experience with Big Data, PaaS, and IaaS technologies. Experience architecting and developing software for scalable, distributed systems.</li>\n<li>Working knowledge of Linux, Web 2.0 development platforms, solutions, and related technologies (HTTP, Basic/NTLM, sessions, XML/XSLT/XHTML/HTML), understanding of DNS, TCP, Firewalls, Proxy Servers, DMZ, Load Balancing, VPN, VPC).</li>\n<li>Web application development and integration. Software development platforms and solutions to include J2EE, Java servlets, JavaScript, Python, Go, PHP, ASP, CGI, AJAX.</li>\n<li>In-depth knowledge of web, XML, and any related technologies and security standards (HTTP, JavaScript, XML, LDAP, SMTP, etc.)</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Use your technical expertise to help clients determine if Google Cloud Platform is right for them.</li>\n<li>Work with the business team to identify and qualify platform opportunities through a formal process. Conduct full technical discovery, identifying pain points, business and technical requirements, “as is” and “to be” scenarios. Architect client solutions to meet gathered requirements.</li>\n<li>Take full responsibility for the technical aspects of the business cycle including general teaching, introductory meetings, supporting agreement responses, product and solution briefings, proof-of-concept work, and the coordination of additional supporting technical resources. Identify and handle key customer technical objections, guiding them to success.</li>\n<li>Prepare and deliver product messaging in an effort to highlight Google Cloud Platform value proposition and unique differentiators, using white-boarding, slide presentations, product demonstrations, white papers, trial management and request for information (RFI) response documents.</li>\n<li>Work hands-on with Google Cloud Platform products to demonstrate and prototype integrations in customer/partner environments. Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution, providing “best practice” advice to customers to optimize Google Cloud Platform effectiveness.</li>\n</ul>",
    "title": "Sales Engineer, Google Cloud Platform (Government)"
}