{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYCFSa5EkSCNgyLW9Xm-FhPbiVvuU-lrTAyGPUArtdsSOgASYQ8wzdQN_mHbczqy4muHMf7ZMhKbEowLGsMN_L8aMlawR1MvzcTXH6jR8haHvOls8O0I9YoJs9A%3D_V2&jobTitle=Global+Display+Lead%2C+Product+and+Sales+Activation%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T16:31:40.349Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>Google&#39;s applications, systems, products, reach, ads, and measurement capabilities can help small and medium sized businesses achieve their marketing goals. The Product and Sales Activation (PSA) team sits within the Google Customer Solutions (GCS) organization and our mission is to drive current and prospective advertiser success with Google through strategic initiatives and advocacy for products that better address their needs. We measure success through advertiser retention and long-term growth.\n</p>\n\n<p>As a Global Display Lead, you will manage the product and market strategy of a portfolio of display products focused on small and medium sized businesses. You&#39;ll collaborate with Sales, Marketing and Product teams to identify trends in customer patterns, and make strategic decisions that contribute to the growth of our advertiser base. You&#39;ll work as a cross-channel liaison and be responsible for building a multi-directional operational plan.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5438924960858112",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-18T21:20:15.720Z",
    "publish_date": "2019-02-27T19:52:09.187Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in project management, relationship management and leadership.</li>\n<li>Experience influencing stakeholders.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree or PhD in Business, Marketing or related field.</li>\n<li>Experience analyzing data and creating reports.</li>\n<li>Experience with and understanding of Google Ads and how to create/optimize campaigns.</li>\n<li>Knowledge of the display advertising industry.</li>\n<li>Ability to influence stakeholders and translate complex, ambiguous topics into stories that inspire and initiate action.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand display advertising and how small and medium sized business (SMB) customers engage with our display products.</li>\n<li>Analyze data to uncover opportunities to accelerate growth, building models to determine addressable audience and opportunities.</li>\n<li>Advocate for display opportunities, engaging with Sales and Product teams to realize potential.</li>\n<li>Plan and lead the execution of projects designed to accelerate display growth in collaboration with global, cross-functional teams.</li>\n<li>Monitor new feature releases, create and conduct trainings to GCS teams, and develop new and innovative ways to distribute insights in a scalable way.</li>\n</ul>",
    "title": "Global Display Lead, Product and Sales Activation, Google Customer Solutions"
}