{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQN3nxiv0soT9x1PYfKEzC2qpMiqWpv8wl9k30vXx_ASOgASYQ8wUB6fgDOOfG_v0w2UAOatQ9kcvVccmL-CTm7xjOVnnJCpeko3b9A3AK41P5812AlltZ0j-lI%3D_V2&jobTitle=Lab+Program+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T21:01:41.941Z",
    "description": "<p>As a Lab Program Manager in the Bay Area Facilities Operations organization, you will be responsible for bringing forth the lab operations expertise and mechanical, electric, and plumbing (MEP) infrastructure expertise to support Google’s strategic lab fulfillment plan for the Bay Area portfolio.You will also be responsible for creating a scalable program to ensure smooth deployment of the plan. You will contribute excellent strategic and collaboration skills and will be comfortable working in a matrixed organization, building relationships in difficult situations, getting buy-in and consensus from colleagues with diverse opinions, driving decision making where trade-offs are required, and keeping information circulating so that Real Estate and Workplace Services (REWS) can grow coherently as Google expands.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6572460816236544",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:01:49.548Z",
    "publish_date": "2019-03-18T20:01:49.548Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in a technical field or equivalent practical experience.</li>\n<li>8 years of experience in combined facility critical operations management and service with an emphasis on facilities, construction or corporate services within an organization.</li>\n<li>Experience in mechanical, electrical, and plumbing (MEP) systems design and/or operations in support of lab facilities.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree in Business, Management, or any technical discipline.</li>\n<li>Ability to think out of the box and bring creative and innovative solutions to the table, helping to enhance organizational function and enable team productivity.</li>\n<li>Ability of project and program management at scale and across complex businesses with high levels of execution and quality.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build relationships with key leaders within major Google product areas (PA) to understand their current and future lab needs.</li>\n<li>Work with industry experts to identify, develop, and deploy a strategy for labs that ensures Google business deliver effectively and efficiently. Stay updated about the latest technologies and best practices in the Lab industry and deploy them at our workplace to achieve an excellent approach to Lab design and delivery.</li>\n<li>Partner with user group leaders and the REWS internal functional leaders to define and articulate MEP infrastructure strategic plan to support the overall strategic plan for lab deployment. Support the development of an overall lab strategy within the existing portfolio, as well as planned new buildings.</li>\n<li>Define the performance expectations and measurable outcomes for the lab deployment process. Track performance and continuously improve the process.</li>\n<li>Partner with the Project Executive team to ensure expedient and consistency delivery of all lab requests and with the Facilities Management team and the Environmental Health and Safety (EHS) team to ensure all lab operations are in compliance with all applicable regulatory requirements. Develop a scalable operational model to accommodate the company’s growth.</li>\n</ul>",
    "title": "Lab Program Manager"
}