{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcfdEggkCy4o-YEue65CucsXkXrpvfHWLfDD9-EZL1QSOgASYQ8wnrx6DbWcnED0vusCYy3DhnUVVvH5437ehn5_0k-Yy8kZ_wZl7xqXgnkz-W_qckeBRcECemg%3D_V2&jobTitle=Monetization+Policy+Specialist%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-19T13:31:40.598Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p><p>As a Policy Specialist for YouTube Monetization, you are passionate about making sure that YouTube is a safe platform for advertisers, creators, and users. You will assist with the implementation and enforcement of YouTube&#39;s monetization policies with a special focus to identify and action on abuse trends. You&#39;ll be responsible for ensuring the quality of YouTube’s monetizable video inventory that is at the core of generating revenue from a broad range of new YouTube advertising products and content partner programs. You&#39;ll serve as the policy expert on cross-functional teams with Product and engineering and working with partner teams on policy consultations.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139801406509851334",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-05T08:31:21.726Z",
    "publish_date": "2019-02-27T19:38:34.202Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree or equivalent practical experience</li><li>2 years of relevant experience in an analytically-intensive role, such as business intelligence, corporate strategy, or quantitative research.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience content and ads policies in the internet industry.</li><li>Policy experience, with robust knowledge of the technology sector and the key policy issues affecting the internet like advertising, free expression, and online safety.</li><li>Technical experience in machine-learning methodology (e.g., understanding of product development flow, ability to translate technical concepts into non-technical terms).</li><li>Experience using data and technology to solve complex business problems, coupled with the ability to exercise judgment even in a crisis.</li><li>Effective communication skills with the ability to translate complex issues into simple and clear language.</li><li>Demonstrated problem-solving and analytical skills and impeccable business judgment, with professional distinction in thought leadership and innovation.</li></ul>",
    "responsibilities": "<ul><li>Enforce policy decisions for YouTube’s advertiser friendly guidelines. Review controversial and sometimes offensive video content to determine whether or not they’re brand safe.</li><li>Handle escalations with a fast turn-around time to define and deliver the best action plan.</li><li>Research and stay up to date on key trends and suspicious patterns in your policy area</li><li>Increase efficiency through automation, workflow streamlining, and system optimization.</li><li>Work directly with cross-functional stakeholders to directly convey policy decisions to advertisers and users.</li></ul>",
    "title": "Monetization Policy Specialist, YouTube"
}