{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQK7Wq-BKv4E0aqsv95fMNzF0qxdux3FI7mBduHAqvUSOgASYQ8w1j0w4URT43-hC0gxzE39LsP_F93Xa4B5a3qQjKRXkO_Ds7VVQKZeMDZzNNHqBvv6mhulrcQ%3D_V2&jobTitle=Communications+Associate%2C+Hardware&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T23:01:33.912Z",
    "description": "<p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns; engage in face-to-face meetings with commentators and other opinion formers; and develop print and web-based material supporting these campaigns. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.</p>\n\n<p>You will be supporting the Hardware organization at Google, a fast growing group responsible for a family of consumer hardware products ranging from smartphones, our voice-activated Google Home portfolio, Nest products, accessories and much more. From media outreach and project management, product review programs and weekly reporting, you will provide daily PR support for our hardware efforts. You will foster and maintain relationships with reporters across business, tech and trade press, and drive positive, impactful media coverage for the product.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be a creative self-starter who is willing to try new things and can manage numerous projects with tight deadlines. Things happen quickly at Google, and to do great work you need to be an enthusiastic team player who can work cross-functionally with partners across PR, comms, marketing, product and beyond.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/93580324069352134",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:47:30.606Z",
    "publish_date": "2019-02-27T19:47:30.606Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of relevant experience in Public Relations, media, marketing, or communications.</li>\n<li>Must have work authorization in United States.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Demonstrated ability to work calmly and maintain good judgment in fast-paced environments.</li>\n<li>Ability to think, plan and execute on multiple projects simultaneously in an organized fashion.</li>\n<li>Ability to work with colleagues in different countries and understand cultural differences.</li>\n<li>Proven communicator with excellent written and verbal communication skills.</li>\n<li>Ability to identify and engage with tech, trade and business journalists.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Secure proactive media coverage for many of our major initiatives and efforts across Hardware in business, tech, consumer and broadcast media outlets.</li>\n<li>Build and own your own communications programs, supporting strategic parts of the business.</li>\n<li>Help drive messaging and narrative development for the Hardware product area, including drafting blog posts, media pitches, launch materials and product reviews programs.</li>\n<li>Act as media spokesperson, communicating the user benefits of our products and key messages to the press.</li>\n<li>Represent PR for our consumer products and work with cross-functional partners in product management, engineering, support, finance, and marketing globally to develop and refine communications content to ensure a consistent voice and effective storytelling.</li>\n</ul>",
    "title": "Communications Associate, Hardware"
}