{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckV-U6A2bfIs_sLVWHL9KXiU64McrdpqeTiGyWHPPyqMSOgASYQ8wDH15gWi-g9fmclT4UhkXp9hzGW2x8oAzirUiempbsFAgiaKQR5IlxRAACnJY0cRkpqXkPMA%3D_V2&jobTitle=Strategic+Partner+Development+Manager%2C+Search%2C+Global+Product+Partnerships&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T14:31:52.835Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships Development team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Equipped with your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube, Google TV and Commerce.</p>\n\n\n<p>Global Product Partnerships (GPP) negotiates and manages Content Partnerships (e.g. data licensing agreements) and Actions Integrations (e.g. collaborations to let users “do things” like reserve a table). These partnerships help build and differentiate Google’s products in several areas, including: Search, Assistant, Geo (Maps, Local), News &amp; Publishing, Research &amp; Machine Intelligence, as well as Chrome/Web, Developer Products, Identity, and Lens.\n</p>\n\n\n<p>GPP’s Search team leads content partnerships and actions integrations to make user journeys on Search more compelling, visual, and locally relevant. Our partnerships power content for Search’s most popular verticals (including Sports, Media, Weather, Finance, Social Impact) and enrich the search ecosystem with images, video, local events, and more. \n</p>\n\n\n<p>As a Strategic Partner Development Manager, you&#39;ll develop and execute global partnerships strategies that enables Search to meet its product goals. You will work closely with product leaders and cross-functional teams to source and execute complex agreements for Google, as well as develop Go-to-Market strategy for scaling new ecosystems. Additionally, you&#39;ll build and manage product relationships with some our partners and operate as part of a high performing team. You will support several of Google’s vertical experiences as they expand to priority locales.</p><p>Google’s Global Partnerships team powers extraordinary user experiences through meaningful partnerships. We build relationships that solve users’ needs, advance our partners’ goals, and further Google’s mission. Our team provides solutions for a range of partners — from helping publishers and developers grow their businesses through monetization solutions, to helping our long-term partners anticipate and navigate change in a way that delivers economic and reputational value. We build and distribute Google products through partnerships across a multitude of product areas, including Search, Assistant, Geo, News, Travel, and more. We collaborate across Google, ensuring a coordinated approach when engaging with our most complex and strategic partners.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/75396834979128006",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-19T17:02:04.126Z",
    "publish_date": "2019-03-19T17:02:04.126Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in business development or partnerships.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Search verticals (e.g., investment banking, consulting, strategy).</li>\n<li>Track record as a strategic thought-leader in business development, partnerships, product management, general management, or sales.</li>\n<li>Demonstrated ability to clarify and summarize complex challenges, with the ability to influence internal and external stakeholders across all levels of management.</li>\n<li>Excellent analytical and reasoning skills, with the ability to structure partnerships models and handle technical and financial challenges.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand product launches/plans and implications for Google and its partners, and lead related internal and external communications and strategies.</li>\n<li>Represent Google’s position to partners where applicable and build, maintain and evolve relationships with partners.</li>\n<li>Provide partner feedback and market intelligence to Google’s Product teams.</li>\n<li>Design and implement processes and policies to improve Google’s ability to partner globally. Ensure that partners fulfill their obligations and that Google provides them with the required support.</li>\n<li>Manage coordination with internal cross-functional teams (e.g., Product, Engineering, Legal, Operations, Finance) and other Business Development teams, including regional counterparts around the world.</li>\n</ul>",
    "title": "Strategic Partner Development Manager, Search, Global Product Partnerships"
}