{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUt0xtCoSOEqGpATIU98-8V86oaWiDaCvnn8c4NML1oSOgCPMA3TfRiXUWhGKbjcL5ZfG6h8n_ondjZY_qmXy8RauQ0vKZFEWuy8qR-x7u_ymw9UzaEoO5gPpOE%3D_V2&jobTitle=Technical+Program+Manager%2C+Network+Capacity+Engineering&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:54.002Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>The Network Capacity Engineering team is at the core of Google&#39;s network organization. This team determines how much capacity, where and when is needed to ensure that no user or customer demand goes unmet. This team oversees demand planning, converts demand to capacity, allocates network resources, and ensures network health across Google&#39;s wide range of users and customers base (Cloud, Search, Gmail, YouTube, etc). The fun doesn’t stop at Google’s massive WAN: the team also capacity plans the Campus/Data Center Network and Edge infrastructure with partner teams, making this role truly end to end.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5691089560469504",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:42:59.375Z",
    "publish_date": "2019-02-27T19:42:59.375Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS degree in a technical field or equivalent practical experience.</li>\n<li>4 years of experience managing multi-group, multi-disciplinary projects from evaluation and design to execution.</li>\n<li>Experience driving technical programs in network capacity planning, deployment/engineering, product design, network content delivery or data center networking within telecommunications or Internet industries.</li>\n<li>Experience with managing migration-style projects; projects that involve upgrades and changes during maintenance windows.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in a technical field or equivalent practical experience.</li>\n<li>Experience with software development, data analysis pipelines and statistics.</li>\n<li>Demonstrated experience defining system and/or process requirements, building, integrating, and/or delivering large-scale layer 2 and layer 3 network systems.</li>\n<li>Knowledge or demonstrated experience with capacity planning and/or supply chain planning.</li>\n<li>Demonstrated ability to manage multiple priorities in an ambiguous and busy operations environment; deliver outstanding results in a timely manner. Excellent organizational, multi-tasking and prioritization abilities; excellent attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with core teams to develop and articulate tactical plans and long term strategy for Google’s backbone, campus and content distribution requirements. Initiate new programs in response to need and be the catalyst for winning support and driving them through the execution phase.</li>\n<li>Manage various programs of work, engage teams and engineers, set the pace for development, deployment and delivery of networking systems and infrastructure. Develop and prepare project documentation, process maps, presentations and tracking reports to provide detailed current status of each project.</li>\n<li>Use technical judgment to drive project delivery, technology reviews, challenge proposals and build consensus.</li>\n<li>Analyze numerical network performance and system performance data and translate into recommendations and actionable plans. Provide strong quantitative analysis focus, requiring interpretation of technical and commercial information from structured and unstructured sources.</li>\n<li>Present your team&#39;s analyses and recommendations to internal stakeholders, including executive management.</li>\n</ul>",
    "title": "Technical Program Manager, Network Capacity Engineering"
}