{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Cambridge, MA, USA; Chicago, IL, USA; San Francisco, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfKRPE5BE9GHznHXMuc9TReRJBbY5Ohs4xbrW6bBvfsSOgASYQ8w16uwcOiN-3FFCI_UP9e_EoYiX_3MRkq6JBN9YvxSVt-W-O4l-6hpDOU5l75J_98Q0DAEEdY%3D_V2&jobTitle=Instructional+Designer%2C+Sales+Capabilities&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-25T11:01:40.935Z",
    "description": "<p>As a member of the Sales Capabilities team, you will be critical to helping our Sales teams succeed. You will work as part of your team to deliver excellent product training in a creative and exciting way. You will develop innovative and engaging training programs at scale and customize where appropriate (e.g., for role, location, situation). In addition to this, you&#39;ll also partner with content and skills experts to bring a cohesive development experiences to our Global Business Organization (GBO) Googlers.</p><p>The Business Strategy and Operations organization provides business critical insights using analytics and ensurers cross-functional alignment of goals and execution, helping teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/120471988201235142",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-03-15T21:01:55.577Z",
    "publish_date": "2019-03-15T21:01:55.577Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Instructional Design, related field or equivalent practical experience.</li>\n<li>5 years of experience designing, developing and testing e-learning content.</li>\n<li>Experience developing original learning products in HTML5 or other development languages/environments.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Industry certifications in learning sciences, instructional design, curriculum development, performance improvement, project management, or content-specific certifications as appropriate (CPLP, CPT, PMP, etc).</li>\n<li>Experience as a learning partner/consultant.</li>\n<li>Experience in a sales role, with in the digital marketing industry.</li>\n<li>Proficiency using G suite applications (e.g. Gmail, Docs, Sheets, Slides).</li>\n<li>Developed design thinking skills.</li>\n<li>Demonstrated project management skills. Developed editing, writing, and presenting skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Act as a learning Consultant to understand the business&#39; needs around learning and help connect learning strategies</li>\n<li>Use design thinking principles to frame opportunities, explore solutions, and help decide on which solution and why</li>\n<li>Design and develop learning experiences to support our sellers and the business.</li>\n<li>Ensure that initiatives are measurable in terms of improving the capabilities of sellers and creating learning experiences.</li>\n</ul>",
    "title": "Instructional Designer, Sales Capabilities"
}