{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Austell, GA, USA; Council Bluffs, IA, USA; Clarksville, TN, USA; Midlothian, TX, USA; The Dalles, OR 97058, USA; Henderson, NV, USA; Lenoir, NC, USA; Moncks Corner, SC 29461, USA; Pryor, OK 74361, USA; Reston, VA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXcbZqagFxCbX_vcB9sa7wxmPjCivEr3BDG6woau2dUSOgASYQ8wvtBLNzLqH8bLkuAiCXuF3N7kYfA5Lnw1ZXM61fR-i28T8I36BuJCl3H0HSvfXFtMmO72Gw4%3D_V2&jobTitle=Technical+Program+Manager%2C+End+to+End+Design+Safety&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T17:31:48.070Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As the End to End Design Safety Technical Program Manager, you will provide leadership in the development of Environmental Health and Safety (EHS) programs that enable our teams to work safely and efficiently. You will engage with all levels of employees and leadership to design new tools, processes, and procedures to mitigate risks to our workforce and the environments that we operate in. Additionally, you will work with key stakeholders in Data Center R&amp;D and Engineering (DCRE), Deployment Constraint Service (DCS), Data Center Program Management Group (DCPMG), Hardware Operations (HWOps), Data Center Operations (DCOps), and EHS to design a comprehensive strategy that allows leaders to continuously evaluate program risks and opportunities, and then develop work plans to execute on agreed objectives.</p><p> </p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/115007022555898566",
    "location": {
        "address_lines": [
            "Pryor, OK 74361, USA"
        ],
        "city": "Pryor",
        "country": "OK",
        "country_code": "US",
        "display": "Pryor, OK 74361, USA",
        "lat": 36.3084275,
        "lon": -95.31691359999999,
        "post_code": "74361"
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&size=1168x324&zoom=12&signature=wBSgk2TEZrwkDu4v0aywYosZY7M=",
        "large_2x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&scale=2&size=1024x324&zoom=12&signature=zieax8Z3lz-tZ087C-jxNAqGy6I=",
        "small_1x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&size=600x400&zoom=12&signature=fvxytqlJNSmyDQi8pUBBp0tqgMo=",
        "small_2x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&scale=2&size=600x400&zoom=12&signature=tWVweYC6BE6BymiC8gbffn6uwTU="
    },
    "modified": "2019-02-27T19:49:12.486Z",
    "publish_date": "2019-02-27T19:49:12.486Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Occupational Health and Safety, Environmental Science, Engineering, or equivalent practical experience.</li>\n<li>6 years of experience in Environmental Health and Safety design or engineering.</li>\n<li>Experience evaluating safety in engineering and design solutions and implementing systems to manage and track risk. Experience designing and constructing buildings or industrial systems.</li>\n<li>Ability to travel up to 25% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in Safety, Mechanical, or Electrical Engineering.</li>\n<li>Ability to identify key challenges and gather and analyze large complex data sets to support hypotheses and develop actionable recommendations.</li>\n<li>Experience implementing EHS needs in the design of data centers.</li>\n<li>Ability to create workable project plans with project scope and execute on such plans.</li>\n<li>Knowledge of Data Center Operations, Facilities Management, Engineering, and Construction.</li>\n<li>Excellent project management, analytical, data quality troubleshooting, and data-driven problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Formulate strategy for providing end-to-end safety reviews on Google Data Centers (GDC) product/process designs.</li>\n<li>Work with key stakeholders to identify business requirements and build a strategies for achieving key objectives. Manage multiple programs and initiatives and report back regularly to leadership on progress and milestone accomplishment.</li>\n<li>Work with other Program Managers to explore new innovative EHS technologies and evaluate potential for integration with existing and future business processes.</li>\n<li>Evaluate EHS risks for DCOps, HWOps/Platforms, and other GDC functions and products/processes and implement solutions to address them. Build tracking system to measure impact of design safety improvements.</li>\n<li>Travel up to 25% of the time.</li>\n</ul>",
    "title": "Technical Program Manager, End to End Design Safety"
}