{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX3ZdUzGe6lLY0MAdBc2nbcDKrPIgTQznJQZvAwNBCUSOgCPMA3Tm17z85NHjAW7sV6SKWCP_osiFW6d_oakwiZj6Nfoxg9sPzp_kEvCNx3AMZjFOAGNj1LpAKs%3D_V2&jobTitle=Marketing+Analytics+Manager%2C+YouTube&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-12T18:31:38.897Z",
    "description": "<p>As a Marketing Insights Manager at Google, you develop and implement research studies that provide foundational learning to inform business/product strategy, product development, as well as insights/measurement to inform and measure GTM (go-to-market) strategy and campaigns. You understand consumers, and have the ability to link insights to strategy and translate complex ideas into simple and intuitive communications. You are also a thought leader who is curious and passionate about data. You know how to get the best out of vendors/agencies and you manage workload by balancing future logistical and strategic needs.</p>\n\n\n<p>At YouTube Marketing, every consumer touchpoint begins with a clever insight and ends with thoughtful measurement. \n</p>\n\n\n<p>In partnership with other YouTube Insight Managers, this position plays a pivotal role in helping to shape the future of marketing at YouTube and how we connect with our consumers across a suite of exciting products, including YouTube TV, YouTube Music and YouTube Originals.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5987966809997312",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-05T07:52:28.381Z",
    "publish_date": "2019-02-27T19:38:29.166Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of client side analytics and measurement experience.</li>\n<li>Experience with both offline and digital media tactics, and associated analytics to tie back to campaign ROI.</li>\n<li>Experience working with data sets and data-driven decision making.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Research experience at a media company or media agency in the online/tech space.</li>\n<li>Experience taking datasets and synthesizing them into apps or dashboards.</li>\n<li>Experience working with data sets and data-driven decision making.</li>\n<li>Ability to link insights to strategy and translate complex ideas into simple and intuitive communications.</li>\n<li>Ability to operate in a fast-paced, constantly evolving and collaborative environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead all aspects of campaign and performance analytics, including the collection of internal data and managing of vendor studies, visualizing the results, and sharing data and insights across subscription products.</li>\n<li>Be excited about evolving and designing new analytical capabilities and reporting innovation, including designing control and exposed studies.</li>\n<li>Understand analytical approaches to identify causation not just correlation.</li>\n<li>Extract and tie together insights from both behavioral and attitudinal data, in order to shape understanding of the consumer experience.</li>\n<li>Encourage our research methodologies and our agencies to produce impactful work, driving innovative approaches and creating strong partnerships for powerful results.</li>\n</ul>",
    "title": "Marketing Analytics Manager, YouTube"
}