{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Redwood City, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQSkcou8qbs9F7qNkt0aefswvjBZa7IXkC86hlsfWi0SOgASYQ8wiyDpsr_-oOJE_i6W0003EB_9baPuNsdbK5dehpop-irowdhyT1_8s8wqLPNJnp4t_x0B36w%3D_V2&jobTitle=Scaled+Account+Strategist%2C+Agency+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-04T17:31:54.016Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p>The Google Customer Solutions (GCS) Agency Sales team works with our agency partners to develop their business globally, and leverage Google’s advertising solutions to make them successful online. In a scalable way, we are responsible for GCS Sales advertising business growth by educating, promoting solutions and consulting with agencies directly. In this role, you&#39;ll be proactive, motivated, team-oriented and enthusiastic about our fast-paced environment.</p><p>As a Google Customer Solutions (GCS) Agency Scaled Account Strategist, you&#39;ll work with our Agency partners to drive customer success, long-term business sustainability and growth at scale. You&#39;ll develop relationships with Account Managers at our Agency partners, provide them with insightful product adoption recommendations, and identify promotion opportunities. You will also collaborate with our GCS Agency team members to deliver a consistent and outstanding experience to our Agency partners.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/114132464537871046",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-04T17:31:54.016Z",
    "publish_date": "2019-03-04T17:31:54.016Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>Authorization to work in the United States.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience with Google Ads and account optimization.</li><li>Proven ability to multi-task and manage multiple projects at a time while paying attention to detail.</li><li>Proactive, independent worker with the demonstrated capacity to lead, motivate and work well with others.</li><li>Interest in working against an assigned quota.</li><li>Excellent written and verbal communication skills.</li></ul>",
    "responsibilities": "<ul><li>Work towards assigned goals while prioritizing and delivering an excellent customer experience to Google&#39;s agencies and advertisers.</li><li>Implement creative ways to improve our agency and customer relationships, tailor and share performance-enhancing suggestions, and promote other Google products.</li><li>Communicate with agencies and customers proactively via phone, email, and direct contact.</li><li>Provide strategic advice and help our advertisers get the best ROI on their advertising investment by working closely in a consultative role with Agency Account Managers.</li><li>Grow agency business via driving scaled product adoption and growth.</li></ul>",
    "title": "Scaled Account Strategist, Agency Sales, Google Customer Solutions"
}