{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX9i9aJiCxW0F9QNzqcxaLjDss6BvFhGn318JQ0qR7gSOgCPMA3TOsIU2a1oVGEt8-nyH7fO-5pnw1xEXF2XXBDpkfT24Z8pm4Zauqem2KPCBaZBhYJGouhe2P4%3D_V2&jobTitle=Account+Strategist%2C+Mid-Market+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-29T20:31:48.826Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Google Customer Solutions (GCS) sales teams are trusted advisors who maintain a relentless focus on customer success by bringing the best Google has to offer. The GCS Mid-Market Sales team is a critical growth engine for clients in GCS. Through long-term relationship development, we are dedicated to understanding the business goals and dreams of this segment and providing the best Google advertising solutions to drive business success. We are responsible for growing advertising business growth by educating, promoting solutions and consulting with clients directly.</p>\n\n<b>This role may also be located in our Playa Vista, CA campus.</b><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5380031375015936",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-02-27T19:47:07.367Z",
    "publish_date": "2019-02-27T19:47:07.367Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of sales/account management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with advertisers, agencies and/or clients and influencing C-level stakeholders.</li>\n<li>Knowledge of traditional and online marketing strategy and tactics. Demonstrated thought leadership and high executive functioning within the digital marketing space.</li>\n<li>Demonstrated ability to achieve quotas to drive growth.</li>\n<li>Demonstrated ability to build compelling narratives and utilize storytelling as a client engagement strategy.</li>\n<li>Ability to manage a portfolio in an advertising or media sales context.</li>\n<li>Ability to strategically assess and solve client needs via sales techniques, including effective questioning and objection handling.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a portfolio of GCS businesses by thoroughly understanding growth drivers, identifying opportunities for growth, managing risks and creating multi-quarter plans for achievement.</li>\n<li>Collaborate within the sales team, aligning workflow among team members to execute on a plan and ensure accountability to meet or exceed goals while prioritizing and delivering outstanding customer experience to meet advertiser’s goals.</li>\n<li>Communicate with customers proactively via phone, email and in person. Share and collaborate with specialists, engineers and product team members on new feature development.</li>\n<li>Implement creative ways to improve our customer relationships, tailor and share performance-enhancing suggestions and promote other Google products.</li>\n<li>Identify key client stakeholders and consult with customers proactively to support annual digital marketing discussions and budgets.</li>\n</ul>",
    "title": "Account Strategist, Mid-Market Sales, Google Customer Solutions"
}