{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQcrMZSTE_FNMn2q4whSz6twmiBDdu21HLWeS1hB8R4SOgASYQ8wjEZlFj2MEWNr14nxPjMAhS3xIc6VqEFDO4mrIql0PhzRFN1CY3PlHwk2zPRoQKaUL3uIZCI%3D_V2&jobTitle=Artist+Relations+Manager%2C+YouTube+Music&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-19T15:01:38.299Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. The Partnerships team is responsible for seeking and exploring new opportunities with Google&#39;s partners. Utilizing your business acumen and extensive product knowledge, you are right on the front line of interacting with our partners, and helping them find ways to grow using Google&#39;s newest product offerings. Your knowledge of relevant verticals and relationships with key industry players will help shape our great applications and content for products such as YouTube Music and Google Play.</p><p>As an Artist Relations Manager, you will be responsible for courting, building and maintaining YouTube’s relationships with artists in the Latin music space. This includes fostering their engagement on the platform and use of our tools and resources as well as guidance on growing their audience, and partnering with YouTube/Google in ways that are mutually beneficial. In this role you will interact regularly with managers, agents, labels within the industry that represent artists, facilitating ongoing platform engagement, imparting knowledge of how best to use YouTube to grow audience, advising on operational processes, resolving inquiries, and identifying and driving mutual business growth opportunities. You will have relationships in the music industry as well as skills that enable you to excel in cross-functional work flows.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142704959020769990",
    "location": {
        "address_lines": [
            "Miami, FL, USA"
        ],
        "city": "Miami",
        "country": "FL",
        "country_code": "US",
        "display": "Miami, FL, USA",
        "lat": 25.7616798,
        "lon": -80.1917902
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&size=1168x324&zoom=12&signature=KxULmmyHFs6poR-lcTBAaX4ijn8=",
        "large_2x": "/maps/api/staticmap?center=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&scale=2&size=1024x324&zoom=12&signature=2qgzsGqRtH1SI4OCsLqYtUKmdMI=",
        "small_1x": "/maps/api/staticmap?center=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&size=600x400&zoom=12&signature=bSjz8fsqadGzMezjxZN-E6JBuOE=",
        "small_2x": "/maps/api/staticmap?center=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1450+Brickell+Ave+Ste+900+Miami+FL+33131%2C+USA&scale=2&size=600x400&zoom=12&signature=Pd9NPAVqAjy4QPose8oc67REIVo="
    },
    "modified": "2019-03-05T21:01:47.827Z",
    "publish_date": "2019-03-05T21:01:47.827Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience working directly with a variety of artists and their representatives, with a focus on Latin music.</li>\n<li>Experience working cross-functionally across a large business.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in any of the following: artist management, label product management, artist relations, and/or artist marketing, with specific focus in Latin music.</li>\n<li>Experience handling high stress situations with creative individuals and remaining focused on accomplishing the task at hand.</li>\n<li>Excellent attention to detail, with ability to coordinate multiple simultaneous artist activities.</li>\n<li>Service mindset; ability to act quickly and effectively to cultivate artist satisfaction with our engagement and to make our relationship impactful and successful for both YouTube and the artists.</li>\n<li>Exceptional communication and interpersonal skills, with ability to take initiative and build productive relationships externally and internally.</li>\n</ul>",
    "responsibilities": "<ul><li>Lead day-to-day artist relationships and program management, working high touch with a targeted set of artists and their representatives.</li><li>Collaborate cross-functionally to select artists we work with, prioritize and set expectations both internally and externally related to how we can develop mutually beneficial partnerships.</li><li>Work cross-functionally with internal stakeholders to establish programs for artists, including performances and content productions.</li></ul>",
    "title": "Artist Relations Manager, YouTube Music"
}