{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZkVXvTR784M5_HpRt-zDqmFQRrLhG-3gKnGxL8OSF0SOgCPMA3TPQTe64zaEEF6hiVjdJdv4Kip9X7UQIAfKUAyfqOO2EFOvgKk80gXJZMEjk2efNC60vKHHX0%3D_V2&jobTitle=Front+End+Software+Engineer%2C+YouTube&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:02:29.182Z",
    "description": "<p>YouTube&#39;s software engineers develop the next-generation technologies that change how millions of users connect, explore, and interact with information and one another. Our ambitions reach far beyond just Search. Our products need to handle information at the scale of the web. We&#39;re looking for ideas from every area of computer science, including information retrieval, artificial intelligence, natural language processing, distributed computing, large-scale system design, networking, security, data compression, and user interface design; the list goes on and is growing every day. As a software engineer, you work on a small team and can switch teams and projects as our fast-paced business grows and evolves. We need our engineers to be versatile and passionate to take on new problems as we continue to push technology forward.\nWith your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5590805127561216",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T00:31:56.516Z",
    "publish_date": "2019-03-07T00:31:56.516Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS in Computer Science or related technical field or equivalent practical experience.</li>\n<li>Experience with AJAX, HTML and CSS.</li>\n<li>Experience with JavaScript, C++, or Python.</li>\n<li>Web application development experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript, or Go.</li>\n<li>Experience developing or designing large software systems.</li>\n<li>Experience in GWT and Flash.</li>\n<li>Understanding of the principles of accessibility and ability to build products that are accessible to users with disabilities.</li>\n<li>Strong written and verbal communication skills, with the ability to create strong working relationships with cross-functional teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design, implement and launch highly-visible, partner and end user-facing features.</li>\n<li>Develop new ways for YouTube partners to manage and monetize content.</li>\n<li>Design and develop large scale web applications.</li>\n</ul>",
    "title": "Front End Software Engineer, YouTube"
}