{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdu8sJKXF-0s9pT9tw7Q1MI2XAvny8dRyKYe_Ry5Dj8SOgCPMA3T8QSXEX7OR7d_OeJ1lupbChZ8EYYh_Yvp9c-Jvji9SOvzme2i3y78hhz9DYbHVgaGQcVLE_k%3D_V2&jobTitle=Brand+Marketing+Manager%2C+Consumer+Apps+Marketing&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:32.044Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n<p>You are a creative, strategic, hands-on maker, who will define the future of our products and the way we communicate them to our users. In this role, you will have the opportunity to work across a wide-range of consumer products, including the Google Assistant, Duo, Search, Maps, Photos and News. You will take part in a complete marketing experience — from determining positioning, naming, competitive analysis, and external communications. You will help shape the voice of our products and help them grow a loyal consumer base. \n</p>\n\n<p>You will work with a cross-functional team across Product, Corporate Communications, Legal, Business Development, Media and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5165429540716544",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:42:33.213Z",
    "publish_date": "2019-02-27T19:42:33.213Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience working in brand, creative, marketing and business-building with responsibility in driving brand strategy and creative execution.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with hands-on development of creative campaigns, such as reviewing creative, directing agency partners, developing best-in-class toolkits and executing brand marketing tactics.</li>\n<li>Ability to build strong, collaborative relationships with a diverse range of partners and to influence at multiple levels of the organization.</li>\n<li>Strategic understanding of brand architecture, brand development, brand management, insights development and marketing processes.</li>\n<li>Strong analytical and communication skills; ability to work with unstructured information and data to influence business decisions.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with a team of strategists, creatives and marketing managers to help define, develop and deliver campaigns for our key products.</li>\n<li>Work with a diverse cross-functional team to identify root issues and develop cohesive, long-term strategies that leverage the best of Google.</li>\n<li>Ensure that the cross-company efforts connect to clear and powerful narratives that resonate with key audiences.</li>\n<li>Track and demonstrate progress against our efforts and goals through a compelling use of data and poignant storytelling.</li>\n<li>Drive ad hoc projects that require strategic leadership and quick attention, including naming, brand point of views, creative briefs, positioning work, architecture development and challenges that don’t fit neatly in existing guidance.</li>\n</ul>",
    "title": "Brand Marketing Manager, Consumer Apps Marketing"
}