{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRTh09Ozahxuwm6n8y4CCi-6CTf-z-ReZena9LdiCdkSOgCPMA3TJwWU4Wi-yu6ZEqYAGZJ_KfFG3Is_YJDDaTDTXue7R8ZvEQwlUr6KIRqlX0hmFYrrNXDcCpM%3D_V2&jobTitle=Product+Manager%2C+Pixel+Power+and+Battery&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-07T16:31:34.953Z",
    "description": "<p>At Google, we build products that organize the world&#39;s information and make it universally accessible to our users. These products are the lifeblood of who we are. As part of the Product Management team, you work closely with our engineers to guide products from conception to launch. You connect the technical and with the business, working with teams across Engineering, Sales, Marketing and Finance. With your technical expertise, you identify a project’s setback and generate solutions for resolving them quickly. As a Product Manager, you help shape the future of Google products.</p>\n\n<p>Our team is a fast moving group of engineers, designers, product managers (PMs), and research scientists tasked with building excellent mobile devices and services. As a Pixel Product Manager (PM), your primary focus will be to define, build and deliver an excellent mobile experiences for our users. You will connect the technical with the business, working with teams across Engineering, UX, Industrial Design, Operations, Sales, Marketing, and Finance. Additionally, you will be responsible for planning the experiences and features that will define Pixel phones in coming years as they relate to battery life and power usage, develop an understanding of technology areas, and build relationships to meaningfully move the Pixel user experience forward.\n</p>\n\n<p>As a PM, you will play a central role in improving the battery life of our Pixel phones. You will plan the hardware and software roadmap and associated experiences, driving actionable insights from power data, defining and shipping differentiating power features, motivating vendors to meet Pixel’s goals, partnering with first-party apps on power optimizations, and managing the charging roadmap. You will maintain continuous collaboration with internal engineering, original equipment manufacturer (OEM) partners and product teams in both hardware and software, as well as deep engagements with critical suppliers in each component vertical. Additionally, you will work closely with cross-functional teams and shape technical specifications and product requirements for future devices, joining a small but high-impact product team that is striving to raise the bar on mobile computing. You will contribute experience and technical understanding in hardware and software product management, as well as experience working in the device power space, within a fast-paced, high-growth, and often ambiguous environment.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6592889272860672",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:54:00.433Z",
    "publish_date": "2019-02-27T19:54:00.433Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Electrical Engineering, Computer Science, related technical field, or equivalent practical experience.</li>\n<li>3 years of experience in product management and/or an engineering role, launching consumer products.</li>\n<li>2 years of experience working in consumer electronic device power/battery.</li>\n<li>Experience across the concept phase all the way to market introduction and with all aspects of product development, including design, prototyping, engineering, testing, shipping, and bringing to market.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>Experience in consumer hardware development, software development, CE manufacturing, and hardware supply chain.</li>\n<li>Experience in consumer hardware development life cycles and ODM/CM working models.</li>\n<li>Experience driving numerous parallel initiatives, with excellent attention to detail and execution.</li>\n<li>Ability to lead initiatives internally and externally and communicate effectively with executive management and key decision-makers, demonstrating excellent communication and interpersonal skills.</li>\n<li>Ability to travel.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage planned experiences and technologies to improve battery life and power performance in Pixel phones based on long-term product vision, user needs, and technical and market trends.</li>\n<li>Manage the feature execution by working closely with Engineering, software and electrical, Research and Development (R&amp;D), Industrial Design, Product Design, and first-party app teams to engineer the best mobile experience for our users and resolve nuanced product tradeoffs.</li>\n<li>Collaborate with Device PMs on plans to ship new features, including driving mechanical design, color, material and finishing (CMF), and production decisions as part of the product development lifecycle.</li>\n<li>Partner with marketing and retail teams to align roadmaps with consumer and partner trends and values.</li>\n<li>Partner closely with PM teams across Google to understand their product priorities and drive improvements that relate to Pixel’s power consumption.</li>\n</ul>",
    "title": "Product Manager, Pixel Power and Battery"
}