{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf7jBVvvi2qIyEkkeavlRU31zMpAbOQsR0tGsJ75xWkSOgCPMA3TQS9jXKBe1zJuvsQlu6asDX6X0L3bBgStwQPrVgT_pe8qrP3oRT6phS-9raNgAIiCtwQqi3A%3D_V2&jobTitle=Manager%2C+Systems+and+Network+Engineering&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-17T17:02:14.593Z",
    "description": "<p>Systems Administrators embrace Google&#39;s motto to ensure millions of users can access the world&#39;s information without a glitch. As a Systems Administrator at Google, you own and support the needs of one of Google&#39;s server infrastructure systems. You&#39;re highly technical and work directly with other server and service owners to ensure reliability and sustainability of the Google service infrastructure as well as compliance with internal policies. Success in this role means you are able to support servers in a mixed operating system environment and work efficiently with our internal technology providers as well as other operations groups. Googlers rely on your guidance when it comes to design decisions so you&#39;ll have a direct impact in keeping the business productive.</p>\n\n<p>As a Manager in Google&#39;s Edge operations, you will be a technical mentor and people manager for a diverse team, helping mold the team structured of teammates who deploy, build, monitor, maintain, and enhance Google&#39;s edge infrastructure, including the Google Global Cache. You will anticipate future operational requirements, while ensuring the smooth running of a globally distributed infrastructure and software systems supporting the needs of Google&#39;s Edge. In this role, you will cover and participate in a full range of tasks, including systems design, operational implementation and maintenance, and business partner support of automation and workflows. Additionally, you will travel once or twice a year to international locations for collaboration with adjacent teams in Europe and Asia. </p>\n\n<p>As a technical manager of systems administrators working on Google&#39;s Edge Delivery and Networking Infrastructure, your mission will be to ensure Google is always fast, available, scalable, and engineered to withstand high demand. You will operate and develop systems to run Google services such as Search and YouTube, in addition to managing the production services that will drive the performance and reliability of Google.com to the Internet. You will also partner with global ISPs and telecommunications providers to guarantee the performance and reliability of our critical content serving infrastructure. In this role, you will participate in and lead strategic projects that span multiple domains with the goal of improving operational efficiency and creating design solutions for third-party technology limitations. You will help your teammates refine their technical skills, by leading brown bag sessions or tech talks, and act as the final escalation point for issues.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4601004320292864",
    "location": {
        "address_lines": [
            "Thornton, CO, USA"
        ],
        "city": "Thornton",
        "country": "CO",
        "country_code": "US",
        "display": "Thornton, CO, USA",
        "lat": 39.8680412,
        "lon": -104.9719243
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&size=1168x324&zoom=12&signature=9dEqSci3OSgB3hrvks2DjWpPm-0=",
        "large_2x": "/maps/api/staticmap?center=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&scale=2&size=1024x324&zoom=12&signature=XDM-hcUPejl-dCaU50SYUKrg9eQ=",
        "small_1x": "/maps/api/staticmap?center=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&size=600x400&zoom=12&signature=Yx1LpM2RsicGSJUmueaHIAuNk3U=",
        "small_2x": "/maps/api/staticmap?center=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=12396+Grant+St%2C+Thornton%2C+CO+80241%2C+USA&scale=2&size=600x400&zoom=12&signature=j2pqrZEgf-kr7I_QCqvp6HXlEcs="
    },
    "modified": "2019-03-18T12:28:11.416Z",
    "publish_date": "2019-02-27T19:54:32.566Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field, or equivalent practical experience.</li>\n<li>5 years of experience in technical support, professional services, engineering, sustaining engineering, or systems engineering.</li>\n<li>2 years of experience in people management.</li>\n<li>Experience implementing, troubleshooting, and supporting Linux/Unix operating system, Internet-based applications, and web servers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in programming/scripting with C++, Java, Python, Perl, JavaScript, Shell.</li>\n<li>Knowledge of TCP/IP networking.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a small teams as part of a distributed operations team of system administrators and tech leads/managers, who monitor performance and investigate anomalies in the system and resolve issues with Google’s content delivery network (CDN).</li>\n<li>Engage and retain motivated employees that grow with the organization.</li>\n<li>Identify challenges and drive cross-functional solutions, continuously increasing operational efficiency.</li>\n<li>Mentor engineers on career development and performance improvement.</li>\n<li>Provide operations and technical input to the broader team in the area of network engineering.</li>\n</ul>",
    "title": "Manager, Systems and Network Engineering"
}