{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfBLDfnjyUVi5h-cxPPqoB3lZcxYwacXlXWCWwcllrkSOgASYQ8wzcJYDMd5B3xaRkWMzYanNakFwNA_RtkY9myeKIzoyNfbMfL8leaT_dos3Z0Cj51QehAFThY%3D_V2&jobTitle=Product+Marketing+Manager%2C+Local+Guides+-+New+York&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T15:32:08.619Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>As a Product Marketing Manager on the Google Local Guides Marketing team, you will help develop the global community and expand the Google Local Guides consumer brand. You will be focused on a series of brand and social initiatives, catering to Google Maps contributors in priority markets. This includes executing brand-building campaigns, compiling and reporting on team-wide successes, supporting experiential activations, and working cross-functionally with a team of content strategists to create branded touch points that promote Google Local Guides.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/91283344823591622",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-08T15:32:08.619Z",
    "publish_date": "2019-03-08T15:32:08.619Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in brand marketing, marketing communications, or digital advertising.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience developing concepts and managing production for video ads.</li>\n<li>Experience in product positioning, narrative, and collateral development.</li>\n<li>Ability to understand complex products and manage multiple work streams simultaneously through to completion.</li>\n<li>Exceptional cross-functional project management skills.</li>\n<li>Outstanding presentation and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Execute on our strategy to drive awareness of Google Local Guides branded content as a trusted resource for quality information.</li>\n<li>Ensure brand consistency and accuracy in global program emails and videos, escalating issues as needed.</li>\n<li>Act as brand steward, evaluating and managing incoming marketing requests to engage with the Local Guides community.</li>\n<li>Coordinate with community team stakeholders to build out a network of exemplary Local Guides to feature in campaigns, press, and other brand moments.</li>\n<li>Coordinate with growth market stakeholders, manage talent relationships, and report on performance.</li>\n</ul>",
    "title": "Product Marketing Manager, Local Guides - New York"
}