{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRg6AultvJjvdG7uM4nVz5JZlzhRKICgmyO_-ldeBtsSOgCPMA3TwFlxiHi7N7zJL4kQ2wCnMNNmvgspjNkhpi4t9I6R40I7QIISqzWePDb0JM7kYME3x_gXqVE%3D_V2&jobTitle=Product+Marketing+Manager%2C+Small+Medium+Business+Marketing&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-28T00:31:31.787Z",
    "description": "<p>&lt;p&gt;Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.&lt;/p&gt;</p><p>&lt;p&gt;The Small Medium Business (SMB) Marketing team is dedicated to delivering an experience to our advertising customer, offering programs that create value for their businesses. As a Product Marketing Manager, you’ll work closely with cross-functional teams (Product Marketing and Sales), and outside vendors, to develop integrated programs and strategic value adds (SVAs) for our advertising partners and end-customers. As a strong Project Manager, you’re comfortable juggling multiple priorities and managing input and expectations across key stakeholders. You are a self-starter who can work in a rapidly-changing industry, tolerate ambiguity, and drive collaboration through influence.&lt;/p&gt;</p><p><br></p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6430780709076992",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:47:52.835Z",
    "publish_date": "2019-02-27T19:47:52.835Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelors degree or equivalent practical experience.</li>\n<li>5 years of marketing experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>5 years of partnership marketing experience with experience working with high-value agencies.</li><li>Experience collaborating with cross-functional stakeholders, external vendors and agencies.</li><li>Demonstrated ability working with customers/agencies, to deliver insights-driven strategies and plans. Demonstrated ability to apply data in driving strategy, prioritizing, and making decisions and recommendations.</li><li>Knowledge of Google’s ad solutions and their positioning.</li><li>Strong communication and interpersonal skills with an ability to influence at executive levels. Possess sound business insight and strategic skills.</li><li>Distinctive problem-solving, strategic and analytical capabilities. Demonstrated capacity to roll out complex, data-driven growth marketing campaigns and tests.</li></ul>",
    "responsibilities": "<ul>\n<li>Own the Americas SVA strategy and execution in partnership with cross-functional teams (Sales, Central and Local Marketing).</li>\n<li>Act as the voice of our partners. Conduct research to identify and prioritize the insights and trends informing our offering both the gaps and opportunities; short and long term.</li>\n<li>Drive awareness and adoption of our SVA portfolio among Google’s advertising partners. Report out on results, and drive a continuous testing and iteration process to increase the impact of the SVA program.</li>\n<li>Own cross-functional relationships with Sales, Central Marketing, and Local Marketing across all levels of seniority.</li>\n<li>Manage our business growth targets and identify opportunities to increase the business growth impact of our SVA programs in partnership with cross-functional teams.</li>\n</ul>",
    "title": "Product Marketing Manager, Small Medium Business Marketing"
}