{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYR_Eb34_v0YjLGLPUoSWCu-I_zxz_inuocD8je67BcSOgASYQ8wJuG37M4sbxcfFKZZ6iyqjdQvtbBBl9Rr1Pu1ALbnM2KDKIvdyWYXdNX5x0GGaGc3D0FSkpQ%3D_V2&jobTitle=Group+Product+Manager&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-24T14:31:35.002Z",
    "description": "<p>At Google, we put our users first. From innovative software products like Gmail, YouTube, Chrome, Street View to pioneering mobile devices like the Android, we build products that organize the world&#39;s information and make it universally accessible to our users. Google products are the lifeblood of who we are. The Product Management team works closely with our engineers to guide products from conception to launch, and with our business partners to generate profitable business growth streams. As part of the Product Management team, you bridge technical and business worlds as you design technologies with creative and prolific engineers and then zoom out to lead matrix teams such as Sales, Marketing and Finance, to name a few. You have a bias for action and can break down complex problems into steps that drive product development at Google speed. As a Product Manager, you can be part of shaping Google&#39;s next game-changer.<br><br>Through your leadership, you&#39;ll leverage your technical expertise to identify setbacks and roadblocks within a project and generate solutions for resolving them quickly, build and manage a product team to recruit the best-suited engineers, and evaluate feedback from support teams to identify product errors and gaps. You&#39;ll also work closely with senior Googlers in support of your product.</p>\n\n<p>You will be responsible for developing solutions and implementing requirements to support the growth of Google monetization products worldwide. This includes launching products and working closely with Engineering and other product areas to define the right structure to support our products.</p><p>One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. With eyes focused squarely on the future, our team works closely with creative and prolific engineers to help design and develop technologies that improve access to the world&#39;s information. We&#39;re responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting and tailoring our solutions to all the markets where Google does business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4667262638260224",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:50:42.330Z",
    "publish_date": "2019-02-27T19:51:40.951Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Electrical Engineering, Mathematics, Statistics, a related technical field or equivalent practical experience.</li>\n<li>12 years of product management experience.</li>\n<li>Experience in product design with a focus on software products and technologies.</li>\n<li>Experience developing internet products and technologies to define technical product features.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Science or Business.</li>\n<li>Experience with managing products for software developers.</li>\n<li>Product experience with large-scale systems.</li>\n<li>Development experience using various desktop and mobile app frameworks.</li>\n<li>Knowledge of multiple functional areas, including product management, engineering, UX/UI, sales, customer support, finance or marketing. Understanding of go-to-market commerce enablers (e.g., payments, loyalty, subscriptions, etc.).</li>\n<li>Ability to achieve strategic goals and evolve product strategy based on research, data and industry trends in an innovative and fast-paced environment. Excellent problem-solving, organizational and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage closely with the Engineering team to help determine the best technical implementation methods as well as a reasonable implementation schedule.</li>\n<li>Understand customer needs and gather product requirements. Identify market opportunities and define product vision and strategy.</li>\n<li>Launch and develop new products on a regular basis.</li>\n<li>Design and drive the overall vision and product strategy to a coherent whole.</li>\n<li>Manage internal partnerships and external partners to optimize growth.</li>\n</ul>",
    "title": "Group Product Manager"
}