{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Seattle, WA, USA; New York, NY, USA; Chicago, IL, USA; Kirkland, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYpKGJChISVLQCed4AqVLn1Vsv9MnCwLaUw2P_uz2cQSOQCPMA3TsZQvy6l5jD5WvQXtNjJBlal7ohv0PDkxo_UQyZEKxpTOtL70WHnw3U_kxy1R64pQj0MxHA%3D%3D_V2&jobTitle=G+Suite+Strategic+Cloud+Engineer%2C+Google+Professional+Services&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:32:48.959Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>As a Strategic Cloud Engineer, you will ensure that customers have the best experience moving to Google Cloud and G Suite products. You are responsible for providing architectural guidance, technical solutions, managing relationships with customer’s technical staff and enabling our Google Cloud partners. You&#39;ll lead deployments, implementations and integrations with a variety of our platforms and product lines. As a technical expert with an entrepreneurial drive and passion for client management, you balance business and partner needs with technical constraints. You will also continuously engage with the community of strategic customers and partners with a goal of enabling their success through driving relationships and more efficient integrations.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5248957824565248",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:41:51.363Z",
    "publish_date": "2019-02-27T19:41:51.363Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science, Mathematics or related technical field, or equivalent practical experience.</li>\n<li>Experience writing scripts in one or more languages such as Python, Go and/or similar.</li><li>Experience managing internal or client-facing projects to completion; experience troubleshooting clients&#39; technical issues; experience working with engineering teams, sales, services, and customers.</li>\n<li>Travel up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with hosted services and/or multi-tenant cloud infrastructures.</li>\n<li>Experience with email administration, routing and hygiene with industry standard products.</li>\n<li>Understanding of common enterprise directory administration systems such as Active Directory, OpenLDAP, and/or Domino Directory.</li>\n<li>Understanding networking fundamentals and common enterprise networking architectures.</li>\n<li>Familiarity with IT security practices such as identity and access management, device management and data protection.</li>\n<li>Effective customer-facing communication and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Become a trusted technical advisor to customers and overcome complex implementation challenges.</li>\n<li>Create and deliver best practice recommendations, tutorials, blog articles, sample code, and technical presentations adapting to different levels of key business and technical stakeholders.</li>\n<li>Travel up to 30% of the time in-region for meetings, technical reviews and onsite delivery activities.</li>\n</ul>",
    "title": "G Suite Strategic Cloud Engineer, Google Professional Services"
}