{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZxDIWIMmNmvHpW3vbngC_76NelUlwG5YEZcBq_xaU0SOgASYQ8w-gphnbx67RoeNi4DfWgybWm9eSZ8nWt3RRbdzgFhKAAjlAcahPMXKTmn57IMVm-zD6HQe6M%3D_V2&jobTitle=Engineering+Manager%2C+Cloud+Support%2C+Technical+Solutions&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T01:31:40.682Z",
    "description": "<p>The Google Cloud team helps companies, schools, and government seamlessly make the switch to Google products and supports them along the way. You swiftly problem-solve technical issues for customers to show how our products can make businesses more productive, collaborative, and innovative. You work closely with a cross-functional team of web developers and systems administrators, not to mention a variety of both regional and international customers. Your relationships with customers are crucial in helping Google grow its Google Cloud business and in bringing our product portfolio into companies around the world.</p>\n\n<p>As an Engineering Manager, you will engage wit and help employees and organizations around the the world. You will contribute experience in cloud computing to a team that helps small and large businesses, educational institutions, and government agencies discover the wonders of the cloud, and work smarter. Our Product and Engineering teams design and implement solutions for these organizations with custom features, security and support -- all with Google&#39;s philosophy of innovation and ease of use in mind. We are working for leading companies, schools, and government agencies to ease their transition to G Suite. Our team provides engineering solutions and drives innovation for Google Cloud, where customers integrate various Google services such as Google Cloud Platform, G Suite, or Google Maps into their business environments. Customer challenge reports can range from documentation problems to technical issues with customer specific implementations. \n</p>\n\n<p>In this role, you will apply technical experience, develop an understanding of products, and drive enhancements to Google’s services and architecture. Additionally, you will develop your team members into highly skilled engineers who build scalable solutions that assist or automate Cloud Support troubleshooting and communication. Taking input from business leadership, you will develop solutions, and promote the use of customizable platforms while avoid point solutions, so that the business can grow quickly and efficiently at scale. You will also lead operational and engineering excellence within your team, focusing focus on reliable execution.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82681795566281414",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-06T01:31:40.682Z",
    "publish_date": "2019-03-06T01:31:40.682Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>5 years of experience as a manager leading engineering resources.</li>\n<li>Experience in front-end and back-end design and development.</li>\n<li>Experience as an architect for large-scale distributed systems.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience as a software engineer and technical lead working on large-scale products.</li>\n<li>Experience or knowledge of DevOps and site reliability engineering (SRE) concepts.</li>\n<li>Experience in continuous integration and deployment processes, unit tests, and QA automation.</li>\n<li>Understanding of algorithms and data structures.</li>\n<li>Ability to manage and organize multiple-projects across multiple teams.</li>\n<li>Ability to function as a product manager of technically-focused products. Excellent judgment, strategic thinking, and creative problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of engineers delivering reliable and scalable platforms for both customers and internal teams within Cloud Support.</li>\n<li>Act as tech lead where needed, delivering design documents and writing code.</li>\n<li>Deliver long-lasting software solutions in response to point solution requests.</li>\n<li>Enable contributions from technical solutions engineers from across the organization by both mentoring and reducing the barrier of entry.</li>\n<li>Help grow the careers of the engineers by finding and assigning the right opportunities.</li>\n</ul>",
    "title": "Engineering Manager, Cloud Support, Technical Solutions"
}