{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdpq0qlu85SVqpYn6VmwW1aV4FwiwxgX1lui3xudzoYSOgCPMA3TZ9lgqJBTbODy0gwrER2XwZ8iVK_JBVsY2bur6vjmt4Zcyk9Ew6svrOPCXiQnFwqh-QmUSBQ%3D_V2&jobTitle=Data+Center+Facilities+Specialist&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:34:15.464Z",
    "description": "<p>The Data Center team designs and operates some of the most sophisticated electrical and HVAC systems in the world. Facilities Technicians on this team operate, monitor and support all facilities activity at Google&#39;s data centers. You take ownership of the operation and maintenance of water pumps and treatment systems, HVAC, UPS, generators, electrical distribution and control and monitoring Systems. You bring the ideas of our Data Center Engineers to life and develop creative approaches to reducing operational costs while improving efficiencies. You ensure that problems are identified and repaired quickly, that contractors deliver quality services and preventive maintenance, and that safety measures are being performed. In emergency situations or abnormal conditions, you respond to data center performance issues and outages to minimize the recovery time from failures.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "ASSOCIATES_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6099323937030144",
    "location": {
        "address_lines": [
            "Clarksville, TN, USA"
        ],
        "city": "Clarksville",
        "country": "TN",
        "country_code": "US",
        "display": "Clarksville, TN, USA",
        "lat": 36.5297706,
        "lon": -87.3594528
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&size=1168x324&zoom=12&signature=4g7D15gS_KsRZAcPRJBPHshHxPo=",
        "large_2x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&scale=2&size=1024x324&zoom=12&signature=QYWwXS75248qfpdwqfEBBnm8V4Y=",
        "small_1x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&size=600x400&zoom=12&signature=mjzy6xqVL8hvXff8Zn76i9zQc0o=",
        "small_2x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&scale=2&size=600x400&zoom=12&signature=WRLiawPe1x4P6Qs4PKUv_xfNnR0="
    },
    "modified": "2019-03-18T22:51:03.789Z",
    "publish_date": "2019-02-27T19:51:48.113Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Associate&#39;s degree or equivalent practical experience.</li><li>Experience in accounting, managing accounts payable and accounts receivable.</li><li>Experience in project management software.</li><li>Experience in office software applications.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in vendor relationships and contract management.</li><li>Experience providing support for budgeting, forecasting and purchase orders.</li></ul>",
    "responsibilities": "<ul><li>Plan and execute work assignments under varying degrees of supervision.</li><li>Act as the point of contact for small to medium projects as assigned by the Facility Manager.</li><li>Prepare statement of work (SoW) for critical and non-critical facility operations contracts.</li><li>Obtain facilities related vendor price quotes, prepares purchase orders, and reviews/approves invoices.</li><li>Work with support service vendors to resolve conflicts and issues under the direction of the Facility Manager.</li></ul>",
    "title": "Data Center Facilities Specialist"
}