{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke7POEKC5ilyFThagI49qVx4y9bQIcTaPdYfrwYyaO4SOgASYQ8wx49OT6c5hqwyvLq99JnR-oQf8eVgsGOEcmEqLf7nmvqlO25HHELWBkaBSIM4wkdk-ivmhqE%3D_V2&jobTitle=Manager%2C+Strategic+Onboarding&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T19:02:07.538Z",
    "description": "<p>gTech’s Product and Tools Operations team (gPTO) leverages deep user, operational, and technical insights to innovate Google&#39;s Ads products into customer experiences that are so intuitive (or automated) that they require no support at all. gPTO partners closely with gTech’s Support, Professional Services, Product Management, and Engineering teams to innovate and simplify our Ads products and build the productivity tools ecosystem for gTech users.</p>\n\n\n<p>The gTech Product Tools and Operations team empowers the ecosystem across Engineering, Product Management, and Partners to make Google Express work. We provide end-to-end technical, operational, and relationship support for partners, including influencing product strategy, developing scalable product tools, helping onboard new partners, and providing technical implementation services to our most strategic partners.\n</p>\n\n\n<p>As Manager of the Strategic Onboarding team, you will manage operations managers responsible for the relationships with our partners from onboarding to optimization. You and your team will be the voice of the partner in feature prioritization discussions, working closely with internal teams to create and streamline processes, develop detailed documentation, and process diagrams, assist partners with their questions and concerns, and increase the overall efficiency of how we implement our products.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/107807160705917638",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-11T19:02:07.538Z",
    "publish_date": "2019-03-11T19:02:07.538Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in people management.</li>\n<li>Experience working with cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>7 years of related industry experience. Experience in online commerce and or retail.</li>\n<li>Experience managing teams with diverse backgrounds to execute on a shared vision.</li>\n<li>Experience leading and implementing high-impact projects with cross-functional teams.</li>\n<li>Ability to work well in a fast paced cross-functional team environment.</li>\n<li>Excellent project management skills and attention to detail.</li>\n<li>Excellent verbal and written communication, interpersonal, and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a high-performing team that provides exemplary operational support and services to partners and ensures the successful engagement and retention of talent.</li>\n<li>Set the strategic direction of the Onboarding team and work with Product Management, Business Development, and Engineering to ensure strategic alignment on business objectives.</li>\n<li>Collaborate with cross-functional stakeholders in annual business planning, key organizational metrics, and other operationally strategic projects. Work closely with leaders to develop operational business reviews and team communications.</li>\n<li>Identify and structure specific analyses to address complex and ambiguous business challenges.</li>\n<li>Assist with complex and difficult escalations in close collaboration with leads and cross-functional teams.</li>\n</ul>",
    "title": "Manager, Strategic Onboarding"
}