{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQurV-hYpZMk1xczS3WTYFWyqK1Nw_qFzmqMwSAapSwSOgCPMA3TfiMAFqqfluyH405hgISnFkF7Zq-5Zqz27nu0DoCj36sZdA1FXsoImhOhbr48cWJyOVXbZRI%3D_V2&jobTitle=SAP+Solutions+Consultant%2C+Google+Cloud&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:17.077Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>You&#39;re a Sales Engineer with excellent technical, communication and organizational skills, previous experience in cloud platform and infrastructure products, combined with experience and deep knowledge of SAP technologies. Your expertise and presentation skills will be on display as you engage with customers to understand their business and technical requirements, and persuasively present practical and useful solutions on Google Cloud.\n</p>\n\n<p>In this role, you will work hand-in-hand with the Sales team to introduce Google Cloud to our customers. You will help prospective customers and partners understand the power of Google Cloud, explain technical features and problem-solve any potential roadblocks with a specific focus on SAP workloads running on Google Cloud Platform.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5803213687291904",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:42:10.296Z",
    "publish_date": "2019-02-27T19:42:10.296Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or related technical field or equivalent practical experience.</li>\n<li>Experience serving in the capacity of a technical sales engineer in a cloud computing environment or equivalent experience in a customer-facing role (including working as a member of a professional services or systems engineering team).</li>\n<li>Experience in all aspects of cloud computing (infrastructure, storage, platforms and data), as well as cloud market, competitive dynamics and customer buying behavior.</li>\n<li>Experience with SAP technologies (such as SAP HANA, SAP Business Suite and Business Warehouse, SAP Hybris, etc.) and their architecture and infrastructure needs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other technical field</li>\n<li>Experience with hybrid cloud deployments, and on-premise to cloud migration deployments.</li>\n<li>Experience in and understanding of data and information management - especially as it relates to big data trends and issues within businesses.</li>\n<li>Understanding of SAP cloud offerings with special focus on HEC and SAP Cloud Platform.</li>\n<li>Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with the team to identify and qualify business opportunities, identify key customer technical objections, and develop the strategy to resolve technical blockers.</li>\n<li>Own the technical relationship with Google’s customers, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources.</li>\n<li>Demonstrate and prototype Google Cloud product integrations in customer/partner environments.</li>\n<li>Recommend integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution using best practices on Google Cloud.</li>\n<li>Travel to customer sites, conferences, and other related events as required.</li>\n</ul>",
    "title": "SAP Solutions Consultant, Google Cloud"
}