{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfxYjJEbCJvx-4LbALyfUiR8jpZFBG4rTHSKGtkRMp0SOgCPMA3T5PSVil5CGCCMO4wwUHt1AiLU1zKshCFxxCiCuhKHcKFGZ6n19KKSL5WqMNwvxW4A7bBSxcE%3D_V2&jobTitle=Data+Center+Facilities+Technician%2C+Global+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:23.809Z",
    "description": "<p>The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.<br><br>As a master of best-in-class practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "ASSOCIATES_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5768745068986368",
    "location": {
        "address_lines": [
            "Clarksville, TN, USA"
        ],
        "city": "Clarksville",
        "country": "TN",
        "country_code": "US",
        "display": "Clarksville, TN, USA",
        "lat": 36.5297706,
        "lon": -87.3594528
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&size=1168x324&zoom=12&signature=4g7D15gS_KsRZAcPRJBPHshHxPo=",
        "large_2x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&scale=2&size=1024x324&zoom=12&signature=QYWwXS75248qfpdwqfEBBnm8V4Y=",
        "small_1x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&size=600x400&zoom=12&signature=mjzy6xqVL8hvXff8Zn76i9zQc0o=",
        "small_2x": "/maps/api/staticmap?center=1000+Solar+Way&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1000+Solar+Way&scale=2&size=600x400&zoom=12&signature=WRLiawPe1x4P6Qs4PKUv_xfNnR0="
    },
    "modified": "2019-02-27T19:42:17.542Z",
    "publish_date": "2019-02-27T19:42:17.542Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Associate&#39;s degree, trade school certification or other verifiable training in a relevant technical field (e.g: CMCO, SMT, etc.) or equivalent practical experience.</li><li>2 years of experience in Mechanical/Heating, Ventilation and Air Conditioning (HVAC) and/or Electrical Engineering. 2 years of experience at Apprenticeship or Technician level in a critical environment.</li>\n<li>Ability to lift and move 50 lbs of equipment; work on platforms, ladders and under raised floors.</li>\n<li>Ability to work non-standard hours and differing work rotations/shifts as required (including working on holidays and shift rotations).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Universal Refrigerant Handler&#39;s certification.</li>\n<li>Experience in a data center, hospital or power plant environments.</li>\n<li>Knowledge of electrical and mechanical systems used in a data center environment, including: Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, Air handling units and CRAC units.</li>\n<li>Ability to communicate intelligently and effectively with Contractors who perform maintenance or upgrade work on systems.</li>\n<li>Ability to learn quickly and address issues as they arise.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Operate, monitor, maintain, and respond to abnormal conditions in facilities systems.</li>\n<li>Track and trend operational characteristics.</li>\n</ul>",
    "title": "Data Center Facilities Technician, Global Data Centers"
}