{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZIgm3skr5D5Y1GMqrDAjI_bClhjBCGKrKHe9NmagE8SOgCPMA3TbbPRu_tdKnX-wqj4UG__Nkj5dX2b7Y5tFRiNxT04y8Vs-ju2dWMtPsDTmFNSxlklaYf-jv4%3D_V2&jobTitle=Global+Lead%2C+Vendor+Operations%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:03.305Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n\n<p>As a Program Manager in the Trust and Safety Vendor Operations team, you will lead complex, multi-disciplinary projects, identify and implement process improvements, and exercise business and technical understanding to drive long-term objectives. You will manage project schedules, identifying risks and clearly communicate goals to project stakeholders across multiple timezones. It will be your job to keep all the players coordinated on the project&#39;s progress and deadlines.\n</p>\n\n\n<p>In this role, you will combined technical, sales, and customer service experience to protect our users and build new solutions that make our platforms safer. You will demonstrate a bias for action as you drive tool and process development and improvements. Additionally, you will identify emerging local trends, spotting patterns across products and potential gaps in current operations. Through clear goals, effective projects, and collaborative support, your contributions and ideas will have a global impact.</p><p>At Google we work hard to earn our users’ trust every day. Gaining and retaining this trust is critically important to Google’s success. We defend Google&#39;s integrity by fighting spam, fraud and abuse, and develop and communicate state-of-the-art product policies. The Trust and Safety team reduces risk and protects the experience of our users and business partners in more than 40 languages and across Google&#39;s expanding base of products. We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, often with an eye to finding industry-wide solutions. Trust and Safety team members are motivated to find innovative solutions, and use technical know-how, user insights and proactive communication to pursue the highest possible quality and safety standards for users across Google products.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4514872652136448",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:46:53.962Z",
    "publish_date": "2019-03-06T22:31:43.096Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical field.</li>\n<li>10 years of relevant work experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Masters degree in business/risk management.</li>\n<li>10 years of experience in program/project management.</li>\n<li>Experience building, running, and scaling highly successful global operations and utilizing local insights and trends to improve global, cross-product decisions.</li>\n<li>Experience in technology, content moderation, vendor management, and/or insights and analytics.</li>\n<li>Experience building and scaling a successful COE team.</li>\n<li>Ability to take initiative and work independently on multiple threads at once. Excellent leadership and influencing skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with multiple stakeholders across to keep our Platforms safe from controversial content and emerging threats.</li>\n<li>Work with global vendor teams to utilize local talent, build a Centre of Excellence (COE) for sensitive content moderation, and generate insights. Build, lead, and mentor the COE team to cultivate best practices and improve analytics and trends discoverability and usability.</li>\n<li>Scope definition, planning, objective and key results (OKR)s development and execution. Manage all in region deliverables for the team.</li>\n<li>Share best practice on sensitive content moderation, research local nuances, and build a globally scalable, cross-product framework to share trends and insights.</li>\n<li>Partner with the Emerging Trends and Risk Mitigation team to leverage local insights and identify the next emerging threats. Utilize industry knowledge to identify the right forums to participate in.</li>\n</ul>",
    "title": "Global Lead, Vendor Operations, Trust and Safety"
}