{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVihwc7Noaf0kWerzKbyQyNfGKQLXs4Q2XgWEKbyapISOgCPMA3Tl_2ROVAVmmw4UXZWM6yCcgkuyAjn8vF4HwcdqgRWopVmP8ha_KYDfReK84zDpIMLEGLmH5Q%3D_V2&jobTitle=Product+Marketing+Manager%2C+Privacy%2C+Brand+Studio&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:20.797Z",
    "description": "<p>Brand Studio is a passionate team of creative thinkers and marketers. We protect and promote Google’s brand and reputation through programs, products and narrative experiences that express Google’s values in action across the world. As part of our team, you’ll define and create the visual and strategic elements that comprise Google’s brand and product identities. You’ll articulate standards that harmonize and bring a uniquely Google point of view to all of our products and communications. By embracing user insights, strategic thinking, beautiful design and provocative execution, you will create delightfully intuitive (and inventive!) experiences that will define the future of Google’s brand.</p>\n\n<p>Technology companies have the responsibility to protect data privacy and uphold data security. The way users and influencers perceive our stance on respecting their data has a huge impact on our brand and our future, shaping how they trust and advocate for us. Hence, it has become even more important to help them understand that we never stop protecting their data with our industry-leading security and that we respect their privacy through providing data controls and the ability to update privacy settings that work for them. At the same time, we help families make the most out of Google safely, teaching children the fundamentals of digital safety and citizenship. Ultimately we need to help people understand about these important topics for them to enjoy our services without worrying about their data privacy. As data privacy has become one of the most pressing topics facing technology companies today, it continues to remain a top priority for Google.\n</p><p>As the Brand Marketing Manager for Privacy, you are passionate about addressing one of the top concerns for users around the world, the privacy of their personal information they share online. You are someone with a passion for working on tough challenges, an appetite for working in a fast-paced environment with high executive visibility, and a desire to work on something of utmost strategic importance to the company and ultimately the future of the Internet.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6325005107527680",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T22:54:49.450Z",
    "publish_date": "2019-02-27T19:52:22.357Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in Product Marketing with responsibilities of creating and executing consumer or business marketing campaigns.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience managing agency partners to create cross-channel communications that reach and influence a global audience.</li>\n<li>Ability to think strategically about complex issues, leading to thoughtful recommendations and marketing plans.</li>\n<li>Ability to consistently deliver quality output within tight deadlines in a dynamic environment.</li>\n<li>Ability to work at a fast-paced working environment where priorities can shift based on the market needs.</li>\n<li>Strong project management skills; ability to manage complex projects with multiple stakeholders and multiple priorities.</li>\n<li>Interest in driving critical conversations around data privacy.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Serve as the day-to-day POC, collaborating with cross-functional team members across numerous Product teams, Policy, PR, and regional Marketing teams to ensure alignment and clear communications around privacy.</li>\n<li>Serve as the go-to expert on the team around data privacy in the industry. Develop compelling marketing communications and promotions to drive awareness of our privacy tools and controls.</li>\n<li>Define messaging narratives and go-to-market plans to support the launch of key privacy product launches.</li>\n<li>Work closely with product teams to market new privacy features and tools.</li>\n<li>Manage a small team.</li>\n</ul>",
    "title": "Product Marketing Manager, Privacy, Brand Studio"
}