{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUfp0_stUqmY-BptZbPtGp2X-xba-AVpmUsAzU-djI8SOgASYQ8w8c3j0IfKNDbQHrDZ1fTc-98WQ0W7DYFmj94gTC_zcPWcLSi0uHCCgB1C4sDcMugjYRNp1CM%3D_V2&jobTitle=Field+Marketing+Lead%2C+Consumer+Hardware&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T16:01:55.886Z",
    "description": "<p>The Hardware and Retail Marketing organization is responsible for driving the growth of Google&#39;s hardware brands, including but not limited to Google Pixel, Google Home, Pixelbook, wearables and accessories. We partner with product teams to understand the user, shape the product roadmap, and bring products to market through coordinated global media campaigns. Google is committed to building radically effective experiences for customers at the intersection of hardware, software and artificial intelligence, and we’re growing the team.</p>\n\n\n<p>Google is a place of thinkers, builders and relentless doers. We work on problems that everyone encounters in their homes, and we thrive on challenges. We deliver excellent products and experiences that surprise and delight our customers, and shape the home space.\n</p>\n\n\n<p>Our team is looking to drive disruption and innovation. As a Field Marketing Lead, you&#39;ll help us frame and communicate the benefits of the programs and services locally. In this role, you&#39;ll develop hypotheses and leverage a test-and-learn mindset to uncover what marketing and communication strategies resonate with our users.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/94086677225448134",
    "location": {
        "address_lines": [
            "Irvine, CA, USA"
        ],
        "city": "Irvine",
        "country": "CA",
        "country_code": "US",
        "display": "Irvine, CA, USA",
        "lat": 33.6845673,
        "lon": -117.8265049
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&size=1168x324&zoom=12&signature=0scIUM00JYt6krl0dVLxeAYyxkg=",
        "large_2x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&scale=2&size=1024x324&zoom=12&signature=tnVdtRFMVL5Bk73hj05eZrf-Rs8=",
        "small_1x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&size=600x400&zoom=12&signature=TznNrJ_EcJIGp2o6LDqvVxmeYN4=",
        "small_2x": "/maps/api/staticmap?center=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=19510+Jamboree+Road%2C+Irvine%2C+CA+92612%2C+USA&scale=2&size=600x400&zoom=12&signature=acf_mmVD1V_QyuRIYyB2EC0lV_8="
    },
    "modified": "2019-03-12T16:01:55.886Z",
    "publish_date": "2019-03-12T16:01:55.886Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of experience with local marketing.</li>\n<li>Experience with field and digital marketing best practices in email, social, app or advertising.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in PR or account management.</li>\n<li>Experience collaborating with cross-functional teams successfully.</li>\n<li>Ability to roll out highly personalized, data-driven marketing campaigns using iterative A/B test designs.</li>\n<li>Demonstrated problem-solving capabilities, with the ability to develop creative/non-traditional solutions for undefined problems.</li>\n<li>Passion for working with technology products and solving consumer needs.</li>\n<li>Demonstrated presentation skills, with the ability to build consistent relationships, find networking opportunities, and thoughtfully engage with a diverse range of community groups and individuals.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify new opportunities within the local market to drive awareness and interest in key programs, measuring effectiveness along the way. Collaborate with Marketing and PR teams.</li>\n<li>Plan and execute excellent community/city events experiences, and ensure each experience and touchpoint is reflective of the brand. Test content marketing efforts to drive actionable insights for our messaging, segmentation, and channel strategies.</li>\n<li>Identify and pitch strategic partnerships to build awareness on the ground.</li>\n<li>Own our story in the region, create compelling content and ensure that we tell a consistent narrative across our local marketing channels.</li>\n<li>Write the playbooks for future growth by documenting everything.</li>\n</ul>",
    "title": "Field Marketing Lead, Consumer Hardware"
}