{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckbkkp5PatCHXjlBsFKzakt0SSJP04kIrzhLe0k8cL1ESOgASYQ8w8IGGkelnxScsNMtpUjSGtRzB5eqrK2ORfvRwh8kQClG97fOMG_nyNGbRK8w6f0ZNFq-FyaM%3D_V2&jobTitle=International+Revenue+Global+Manager&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-12T18:31:37.374Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and our full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s accounting and reporting requirements.</p>\n\n\n<p>As a International Revenue Global Manager, you will join and manage a team in the Business Finance Accounting organization consisting of experienced, motivated, creative, self-sufficient and performers. Our team handles the Revenue and Cost of Sales Accounting function at Google globally. In this role, you will work as part of a collaborative global team while performing a broad array of accounting activities. You will continuously look to improve processes and find more efficient ways to utilize resources, providing support and accountability to Finance partners across all regions.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/75471995161977542",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:56:06.410Z",
    "publish_date": "2019-02-27T19:56:06.410Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Accounting, or equivalent practical experience.</li>\n<li>10 years of experience in public accounting or a relevant role.</li>\n<li>5 years of experience in people management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>International experience.</li>\n<li>Knowledge of IFRS 15 and transfer pricing.</li>\n<li>Ability to communicate effectively with management.</li>\n<li>Interest in learning SQL and systems savvy.</li>\n<li>Excellent analytical skills, combined with impeccable business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with regional accountants to address regional statutory and reporting requirements.</li>\n<li>Analyze, interpret, and present financial results to regional finance leaders.</li>\n<li>Facilitate the completion of regional audits.</li>\n<li>Work with business partners to define and establish scalable processes to address recurring reporting needs.</li>\n<li>Work closely with Operations, Tax, Product, Legal, IT, and other Finance groups to identify business partner needs and ensure high level of service.</li>\n</ul>",
    "title": "International Revenue Global Manager"
}