{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdFZYO6-Q3XZAiuIBqNtWJ7-KW3ACYkySaRRe2KcOvESOgASYQ8wbijqCAtQ9HHm16WJFfi-ufG0yzzGWa7LMO5yXaUC-HU-4IHlm2Q8z3itys-gV7nmm6UPtPc%3D_V2&jobTitle=Artist+Relations+Manager%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-07T17:31:51.580Z",
    "description": "<p>Google&#39;s line of products and services to our clients never stops growing. Artist Relations Managers have the opportunity to build a long-lasting relationship with our top partners. You cultivate these existing partnerships to make sure they can take full advantage of Google&#39;s ever-growing suite of offerings, relying on relationship building skills to identify mutually beneficial opportunities with partners in order to best represent our users, products, and programs.</p>\n\n\n<p>In this role, you will be responsible for courting, building and maintaining YouTube’s relationships with urban artists. This includes fostering their engagement on the platform and use of our tools and resources as well as guidance on growing their audience, and partnering with YouTube/Google in ways that are mutually beneficial. In this role you will interact regularly with managers, agents, labels within the industry that represent artists, facilitating ongoing platform engagement, imparting knowledge of how best to use YouTube to grow audience, advising on operational processes, resolving inquiries, and identifying and driving mutual business growth opportunities. You will have exceptional relationships in the urban music industry as well as skills that enable you to excel in cross-functional work flows.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/72469408087188166",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-14T20:02:06.649Z",
    "publish_date": "2019-03-14T20:02:06.649Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience working directly with a variety of artists and their representatives.</li>\n<li>5 years of experience working cross-functionally.</li>\n<li>Experience establishing one on one relationships with artists.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in artist management, label product management, artist relations, and/or artist marketing with a focus in urban music.</li>\n<li>Experience handling high-stress situations with creative individuals while focusing on accomplishing the task at hand.</li>\n<li>Ability to handle and coordinate multiple simultaneous artist activities. Ability to take initiative and build productive relationships externally and internally.</li>\n<li>Ability to act quickly and effectively cultivate artist satisfaction and make our relationship impactful and successful for both YouTube and the artists.</li>\n<li>Excellent customer service skills.</li>\n<li>Excellent attention to detail, communication, and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage daily artist relationships and program management, working directly with artists and their representatives.</li>\n<li>Collaborate cross-functionally to identify artists and prioritize and set expectations related to how we can develop mutually beneficial partnerships.</li>\n<li>Work cross-functionally with internal stakeholders to establish programs for artists, including performances, and content productions within YouTube Spaces and Google office locations.</li>\n</ul>",
    "title": "Artist Relations Manager, YouTube"
}