{
    "application_instruction": "<b>Please include a URL for an online portfolio showing a sense of CMF applied to a variety of product categories, knowledge of the craft, and examples of strategic initiatives, including examples that demonstrate unique, innovative, and producible solutions with high levels of quality.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSZq8b82I6LJpSthQC1RZQrr8HvunLOTx-qALRRDSugSOgCPMA3TqgkUZV5u04ZxZOdYe5FL0rBoseqNBXjBYUzrgqewGup1fvRV1HvSUOej-EpsHH_y87btEXc%3D_V2&jobTitle=Color%2C+Material%2C+and+Finish+Manager%2C+Consumer+Hardware&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-20T21:01:53.558Z",
    "description": "<p>Google&#39;s products are known for their clean design, ensuring users can quickly and easily find what they&#39;re looking for. As an Engineering Designer, you leverage your strong technical background and understanding of &quot;good&quot;\u009d design to look for ways to streamline the user experience. You work closely with the product managers and development engineers throughout the entire production cycle. You design everything from high-level product flow to detailed UI mockups and then use your expert scripting skills to make your designs a reality.</p>\n\n\n<p>As the Design Manager of the Color, Material, Finish (CMF) Design team within the Google Hardware Design organization, you will be a critical leader and contributor to guide the efforts in defining and evolving what it means to hold Google in your hand. This role is multi-faceted with elements of strategy setting, building processes, and people management.\n</p>\n\n\n<p>As a CMF Manager, you will guide and develop color, material, and finish for the consumer electronic industry in close partnership with Industrial Design Directors of different businesses and the lead of Hardware Design. You will guide and develop color, with a focus on bringing concepts into production with excellent execution. Additionally, you will set in motion strategies for long-term initiatives and developments and manage and guide a team of CMF designers, both in terms of their career development and the projects they are leading, contributing to a culture of connectedness and innovation. In this role, you will partner closely with Product Engineers, UX Designers, Project Managers, Operations, and Marketing to bring the most compelling and brand appropriate solutions to life.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6084070784303104",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:41:12.594Z",
    "publish_date": "2019-02-27T19:41:12.594Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Industrial Design, similar designing field, or equivalent practical experience.</li>\n<li>15 years of experience developing consumer products with a focus on CMF and 5 years of experience managing and leading design teams.</li>\n<li>Experience in design software (e.g., Adobe CC, 3D CAD, and presentation programs), tools, materials, and manufacturing processes. Experience in all phases of the CMF design process, from research and development to manufacturing execution.</li>\n<li>URL for an online portfolio showing CMF applied to multiple product categories.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in consumer electronics, the mobile industry, and mass production products.</li>\n<li>Ability to drive a color and material concept all the way to production.</li>\n<li>Ability to work independently as well as within a mixed team environment.</li>\n<li>Ability to be and/or remain involved in local and global design community.</li>\n<li>Ability to work within constraints and challenge status quo.</li>\n<li>A keen eye for design (i.e., proportions, color, form, typography, presentation) and an intuitive feel for design (i.e., culture, functionality, fashion, ergonomics, trends, history).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create forward looking, annual, and seasonal color, material, finish (CMF) strategies that guide direction for all Google Hardware products and categories. Manage, mentor, and lead a team of CMF designers including career development and project guidance.</li>\n<li>Manage external consultants and resources to provide the team with relevant cultural influences. Oversee and evolve the CMF studio (color and material labs).</li>\n<li>Lead research initiatives to identify relevant trends, materials, and manufacturing processes to inspire the rest of the design organization. Oversee CMF team support of manufacturing partners to ensure excellent quality.</li>\n<li>Inspire and lead teams throughout the entire process from early concept through production, balancing the vision with managing resources, schedules, and cost constraints. Lead, organize, and collaborate with cross-functional partners such as engineering and marketing.</li>\n<li>Partner with Design Directors and cross functional leaders to create a culture of innovation and design excellence. Represent the CMF team in meetings and presentations to internal and external stakeholders.</li>\n</ul>",
    "title": "Color, Material, and Finish Manager, Consumer Hardware"
}