{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaAb3TMl5Lh355Yd8Zqc88b_bL_uVjuIRP1Mwiqr2E0SOgASYQ8wWDCwjDqLY9au_ZyNW-OutkMeSipYcqzkM3FSifkOiNKy1t6rsy5fOFHhynudsMcFeZfTSwY%3D_V2&jobTitle=Head+of+Marketing+Activation%2C+Google+Cloud&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T12:01:51.492Z",
    "description": "<p>Google is developing groundbreaking cloud solutions for companies, leveraging years of experience in building secure, reliable, and scalable cloud technology. With excellent Google differentiation in data analytics and machine learning, security, application development and collaboration software, we’re well on our way -- but we need more people who can help us write and tell that story. If you’re as excited about building what’s next as we are, Google Cloud is the place for you.</p>\n\n\n<p>As Head of Marketing Activation, you&#39;ll manage the end-to-end execution of our online assets to support campaigns and events. You will anticipate business needs and resolve challenges faced during the execution process. You&#39;ll manage a high-performance execution team (including agencies) to design, develop and deliver 1:1 marketing programs across different Google-approved systems.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/135755367599481542",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-12T12:01:51.492Z",
    "publish_date": "2019-03-12T12:01:51.492Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree, or equivalent practical experience</li>\n<li>7 years of relevant B2B marketing or field marketing experience.</li>\n<li>Experience in running end-to-end marketing campaigns.</li>\n<li>Experience with managing databases and experience using spreadsheet software.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Development experience; comfortable talking about topics that are technical in nature, and able to express complex concepts in plain language to reach broader audiences.</li>\n<li>Experience working in the business technology market and systems and expertise in working closely with an inside sales organization to drive demand.</li>\n<li>Experience with marketing and web analytics tools, Customer Relationship Management (CRM) systems, and tracking tools to assess campaign effectiveness.</li>\n<li>Knowledge of platforms and cloud technologies.</li>\n<li>Excellent quantitative reasoning, creativity and strategic skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work closely with stakeholders on Marketing teams to drive campaign execution and operations.</li>\n<li>Managing vendors to build out the assets required to launch and maintain the campaign.</li>\n<li>Design/localize, automate and optimize regional demand generation campaigns.</li>\n<li>Provide data management e.g. campaign performance, segmentation analysis, list management and lead processes.</li>\n<li>Provide training and onboarding of systems and processes to newly onboarded Google Cloud Regional Marketing team members.</li>\n</ul>",
    "title": "Head of Marketing Activation, Google Cloud"
}