{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXIn-it1-txiycip4QBfBjjp5xE7kFLRR2_hKK5UlpISOgCPMA3TINkgERpAF6rZZLze2Sw9pjmws8YCrar9cjMVoMBZNdgvO_6TR2Mz5LKBsr8QA_DHAnQeD8c%3D_V2&jobTitle=Technical+Program+Manager%2C+Gaming+and+Paid+Digital+Goods%2C+YouTube&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:04:49.537Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n\n<p>YouTube Paid Digital Goods is creating entirely new monetization opportunities for creators, and Gaming is making YouTube amazing for game enthusiasts! Imagine search and discovery on YouTube that understands your relationships with the games you play and opportunities to directly connect with and support YouTube Creators. As a Technical Program Manager (T/PgM) on YouTube Paid Digital Goods and Gaming teams, you’ll work closely with YouTube Product Management and Engineering teams, cross-functional disciplines (user experience, user research, legal) and centralized review teams (privacy, security, logging) to drive execution of our product roadmap. These teams are bringing the uniquely YouTube experience to viewers and Creators alike on new platforms and in new ways.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5972122218463232",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T00:31:58.549Z",
    "publish_date": "2019-03-07T00:31:58.549Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree  in Computer Science or equivalent practical experience.</li>\n<li>5 years of experience managing engineering/product projects.</li>\n<li>Experience with project management tools, methodology and software office suites.</li>\n<li>Experience working on user facing products.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with software development cycle management, working with test engineering, and release engineering to launch product updates in iterative fashion.</li>\n<li>Project management experience in a gaming field.</li></ul>",
    "responsibilities": "<ul>\n<li>Lead and collaborate with the YouTube leadership team on critical initiatives, including defining roadmaps and strategy, identifying and investigating issues, developing project plans, allocating resources, and driving projects towards successful delivery.</li>\n<li>Manage multiple interdependent projects with moderate complexity and scope and help the team to innovate and achieve technical excellence.</li>\n<li>Help navigate launch processes and work to improve mobile releases.</li>\n<li>Drive engineering execution from concept to launch by working closely with Tech Leads, Tech Lead/Managers, and Engineers and installing development processes.</li>\n</ul>",
    "title": "Technical Program Manager, Gaming and Paid Digital Goods, YouTube"
}