{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc-_bK2CvVvIVQI0aUqTQYwSflu5Km2YzLIEZ0PT3ecSOgCPMA3TqDnAVkYs615x4ya1bDkSs3Al4j4Om3J9_y5ll7dDO1OlDu6HCl_OpfcnTj-mwDNfvGN62I4%3D_V2&jobTitle=Sales+Strategy+and+Operations+Manager%2C+Small+and+Medium+Business+Partners%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-19T20:03:24.716Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As the Sales Strategy and Operations Manager for Small and Medium Business (SMB) Partners, you will manage business reviews, drive operational improvements, and inform strategy and planning for the Google Cloud Partner Team. You will combine quantitative rigor and business acumen to identify business trends and opportunities, design optimal workflows, align incentives, set targets, and introduce innovative capabilities leveraging our data scientists and engineering teams. You will work cross-functionally partnering both internally and externally to develop and execute the strategy.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4550062996914176",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:47:44.395Z",
    "publish_date": "2019-02-27T19:52:50.276Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Finance, Management, Business, Operations, Statistics or equivalent practical experience.</li><li>4 years of experience in finance, management consulting, corporate strategy, sales strategy and operations or equivalent project management experience in a technology or media company.</li><li>Experience in collaborating with cross-functional teams.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA degree.</li><li>Experience developing complex analytical models using spreadsheet and presentation software to facilitate communication with senior stakeholders.</li><li>Experience executing complex strategic and operational initiatives; distinctive problem-solving and project management skills.</li><li>Ability to pay attention to detail while managing multiple, simultaneous projects.</li><li>Strong business acumen and the ability to successfully navigate and influence strong personalities within a complex business environment.</li><li>Exposure to working with online channels, telco, and distribution; strong knowledge of and relationships within the technology industries.</li></ul>",
    "responsibilities": "<ul>\n<li>Partner with Partner Directors and managers to develop the team’s business plan, business insights, process improvement and go-to-market strategy; become Senior Management’s trusted advisor.</li>\n<li>Combine qualitative and quantitative insights to shape strategy for the business function, analyze operational metrics to anticipate and mitigate performance issues.</li>\n<li>Participate in and help steer global initiatives as appropriate; ensure that they are rolled out effectively to the team.</li>\n<li>Help define and implement the new Partner organization.</li>\n<li>Drive operational improvements for team; optimize resource allocation across business teams, measure progress against goals, and facilitate management discussions and decisions.</li>\n</ul>",
    "title": "Sales Strategy and Operations Manager, Small and Medium Business Partners, Google Cloud"
}