{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckR3SKbLHrw2t_-XHmBiuF8W8zLHXOzPeLwOZ9w0EpbYSOgCPMA3TzKlFfBFObNYvOo9WcZZMaW7wVbPJl2_2Ek6WfLpdqFZMfaWVnAmHh20qCv3QkyX0C3xnKDQ%3D_V2&jobTitle=Commodity+Manager%2C+EDA+Tools&loc=US",
    "categories": [
        "MANUFACTURING_SUPPLY_CHAIN"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:30.374Z",
    "description": "<p>Commodity Managers work with Engineering teams to make sure Google has the supplies and equipment to put into production the innovative products coming from our Engineering teams. As a Commodity Manager, you use your wide industry knowledge and strategic supplier relationships to optimize our total cost of ownership for our global -- and growing -- infrastructure. The scale at which Google operates means that savings on just one piece of hardware can have a huge impact on Google&#39;s bottom line.</p>\n\n\n<p>The EDA Commodity Manager for Google will serve as the primary contact for internal teams and external partners/suppliers for strategic sourcing of EDA CAD/software Tools, Emulation hardware, and IP. You will build consensus across internal and external stakeholders and will manage the relationship across the company. Additionally, you&#39;ll lead and support the development, implementation, and management of global strategies to ensure optimal pricing, flexibility, and quality. This includes full management of contract negotiations. You will also closely engage with our ASIC Engineering, Finance, and Legal Teams and centers around developing and executing on a long-term strategic roadmap.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5373372559196160",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:16:34.514Z",
    "publish_date": "2019-02-27T19:46:33.647Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in a technical or a quantitative/business-field, or equivalent practical experience.</li>\n<li>5 years of experience working with strategic sourcing, supplier management, and ASIC/EDA product cycle management.</li>\n<li>Experience with EDA Tools, Emulation hardware, and hardware IP (Intellectual Property).</li>\n<li>Experience with custom silicon/ASIC design flow, stages, and key milestones.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree or other advanced degree.</li>\n<li>7 years of experience in commodity management or supply chain management in a high-tech industry focused on ASIC/EDA sourcing.</li>\n<li>7 years of experience working with strategic sourcing, supplier management, and ASIC/EDA product cycle management.</li>\n<li>Experience in design enablement related sourcing practices and agreement consultations.</li>\n<li>Experience with Software/Intellectual Property (IP) licensing Best Known Methods.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Align Electronic Design Automation supplier relationships to drive technology improvements to meet our demanding needs.</li>\n<li>Collaborate with Engineering, Finance, and Partner organizations to synthesize technical, commercial, financial, and industry/market inputs into a cohesive business strategy.</li>\n<li>Lead cross-functional, cross-organizational teams through the sourcing, delivery, and support phases across multiple programs.</li>\n<li>Derive the best value for products from EDA suppliers to achieve cost and velocity.</li>\n</ul>",
    "title": "Commodity Manager, EDA Tools"
}