{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeKQfZMBJQmKxuovtlvXsLcOxF3bIbr63aY6RmZtLrYSOgASYQ8w87Fd6YHFKWzMK6e0x1M0a3tWRX1Qhnuxh-UYQU0P82gAaMPIOQZhqb2MWjdU4KAJnKO_MbI%3D_V2&jobTitle=Global+Product+Lead%2C+Application%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T22:31:57.814Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As a Global Product Lead for Apps, you’ll test new approaches focusing on how to apply cutting edge features to help advertisers achieve their goals and gain valuable global experience. You&#39;ll work directly with teams in other regions to manage programs, share discoveries, and uncover new insights that can help all mobile app businesses grow around the world.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/91737905371718342",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:56:48.868Z",
    "publish_date": "2019-02-27T19:56:48.868Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in mobile apps, advertising, project management, and go-to-market strategy.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience analyzing data and creating data-driven narratives.</li>\n<li>Understanding of the Google Ads product and how to create/optimize campaigns.</li>\n<li>Ability to influence stakeholders and take complex, ambiguous topics and turn them into stories that spark an audience.</li>\n<li>Excellent communication, project management, relationship management, and leadership skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive commercialization of our suite of app promotion products in GCS.</li>\n<li>Bring customer insights to internal stakeholders to drive product changes to meet customer needs.</li>\n<li>Analyze data to uncover opportunities to accelerate growth, building models to determine addressable audience and ROI of opportunities.</li>\n<li>Be an advocate for GCS app opportunities.</li>\n<li>Plan and execute projects designed to accelerate growth, engaging with global, cross-functional teams to lead execution.</li>\n</ul>",
    "title": "Global Product Lead, Application, Google Customer Solutions"
}