{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Boulder, CO, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYPAFiI_dfwxlprimfjg5b9zL_FNW6Og5Go9eRpa7MQSOgASYQ8wqiR6ocnLPcM7e873ZCmrwj2-rYrlejor7-NuPZkMzQIijtcTMaznbAAgoB1JbCHjylB6v9o%3D_V2&jobTitle=Technology+Business+Analyst%2C+Real+Estate+and+Workplace+Services&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T22:01:32.415Z",
    "description": "<p>As a Real Estate and Workplace Services (REWS) Technology Business Analyst, you will partner with engineering resources and REWS business clients to design, develop, and maintain REWS’ diverse range of systems and tools; touching everything from real estate to food services to facilities operations and transportation. \n</p>\n\n<p>You will manage the customer side of complex, multi-disciplinary engineering projects using your outstanding collaboration and communication skills. You will develop a deep understanding of business requirements and priorities with REWS clients and act as their advocate through the entire product lifecycle, ensuring our technology products are optimally aligned to business needs. This includes helping clients define their needs, gathering requirements and user stories, providing system expertise and consulting, identifying risks and clearly communicating them to project stakeholders, designing and implementing new processes, and supporting clients through Googler-facing rollouts. You will help strategically prioritize technical needs into a comprehensive project pipeline. \n</p>\n\n<p>You need to be equally at home explaining analyses and recommendations to customers and executives as you are discussing the technical trade-offs in product development with engineers. You have a passion for excellent customer service and thrive in a fast-paced, change-oriented business environment that requires collaboration with a global team. You aren independent worker with the ability to understand multiple business lines and systems down to small details while still keeping the big picture in focus.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/127843457080140486",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:53:49.307Z",
    "publish_date": "2019-02-27T19:53:49.307Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Technology or equivalent practical experience.</li>\n<li>5 years of experience in business analysis, technology development, or a related field.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Agile or other development methodologies and experience in operating as part of a product development team.</li>\n<li>Experience with facilities management, hospitality services, design and construction, physical security operations, or real estate planning.</li>\n<li>Working knowledge of database and system architecture concepts and functionality.</li>\n<li>Excellent interpersonal skills, with a track record of building productive relationships and cross-functional connections.</li>\n<li>Ability to convey business processes and technical concepts to a broad range of both technical and non-technical audiences.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with client group(s) to understand and anticipate in-depth business requirements, priorities, and processes; advocate on behalf of clients in conversations with technical partners and negotiate best outcomes balancing both specific client needs and broader organizational priorities.</li>\n<li>Translate business needs into technical terms, including business cases, business requirements, functional requirements, user journeys, and business process flow charts.</li>\n<li>Work with Technology Program Managers and developers as part of a broader product team; use business context to inform and influence overall product roadmap.</li>\n<li>Ensure that technical solutions meet business needs and requirements, including overseeing User Acceptance Testing. Align business process with technology solutions, including influencing clients to adapt new processes and managing through change.</li>\n<li>Maintain a deep understanding of complex products and systems, and the underlying business processes they support, in order to advise on technical solutions and anticipate downstream implications of system changes.</li>\n</ul>",
    "title": "Technology Business Analyst, Real Estate and Workplace Services"
}