{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckfb9KIfgUVfH3Shu5OiAIt_VomjXc9xrEVUZCFc9k3ASOgASYQ8wCXg_sINgWQ8diX8LpAAHIE6KFhwEHDt5xfWMrlTOY14srbsj1kovncLyuAXAoncqq6c5adY%3D_V2&jobTitle=Associate+Product+Marketing+Manager+Program%2C+Marketing+Strategy+and+Operations&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-14T11:01:49.439Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n<p>As a part of Marketing’s Strategy and Operations team, you will engage regularly with marketing leads/Chief Marketing Officers for product areas to establish Marketing’s strategic direction, getting broad exposure to different parts of the business. You will work with teams and collaborate cross-functionally with key leaders within Marketing and across Product, Finance, and Engineering to solve our toughest challenges, advocate high priority projects, and drive greater operational rigor within Marketing. In this role, you will become an invaluable source of advice and essential partner to Marketing executives. Ideal candidates will have a hypothesis-driven approach to problem solving, strong quantitative skills, comfort tackling broad-reaching and ambiguous questions, and the ability to communicate and work collaboratively and cross-functionally with Googlers of all levels. \n</p>\n\n<p>As an Associate Product Marketing Manager (APMM), you will be part of a unique and highly respected program within the company. The program provides the opportunity to learn new skills through training, an extensive network, international travel to learn more about Google’s business in global markets, and rotations to gain exposure to different products, functions, and/or global locations. Please note this job description is specific to Strategy and Operations and will place you in this role as the first rotation as part of the APMM program. You can find more information about the APMM program on the Google job site here: <a href=\"https://www.google.com/about/careers/students/apmm.html\">g.co/APMMProgram.</a></p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/75605497777922758",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T22:32:00.448Z",
    "publish_date": "2019-02-27T22:32:00.448Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>1 year of work experience in consulting, investment banking, business strategy, or a related field.</li>\n<li>1 year of full-time work experience.</li>\n<li>Individuals applying for this position will not be eligible for immigration sponsorship.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with analytical problem solving, quantitative analysis, and communicating findings to senior management.</li>\n<li>Experience working in complex organizations where working across boundaries and developing strong organizational relationships are keys to success.</li>\n<li>Deep understanding of Google&#39;s products and technology industry.</li>\n<li>Demonstrated capacity for developing and understanding strategy.</li>\n<li>Ability to work in a fast-changing environment, with an entrepreneurial approach.</li>\n<li>Developed written and oral communication skills and effective interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with leadership to set Marketing’s annual strategic plan, articulating critical Marketing priorities and corresponding investment. Coordinate executive-level deliverables.</li>\n<li>Bring the science and rigor to establishing Marketing’s priorities. Conduct data-driven business analytics to support and make recommendations on strategy and investment.</li>\n<li>Improve overall efficiency and effectiveness within your organization by applying a rigorous approach to Marketing’s operational processes.</li>\n<li>Evaluate and pressure test Marketing performance on your products and priorities. Identify opportunities to drive product growth and user engagement, and develop data-driven recommendations for leadership.</li>\n<li>Work on some of the organization’s toughest strategic challenges and initiatives for your product area.</li>\n</ul>",
    "title": "Associate Product Marketing Manager Program, Marketing Strategy and Operations"
}