{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc-vhOyZ1HfAJBGJ6aSfk9B1NVKRvLwiyNYsQcMcnh4SOgCPMA3TQyhgst9mb4UFN0YDyHk8kC8AKTa64oq-M_BwRLaFWy8LGE0mbh_mI7rANyDwB3ZVb_-WFl4%3D_V2&jobTitle=Marketing+Analyst%2C+Online+Partnerships+Group&loc=US",
    "categories": [
        "MARKETING",
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-19T23:01:33.173Z",
    "description": "<p>The Online Partnerships Group (OPG) is a partner-focused organization that prides itself in providing great service, in creating innovative solutions, and most importantly, in having amazing people. We value having an open, inclusive and collaborative culture, where Googlers feel supported and able to do their best work. In offices around the globe, we foster and celebrate an environment where all team members feel welcomed and respected. OPG partners with online publishers and app developers around the world to grow their businesses using our portfolio of products including the AdSense, AdMob, and Google Ad Manager platforms. We offer a solutions-based approach across advertising, analytics, and site or app design, and pride ourselves in finding new opportunities for our partners to better engage users and advertisers. Over a million web publishers and app developers rely on our solution globally, and ultimately, we&#39;re proud to enable Google to be one of the foremost funders of digital content in the world.</p>\n\n\n<p>In this role, you will help our team understand performance of our programs and advise us on strategies and priorities for performance marketing and demand generation. You will work with Marketing and Product on initiatives to improve our acquisition funnel. You will also analyze large data sets to help us understand results from our activities. This is a multi-faceted role where you will work on a global team and be expected to manage stakeholders across multiple functions including marketing, publisher intelligence and legal.</p><p>Google helps our partners find better ways to reach their audiences and manage their digital businesses. In return, our partners provide great content for our products, and they syndicate Google products to enhance their sites and apps. Global Partnerships team members expand and support these relationships by continually finding new opportunities and solving technical problems for our partners. The wider Global Partnerships team includes a variety of different organizations, including CorpDev, Emerging Business Development, Strategy and Operations, Google for Startups, Area 120 and our Display Advertising Business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5193517779582976",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:07:19.519Z",
    "publish_date": "2019-02-27T19:52:49.019Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li><li>3 years of relevant work experience.</li>\n<li>Experience in Google Analytics and other web analytics tools, marketing attribution models, Google Tag Manager, Javascript and web analytics debugging tools.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in presenting to clients and stakeholders and working in cross-functional teams.</li>\n<li>Experience using Google Ads.</li>\n<li>Knowledge of CRM tools, relational databases and SQL.</li>\n<li>Creative and critical thinker and ability to thrive in a fast-paced, dynamic and often ambiguous work environment.</li>\n<li>Effective influencing and interpersonal skills. Ability to work across various functions, regions and stakeholders.</li>\n<li>Excellent problem solving skills, comfortable with data and ability to develop insights and translate them into action.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with Product and Marketing to identify measurement opportunities and implement proper and consistent tracking across platforms or products.</li>\n<li>Develop strategy and roadmap for tracking, measurement, governance and data integration. Analyze large data sets to identify trends, root causes and business improvement opportunities.</li>\n<li>Own and manage our analytics and tag management ecosystem including Google Analytics and Google Tag Manager. Measure success of digital marketing campaigns and report on campaign analytics or channel performance.</li>\n<li>Monitor analytics platforms for tagging or tracking anomalies and support issues through troubleshooting, issue identification, resolution and reporting to relevant stakeholders.</li>\n<li>Educate business stakeholders via physical trainings and/or robust reference documentation.</li>\n</ul>",
    "title": "Marketing Analyst, Online Partnerships Group"
}