{
    "application_instruction": "<b>This role may also be located in our Playa Vista, CA campus.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf5rN_chfoC6UAa67TycgVE4aWv6Goi8O-xlwyvwZj0SOgASYQ8wVkLBDWErwkxcmzWFe1d2VCvTq8IbmtvNJB8BDvvOfmfQQ3V_AlRrhF76yNkVBseo-rWOd4k%3D_V2&jobTitle=Head+of+Internal+and+Executive+Communications%2C+YouTube%2C+Business&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-06T21:01:53.764Z",
    "description": "<p>As a member of the Executive Communications team, you will be part of a small team which produces employee communications and events for Google executives. You will work with members of your internal client team on communications initiatives, projects and programs. You will support the work of the team to create strategic communications campaigns, come up with innovative ways to engage employees that are in tune with Google&#39;s culture, write communications, business update presentations and talking points. You will also collaborate with internal partners as needed across functions (PR, Policy, Legal, HR, Operations, etc.) and geographies.</p>\n\n\n<p>As Head of Internal and Executive Communications, you will lead on internal communication to and from YouTube’s Business Organization, including driving communications strategies and producing communications for YouTube’s Chief Business Officer. YouTube’s Business Organization includes the teams who work with YouTube’s content partners (i.e., creators, artists, media companies), develop YouTube Original content, and run YouTube’s global operations.\n</p>\n\n\n<p>In this role, you will collaborate with cross functional teams including Marketing, PR, Policy, Engineering, Product, and HR to develop and deliver messaging on complex, nuanced issues. You will provide advice for leadership that reflects a deep understanding of their business priorities and leadership style, coordinate content and speakers for strategic internal events, represent the YouTube business organization to all of Google, and help drive forward YouTube’s culture and business strategy by inspiring and aligning the team around YouTube’s mission, values, and objectives.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values, and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be able to combine creativity with the organizational skills to manage numerous different projects to tight deadlines simultaneously, as well as enjoy pitching to all kinds of journalists, bloggers and commentators (we find it hard too!), or producing internal communications and events for our employees. Things happen quickly at Google and to get stuff done here you need to be an enthusiastic team player - a self-starter who can work cross-functionally and isn&#39;t frightened to take risks or try out new ways of doing things.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/86928907262927558",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-06T21:01:53.764Z",
    "publish_date": "2019-03-06T21:01:53.764Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience managing communications in the media, government, or non-profit space.</li>\n<li>Experience in writing and strategic communications.</li>\n<li>Authorization to work in the United States</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>6 years of experience supporting C-suite level communications, building effective relationships and influencing leaders.</li>\n<li>Experience in project management and coordinating content for events.</li>\n<li>Ability to work calmly and maintain good judgment in fast-paced, high-stress environments.</li>\n<li>Ability to work well as part of a team and lead efforts across disciplines.</li>\n<li>Interested in learning about YouTube technology.</li>\n<li>Excellent attention to detail and creative and visual skills, including slide design. Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop strategic communications plans for YouTube’s Chief Business Officer (CBO), the YouTube business organization, and specific team initiatives.</li>\n<li>Produce communications for the CBO and other YouTube executives, including emails, slides, videos, and talking points.</li>\n<li>Develop clear and transparent messaging on complex, nuanced issues as well as creative strategies for communicating to employees across different functions and global offices.</li>\n<li>Provide advice to executives that reflects a deep understanding of their business and leadership style.</li>\n<li>Coordinate content and speakers, including high-profile media talent, for internal events of various sizes and audiences.</li>\n</ul>",
    "title": "Head of Internal and Executive Communications, YouTube, Business"
}