{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWFU_0SQPIVirByf2raiA1VkSmwmQbxfcf3BcEBsaYMSOgCPMA3T0GNquJYjiuXDOKCZZFTqELP85CkHyx8BjscRLooIRv6HlFB9mw8LsdKczO78mhQ5Sf22mwY%3D_V2&jobTitle=Accounting+Manager%2C+Supply+Chain&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-10T15:31:42.106Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s business objectives.</p>\n\n<p>The Google Fixed Assets (gFA) team manages the Global Accounting for Google’s entire CapEx portfolio, manufacturing operations and related expenses. This infrastructure is at the foundation of Google - the global data centers, networks and integrating hardware and software that powers both our unique customer products and services and our internal operations. \n</p>\n\n<p>As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions in the Technical Infrastructure (TI) area. You will be focused on improving the control environment in TI and playing a key advisory role to our business partners including Logistics, Supply Chain Planners and FP&amp;A teams.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4752429586776064",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:32:17.576Z",
    "publish_date": "2019-02-27T19:54:14.775Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Industry accounting experience in the inventory/manufacturing area (e.g. costing/valuation, physical tracking, warehousing/logistics) and/or fixed assets</li>\n<li>Experience with internal controls and process improvement</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CA/CPA or equivalent.</li>\n<li>Past experience with working on SOX compliance &amp; internal control frameworks.</li>\n<li>Proven ability to work in a cross-functional, fast-paced environment, and to lead and drive complex operational initiatives.</li>\n<li>Superior analytical skills (including handling big data), combined with impeccable business judgment and ability to communicate effectively with senior management.</li>\n<li>Demonstrated job stability with increasing levels of responsibility and a track record of successfully managing cross-functional initiatives</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be the primary accounting contact point for main TI business partners (Operations, Supply Chain, Logistics, Engineering).</li>\n<li>Partner with TI to implement on process and systems plans to automate tracking and accounting of Google’s TI equipment.</li>\n<li>Drive constant improvements on TI processes to drive higher standards of quality in fixed asset accounting.</li>\n<li>Represent fixed asset accounting requirements and deliverables in systems implementations while working with TI business partners to advise on new product areas, business decisions, opportunities for efficiencies, problem root cause analysis, etc.</li>\n<li>Execute key SOX controls for TI asset management, while playing an advisory role in establishing internal controls across various teams in Technical Infrastructure.</li>\n</ul>",
    "title": "Accounting Manager, Supply Chain"
}