{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRUGmK-NsrFPinzI-6f7xze-4kf9lxvz2I-kKPRRR4oSOgASYQ8wlxeQvIffInBgxkkShjukdJoAzWaXXEpLc2Zdy-EPABV7dzWZzQzGjX0Nw_n-dCQ5F2bW2Xs%3D_V2&jobTitle=Quantitative+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-13T16:31:51.047Z",
    "description": "<p>Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. Working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.<br><br>As someone who knows the workings of the core Finance team inside and out, you&#39;ll lead individual projects to transform planning, tracking and control processes. You&#39;ll provide senior level management with insightful recommendations, planning and reporting support.</p>\n\n\n<p>As a Quantitative Analyst on the Revenue team you will be at the cutting edge of data analysis, using analytical rigor and statistical methods to mine through data and answer the complex revenue and monetization questions that other analysts can’t take on. You will work with high-performing cross-functional teams across the company, including other Finance, Quant and Engineering partners to play a core role providing analytical and technical solutions in support of Google’s key business functions.\n</p>\n\n\n<p>With this role combining elements of finance and product analytics, you should be experienced with and passionate about using data to address complex business issues and drive strategy recommendations. Strong performers in this role will be a self starter and an independent, solution-oriented thinker with a strong background processing huge data sets, applying analytical rigor and statistical methods, and driving toward actionable insights and solutions.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/126165988748993222",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-13T16:31:51.047Z",
    "publish_date": "2019-03-13T16:31:51.047Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of relevant work experience involving quantitative data analysis.</li>\n<li>Experience with statistical software (e.g., R, Python, MATLAB, padas) and database languages (e.g., SQL).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in quantitative discipline (e.g., Statistics, Operations Research, Economics, Computational Biology) or equivalent practical experience.</li>\n<li>Substantial real-world experience, especially in areas such as data and/ or forecasting.</li>\n<li>Excellent analytical and quantitative skills, and attention to detail, as well as demonstrated willingness to both teach others and learn new techniques.</li>\n<li>Demonstrated ability to communicate complex analytical concepts to an executive audience.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide analytical support and make progress to drive impact even under ambiguous environment.</li>\n<li>Proactively Research new ways of modeling to unlock actionable insights or improve financial process for Finance and Google</li>\n<li>Conduct end-to-end analysis that includes data gathering and requirements specification, processing, analysis, ongoing deliverables, and presentations.</li>\n<li>Distill and communicate the essence of your technical work to audiences of all levels and across multiple functional areas while formulating robust, actionable recommendations. Work with a team of analysts responsible for pioneering machine learning and advanced analytics to Finance</li>\n<li>Interact cross-functionally with a wide variety of people and teams. Contribute to the development of the analytical frameworks, tools, skills, culture and impact for Finance and Google.</li>\n</ul>",
    "title": "Quantitative Analyst"
}