{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfFkI_wwafPkRWqVws6qa3fMoK3i6NgQc3FbGRwv-8YSOgASYQ8wHOFLa6UCsos2jLXyOZZZgSbQERCOnlq6cRgSR3CuT6tJ1UMRAivUHIr_Dnkr1VddxkCKDno%3D_V2&jobTitle=Product+Marketing+Manager%2C+Shopping+Actions%2C+Policy+Marketing&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-20T20:01:52.224Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>Our job is to develop cohesive narratives across products to the market, and to drive adoption of our solutions. \n</p>\n\n\n<p>As a Product Marketing Manager, you&#39;ll develop narratives, messaging and positioning for products, activate our narratives at tentpole events and press moments, and drive adoption of our solutions. You&#39;ll drive go-to-market strategy, positioning, awareness and acquisition campaigns for key areas of Google’s Shopping business.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/114957707204534982",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T22:32:15.916Z",
    "publish_date": "2019-02-27T22:32:15.916Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience working in product marketing functions in advertising.</li>\n<li>Experience within the digital advertising industry with Internet and advertising technologies and surrounding policy environments.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with stakeholders and executing strategies to deliver solutions. Experience managing a team.</li>\n<li>Ability to lead/evaluate issues independently in a fast-paced environment.</li>\n<li>Ability to develop/implement creative ideas and manage competing projects with tight deadlines.</li>\n<li>Ability to simplify complex information without losing key ideas and messages.</li>\n<li>Demonstrated analytical and organizational skills. Ability to communicate effectively, and an aptitude for learning.</li>\n<li>Excellent written, presentation and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop messaging/positioning for policy changes given various external factors.</li>\n<li>Be a thought-partner with Google’s Legal, Policy and Product teams to develop strategies for messaging ads policy changes to the market.</li>\n<li>Design and execute global messaging to drive product adoption.</li>\n<li>Develop growth strategies, including campaigns, media, co-marketing, events, and lead generation.</li>\n<li>Work closely with direct and online sales teams on industry strategy and messaging.</li>\n</ul>",
    "title": "Product Marketing Manager, Shopping Actions, Policy Marketing"
}