{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWvfOuXfACauerZKIWAw8yTsrNKuSY8oLP5mfQ0qdxgSOgCPMA3TtG6V_ywLTSOWxXQTjhIHwgmjc_TUTKqLgOqz7bhBW29tN4JiAcNcMRabaW-dgouUStfC_Vw%3D_V2&jobTitle=Project+Analyst%2C+Alphabet+Finance+Project+Management+Office&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:40.587Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>As a Project Analyst in the Alphabet Finance Project Management Office (PMO), you will work closely with multiple groups across Google and Alphabet, primarily in Finance, Legal and Corporate Engineering. Your job will be to structure projects with your stakeholders, define project goals and risks to execution, gather and define comprehensive requirements, design new business processes, effective change management to deliver on planned benefits and usher projects through the entire project lifecycle, including clearly communicating status, risks and remediation plans to executive stakeholders.\n</p>\n\n<p>In this role you will think strategically and with excellent business acumen, using your understanding of Finance to guide decision-making, solve problems, provide analytical insight and business judgment to support strategic and tactical initiatives across the Alphabet organization. You will need to be able to navigate the organizational structure of various functions and product areas, building effective relationships not only with partner teams but also with their stakeholders in management. You will be comfortable with ambiguity and tight deadlines and will be an innovative thinker who understands how the organization comes together, from finance to reporting. You enjoy problem solving and strategy and seek out new ways to solve complex finance operational challenges, finding the right balance between risk, speed and cost.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6655310553088000",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:43.105Z",
    "publish_date": "2019-02-27T19:50:43.105Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of relevant work experience.</li>\n<li>Experience in a business analyst role, defining and documenting business requirements and processes with teams inside and outside Finance.</li>\n<li>Experience in Finance systems and Finance business processes.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA,CA or MBA degree.</li>\n<li>Experience in front-to-back project management, supporting cross-functional strategic initiatives.</li>\n<li>Experience in business process design and change management.</li>\n<li>Understanding of finance systems and how they support various business processes, including O2C, P2P, R2R, H2R and A2R.</li>\n<li>Excellent organizational, analytical and documentation skills, detail and deadline oriented.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Assist in driving projects through the entire project lifecycle with your stakeholders.</li>\n<li>Facilitate cross-functional coordination across projects, establish and lead working group meetings, manage workstream dependencies and the impact on downstream working groups.</li>\n<li>Defining project goals, develop comprehensive cross-functional project plans, track accomplishments/milestones/key challenges/change control and effectively communicating status, risks and remediation plans to executive stakeholders.</li>\n</ul>",
    "title": "Project Analyst, Alphabet Finance Project Management Office"
}