{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Redwood City, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYlh-e9rs2Ili6KoKSrk04WbF4NnTxELt0GEZQ0qaUcSOgCPMA3Tvuq5n98JUrIG7GSrIDZExrGGJImih5-X0X_9Kwf_4NWJxttjXNB_Ra0Jeg5m4i2ZI9i_j5s%3D_V2&jobTitle=Tools+and+Systems+Program+Manager%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:35:02.494Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Vendor Strategy and Operations Team provides a central vendor management strategy and framework enabling Google Customer Solutions (GCS) to scale operations globally in a sustainable and efficient way. </p><p>As a central team, we provide business critical insights to shape the engagement strategy of our global vendor salesforce and ensure alignment of goals and execution as we grow the business. Team members are experts in business strategy and operations, are analytical and strategic, as well as highly pragmatic and results-oriented.</p><p>As the Tools, Systems and Security Program Manager, you will be partnering with GCS vendor partners, program managers and tool owners to ensure that our teams have the tools in place to streamline their workflows for maximum efficiency. </p><p>You’ll capture feedback, help design solutions and coordinate rollout and implementation to ultimately drive efficiencies, lower costs, and improve the performance of our vendor teams. You will need to work extremely well cross-functionally and have excellent stakeholder management skills. You will be a effective communicator, able to engage with leadership within Google. Additionally, you will often work across offices, business units, time zones and hemispheres.  </p><p>In this role, you will be responsible for designing and managing permissions and security for our vendor teams. You’ll work closely with internal partners to develop desired security and privacy solutions, understand business drivers and design systems and solutions that scale appropriately and meet the needs of our different businesses. In addition to systems design, you will act as the liaison between the Telephony team and our Sales teams. You’ll need to be knowledgeable about telephony and our customer support systems. As the liaison, you will understand business requirements, prioritize requests from multiple teams and support the teams’ requests from start to finish. You will manage projects from conception to delivery and communicate with all stakeholders effectively.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6278990530412544",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:50:51.809Z",
    "publish_date": "2019-02-27T19:50:51.809Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, a quantitative field or equivalent practical experience.</li>\n<li>3 years of experience in vendor sales and management.</li><li>Project management, technical and analytical experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or other Master&#39;s degree in a management or other technical or engineering field.</li>\n<li>Experience in Telephony and Interactive Voice Routings/Responses (IVRs).</li>\n<li>Ability to formulate hypotheses, design tests and use problem-solving techniques to evaluate solutions with excellent business judgment.</li>\n<li>Excellent project management, technical and analytical skills.</li>\n<li>Excellent problem-solving, interpersonal skills, and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work cross-functionally and across the globe to gather requirements, build project plans/business requirements documents, get approval and execute system implementations.</li>\n<li>Manage and communicate testing and launches, ensuring minimal impact to the organization by coordinating user acceptance testing (UAT), pilot and launch schedules.</li>\n<li>Collaborate with data security and gTech to maintain security and implement standardized permissions across Google Customer Solutions (GCS) vendor teams.</li>\n<li>Serve as the telephony liaison to ensure requirements, deadlines, and limitations are properly understood, communicated and agreed upon between teams.</li>\n<li>Provide expertise to business/product around telephony configurations, call flows, functionality and processes as well as design and implement new or improved telephony solutions dependent on business needs.</li>\n</ul>",
    "title": "Tools and Systems Program Manager, Google Customer Solutions"
}