{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckftp5CZGrrd4DNqpBXjSONchBDUK2I4BqZjqKUdSr3oSOgCPMA3TTFL03Y5c6ztWou0I94yV4t_3CM5vFgyAPP9t4JPJ8sjAsXwF9l-eQEZbqQw9AvFm2WKlyqA%3D_V2&jobTitle=Program+Manager%2C+Technical+Enablement%2C+Cloud+Partnerships&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-27T12:01:36.789Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>The Cloud Partnerships team is focused on accelerating the adoption of Google Cloud by attracting and growing partners who can bring in new customers and make them successful - while we focus on fueling our partners with a profitable business. The Cloud Partnerships team is dedicated to delivering a partner program that creates value in our partners’ businesses. Our goal is to reward and recognize our partners’ successes as they harness the collective strengths of our organizations to deliver an exceptional experience for our customers.\n</p>\n\n\n<p>As the Americas Technical Enablement Program Manager, you will be responsible for identifying areas of improvements from a partner perspective, prioritizing and implementing technical ideas into practical forms to lead to an improved partner experience. You will oversee all technical aspects of the Google Cloud partner sales process, improve it with your insightful data analysis, technical narrative, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality technical solutions and that the Google Cloud program is kept on the cutting edge.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5992042454646784",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T18:31:44.116Z",
    "publish_date": "2019-03-18T18:31:44.116Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience</li><li>6 years of experience working in Enterprise Software Sales, Marketing, Sales Operations, or relevant experience.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working on Enterprise technology.</li>\n<li>Partner Engineer or Partner Technology Manager experience.</li>\n<li>Fluent in English and either Spanish or Portuguese.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Oversee the technical relationship with our Americas Google Cloud partners. Enable them at scale to manage product and solution briefings, proof-of-concept work and technical delivery for their customers.</li>\n<li>Develop and launch new enablement programs to accelerate partner technical readiness.</li>\n<li>Promote Google Cloud’s technical benefits to all partners, big and small.</li>\n<li>Lead cross-functional collaboration across Google Engineering, Learning and Development, and Product teams in order to improve partner integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution on Google Cloud.</li>\n</ul>",
    "title": "Program Manager, Technical Enablement, Cloud Partnerships"
}