{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke2p2m2Q3WbihYDFZG35dJFmoYMiOwAhRCt8tapglgESOgASYQ8wv2_IBzN6nrK18MAcHFddtNhhxiQ6HlT6uwT4O-Fzx8ZvgPxI5TTXBzaDE4hTKJz27QwtNa0%3D_V2&jobTitle=Global+Product+Lead%2C+YouTube+for+Small+Businesses&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T02:01:49.409Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Small Business team is at the heart of innovation and growth for Google’s smallest customers. We are focused on understanding the needs of all segments through market research, scaled product feedback, and testing new products with small businesses. \n</p>\n\n<p>As the Global Product Lead on YouTube for Small Businesses, you will be passionate about helping small businesses achieve success on YouTube. You will partner closely with Product Managers and Engineering to make sure that the products being built reflect the needs of small businesses around the world, and work with global sales teams to set the commercialization strategy that will drive business growth.\n</p>\n\n<p>You have a good understanding of the local advertising space and understand the key challenges for SMBs. You strive to improve the status quo and critically think through business problems and synthesize information for an executive audience. You have a deep understanding of business and stakeholder needs combined with communication skills and analytical abilities. You&#39;re results focused, a fast and structured executor, and have the ability to stay focused on the long-term goals of the team.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/83403454359184070",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T22:32:12.361Z",
    "publish_date": "2019-02-27T22:32:12.361Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical or business-orientated field or equivalent practical experience.</li>\n<li>5 years of experience in global business, strategic partner management, business development, or consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>SQL experience.</li>\n<li>Experience in local and small businesses marketing solutions.</li>\n<li>Experience analyzing data and building models.</li>\n<li>Excellent verbal and written communication skills, as well as the ability to work cross-functionally across teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive product strategy and influence the product roadmap through data-driven thought leadership, market feedback and deep partnership with Product Management team.</li>\n<li>Identify new opportunities to make YouTube work for small businesses. Test hypotheses, size opportunities, and build the business investment case.</li>\n<li>Be a trusted advisor to product managers and sales leaders, helping to identify connection points and drive collaboration across Google Customer Solutions and Small Business Ads.</li>\n<li>Manage new product/feature launches including communications, training and assisting with product readiness testing on an as-needed basis. Collaborate with product, marketing and sales to support product launches and to design and implement scaled business growth strategies.</li>\n</ul>",
    "title": "Global Product Lead, YouTube for Small Businesses"
}