{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Seattle, WA, USA; Kirkland, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdrSfalzx_4HCDtg3aVkMSp5V2aLJjyqGUsV9kMv1fESOgCPMA3TKS1LJ00P9QUbVo9_icno4tf38j0iAspp0ms0QNhKmIpVjwLhqCRtk08DTkqpSjQ0lPn86Yg%3D_V2&jobTitle=Cluster+Security+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:35.305Z",
    "description": "<p>As a Cluster Security Manager, you will manage the physical security program for locations within Google&#39;s operations in the North West of the United States. Your responsibilities will include risk assessments, emergency planning and response, access control and CCTV systems, protective services, event security, contract security services for offices and public facing spaces. Additionally, you will oversee contract employees performing specific security objectives and monitor vendor performance and expenses. In this role, you will develop tactical plans that are consistent with global initiatives, and deployed within the region’s budgets and priorities, for the protection of Google and Fiber personnel, facilities, and public facing environments.</p><p>From keeping Googlers safe and secure to managing disruptive events, the ability to anticipate, deter, detect, and act are the pillars of Google’s Global Security and Resilience Services (GSRS) team. As a member of GSRS you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor enterprise risks that could affect business activities and provide business leaders the information they need to make critical decisions. You&#39;ll collaborate with cross-functional teams to create innovative strategies and develop best in class programs that drive sustainable effectiveness.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6338727594098688",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-02-27T19:52:02.670Z",
    "publish_date": "2019-02-27T19:52:02.670Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience managing security operations.</li>\n<li>5 years of experience in multi-use developments and working with property management companies.</li>\n<li>Experience in managing security operations and security personnel and delivering customer-oriented security programs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s Degree in a related field.</li>\n<li>Experience in security system design, installation, and maintenance (e.g., Access Control, Intrusion, CCTV).</li>\n<li>Experience with standard software applications for communications, productivity and presentations.</li>\n<li>Ability to handle multiple priorities in a fast-changing environment.</li>\n<li>Excellent problem-solving and analytic skills.</li>\n<li>Excellent attention to detail and written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage our vendor staff to respond to emergencies, support planned and unplanned operations, and events and special activities.</li>\n<li>Monitor local and regional challenges that may affect business operations, and lead incident/crisis response. Partner with all Google business units to identify safety and security deficiencies, and develop customized policies and procedures to gain compliance with regulations, internal and external to Google.</li>\n<li>Partner with other Global Security and Resilience Services (GSRS) teams (e.g., Investigations, Intelligence, Protective Services, Global Security Operations Center) on issues that impact the security and safety of Google and its employees.</li>\n<li>Develop and implement security standards, policies, and practices to make continual improvements and increase the effectiveness of the security program. Develop and deliver training on security topics.</li>\n<li>Collaborate with and grow relationships with other groups within Google (e.g., Real Estate and Workplace Services, HR, Legal, YouTube) and security groups outside of Google in relation to daily operations.</li>\n</ul>",
    "title": "Cluster Security Manager"
}