{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcouzfXkfDiEzWFQIeuImPisPm_l_dspvDhyTVQMCp4SOgASYQ8wzGs-Ht4GjpzVKIJiqB_-D8WF9qvpYTAmtvyEFG0IWcl9hN3vYS7Mv1IZaT_jqzHHIH8hzV8%3D_V2&jobTitle=Director%2C+Product+Management%2C+Sellside&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T23:02:13.678Z",
    "description": "<p>At Google, we know building trust with users comes hand-in-hand with the dependable quality and reliability of our products. The Advertising Technology team helps ensure that our advertising products work effectively for our customers. When a Sales team colleague escalates an issue relating to a product such as Google Ads or AdSense, we dig in, using our technical expertise to find the solution. You use your strong computer science background to answer technical questions from colleagues, partners and clients regarding ad specifications and technology. Your communication skills come in handy when you break down complex product features and present them in an easy-to-understand manner. With an array of internal tools at your disposal, you troubleshoot ad functionality and display issues, working on higher-level projects to improve the team&#39;s operations. All of your efforts go toward ensuring that our ad products are working and our customers optimize them to deliver desired results. \n</p>\n\n<p>As Product Management Director for Sellside, your team’s mission is to ensure publishers, both large and small, can create great content for the mobile Web by bringing to life exceptional technology platforms including Google Ad Manager and AdSense for Content. You will do this by driving industry forward-thinking strategies around the ever-evolving content consumption landscape and policies - all while keeping the end user top of mind.</p><p>Users come first at Google. Nowhere is this more important than on our Advertising &amp; Commerce team: we believe that ads and commercial information can be highly useful to our users if, and only if, that information is relevant to what our users wish to find or do. Advertisers worldwide use Google Ads to promote their products; publishers use AdSense to serve relevant ads on their website; and business around the world use our products (like Google Shopping, and Google Wallet) to support their online businesses and bring users into their offline stores. We build and maintain the platforms that have made Google what it is today, and are constantly innovating to deliver the most effective advertising and commerce opportunities of tomorrow.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/72063563608269510",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:54:26.131Z",
    "publish_date": "2019-02-27T19:54:26.131Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>10 years of experience building online advertising technology products.</li>\n<li>Experience in working with sellside platform technology.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Track record of success in the full lifecycle of product management: product vision and roadmaps, writing exceptional Product Requirement Documents and shipping high visibility and complex products on time.</li>\n<li>Experience managing high profile decisions and escalations that require executive coordination and sign-off.</li>\n<li>Highly technical, with a track record of complex product work that spans business and consumer users.</li>\n<li>Strong written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Own and lead product management for Google Ad Manager (including Reservations) and AdSense.</li>\n<li>Be responsible for end-to-end product development processes including making key product roadmap decisions and building, launching and landing products.</li>\n<li>Serve as an external spokesperson representing Google’s sellside products across the industry including influential organizations, top customers and the press.</li>\n<li>Be responsible for the product groups’ success relative to achieving key metrics.</li>\n</ul>",
    "title": "Director, Product Management, Sellside"
}