{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSPrMBgxyfgyweCdZS54ryFv9QEJTud8t7zNUti-BZgSOgASYQ8wN2MyUkiZG1vDyfLQ4ZMRhf6BM55AKSXWkEhcILmvB8eq7KWL7_xgWVfJYjWCNoEFkZzqnUU%3D_V2&jobTitle=Regional+Head+of+Industry%2C+Video+Sales%2C+Multichannel+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T16:01:56.310Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As a Regional Video Sales Head of Industry for the Multichannel Solutions sector, you will support and grow new video business with Google’s top advertisers, and manage the relationships with those advertisers. You will serve as their advocate within Google, while collaborating with other Google sales teams to provide them with a comprehensive portfolio of marketing solutions. You will also work cross-functionally to help develop scalable, cross-platform advertising solutions around YouTube and video.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/120219092742218438",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-19T16:01:56.310Z",
    "publish_date": "2019-03-19T16:01:56.310Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of television/video sales experience from an agency, network, broadcasting, brand management, video publishing, or similar role.</li>\n<li>3 years experience in a front-line people or mentorship management role.</li>\n<li>Experience building sales and activation plans, managing against quota, negotiating and closing deals.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>3 years of television sales experience with a proven track record in meeting quotas.</li>\n<li>Knowledge of the television and digital video landscape.</li>\n<li>Knowledge of the television and digital video landscape, and brand objective-based selling.</li>\n<li>Broad base of industry contacts with television planners and buyers.</li>\n<li>Ability to travel as required.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build and foster long-term senior relationships with advertiser television budget owners, as well as their planning and buying agency counterparts.</li>\n<li>Design and implement long-term client marketing strategies around YouTube and video, with a focus on Programmatic Video.</li>\n<li>Collaborate with other Google sales teams to provide clients with a comprehensive portfolio of marketing solutions.</li>\n<li>Work cross-functionally to help develop scalable cross-platform advertising solutions around YouTube and video.</li>\n<li>Act as a key Video Lead for internal and external video sales pitches and C-Level conversations.</li>\n</ul>",
    "title": "Regional Head of Industry, Video Sales, Multichannel Solutions"
}