{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVu3WTfLKta9cVDVd1z-Jn_e6dwOeBWgfDe7QrbKHJASOgASYQ8wOjYPutMWUbj4G4L3V5L2Zj4PVjeS6gzqkmQi7EajAqGlwdBpS92qg2V3hiCedWF_PXQW-as%3D_V2&jobTitle=Strategic+Partner+Manager%2C+OEM+Partnerships+%28Mobile%2FVR%29%2C+YouTube&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-18T15:31:50.343Z",
    "description": "<p>The Global YouTube Product Partnerships team leads development of YouTube&#39;s distribution, strategic marketing and technology licensing partnerships. In this role, you will help craft the strategy to drive distribution of YouTube content across all platforms, generate awareness and increase usage, and work to identify partnership opportunities to aid product development.\n</p>\n\n<p>On this team you will help drive the growth of YouTube mobile apps through deep partnerships with Mobile and VR original equipment manufacturers (OEM). You have strong partner management abilities, flawless execution, deep technical knowledge about mobile OEM device ecosystem, video technologies and a passion for media and entertainment. \n</p>\n\n<p>In this strategic role, you will be managing mobile and VR OEM partnerships across all of YouTube apps by providing a partnership vision and advocating forward-looking video technology adoption in creating the best user experience on mobile devices. \n</p>\n\n<p>You will work closely with YouTube multiple teams to provide a holistic growth strategy by key OEM partner, identifying new and exciting partner implementations across their mobile device portfolio.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139788357459681990",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-18T15:31:50.343Z",
    "publish_date": "2019-03-18T15:31:50.343Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>7 years of work experience.</li>\n<li>4 years of experience in business development, OTT app distribution, streaming video industry and mobile device partnerships.</li>\n<li>Relationship management experience.</li>\n<li>Experience negotiating agreements with device manufacturers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Experience working with legal contracts, be able to interpret legal documents and work with attorneys on specific contract language.</li>\n<li>Able to analyze and structure complex negotiations with a proven track record of negotiation and execution.</li>\n<li>Holistic understanding of the mobile and telco industry, especially as it relates to video streaming technologies.</li>\n<li>Clear demonstration of strategic vision, go-to-market plans, execution with global perspectives and scope.</li>\n<li>Strong communication skills with the ability to collaborate across functions with both technical and business teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive YouTube’s device partnership strategy with mobile and VR OEMs and lead the negotiation of term sheets/agreements with partners</li>\n<li>Manage Mobile OEM relationships ensuring the adoption of various video streaming technologies (e.g. codecs) by OEMs, and leveraging device innovations to drive usage of YouTube apps</li>\n<li>Build detailed account plans by priority OEMs clearly articulating growth opportunities</li>\n<li>Work with leaders and cross-functional teams in bridging internal and external priorities, roadmaps and perspectives</li>\n<li>Develop performance Key Performance Indicators (KPIs) and data driven approaches to measure impact and success. Lead quarterly business reviews with partners, identifying areas for improvement and growth.</li>\n</ul>",
    "title": "Strategic Partner Manager, OEM Partnerships (Mobile/VR), YouTube"
}