{
    "application_instruction": "<p><b>Applications are due by June 27, 2019 at 11:59pm PT. Applications will be reviewed on a rolling basis and it&#39;s in the candidate&#39;s best interest to apply early. Thank you for your patience while we consider your application.</b> <br> </p><p>To start the application process, you will need an updated CV or resume and a current unofficial or official transcript in English. Click on the “Apply” button on this page and provide the required materials in the appropriate sections (PDFs preferred):</p>  <ul> <li>1. In the “Resume Section:” attach an updated CV or resume.</li> <li>2. In the “Education Section:” attach a current or recent unofficial or official transcript in English.</li> <li>Under “Degree Status,” select “Now attending” to upload a transcript.</li></ul> <br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Kirkland, WA, USA; Los Angeles, CA, USA; New York, NY, USA; Palo Alto, CA, USA; San Bruno, CA, USA; Seattle, WA, USA; San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRw-eayPcuMxi0_4KWi3NMU4t-cXpalwJ4UpkdkghlwSOgASYQ8wvQKHoaZ850IkE5TEPWHDYkSVwKXHCrveKgUO21Wxg95pOcu0SEMwQqJBwS6zHBON9BSTY70%3D_V2&jobTitle=Software+Engineering+Intern%2C+PhD%2C+Fall+2019&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T16:02:38.654Z",
    "description": "<p><br> Join us for a unique 12-14 week paid internship that offers personal and professional development, an executive speaker series, and community-building. This program will give you an opportunity to work on complex computer science solutions, to develop scalable, distributed software systems, and also to collaborate on multitudes of smaller projects that have universal appeal - which requires research, awareness, interactivity, and the ability to ask the right questions. </p> <p>From Google Ads to Chrome, Android to YouTube, Social to Local, Google Engineers are changing the world one technological achievement after another. We focus on being a collaborative, global organization consisting of engineers who are ready to address some of technology&#39;s greatest challenges. As a Software Engineering Intern, you will work on our core products and services as well as those which support key functions of our engineering operations. Depending on your background and experience, you will be working in one of the following areas: </p> <p>Product and Systems Development </p><p>Whether it&#39;s finding new and innovative ways to advance search quality, building computing platform and networking technologies, automating the indexing of videos, or continuing to refine and scale complex auction systems (just to name a few), you will be developing solutions to some of the most technical challenges out there. You will research, conceive and develop software applications to extend and improve on Google&#39;s product offerings, and collaborate on scalability issues involving access to massive amounts of data and information. Examples of specialist domains include: UI development with AJAX and similar technologies, security, embedded systems and mobile apps (Android), developer tools (IDEs, large-scale build systems, compilers). </p> <p>Engineering Productivity </p><p>The Engineering Productivity team addresses a broad set of complex technical challenges for optimizing Google&#39;s software development lifecycle. As a Software Engineer, Tools and Infrastructure Intern, you will use your analysis, design, and programming skills to build innovative solutions for the next-generation infrastructure related to build, test, release, and monitoring of large scale applications. You will also explore new approaches to automation, challenge the status-quo, and fundamentally improve the workflow for Google engineers. </p> <p>Site Reliability </p><p>Software Engineers working in Site Reliability are involved in every facet of Google&#39;s production and work on the cutting edge of cloud-based computing. As a member of this team, you are in the thick of everything involved with keeping Google running, from code-level troubleshooting of traffic anomalies to maintenance of our most cutting-edge services; from monitoring and alerts to building new automation infrastructure. Software Engineers on this team love to create robust and scalable software that scales to tens of millions of users. You will handle challenging, novel situations every day, and work with just about every other Engineering and Operations team to provide services and applications </p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128068260231815878",
    "location": {
        "address_lines": [
            "Palo Alto, CA, USA"
        ],
        "city": "Palo Alto",
        "country": "CA",
        "country_code": "US",
        "display": "Palo Alto, CA, USA",
        "lat": 37.4418834,
        "lon": -122.1430195
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=1168x324&zoom=12&signature=GOsGrZ9EmFQ3uc0juSXRlav_Xl4=",
        "large_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=1024x324&zoom=12&signature=WhIGOqmPY8srQgQr1foTtlDHCuw=",
        "small_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=600x400&zoom=12&signature=clZaI6MOROjEZw8MkX1WgHhMqS0=",
        "small_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=600x400&zoom=12&signature=xx5ozNYJWlySSyqNwNprOYpuunw="
    },
    "modified": "2019-02-27T19:50:07.529Z",
    "publish_date": "2019-02-27T19:50:07.529Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Currently pursuing a PhD degree in Computer Science or in a related technical field.</li> <li>Programming experience in one or more of the following: C/C++, Java or Python.</li> </ul><br><p>Preferred qualifications:</p><ul> <li>Returning to a degree program after the completion of the internship.</li> <li>Implementation skills with one or more general purpose programming languages, including but not limited to: Java, C/C++, C#, Objective C, Python, JavaScript and/or Go.</li>\n<li>Research experience in the following areas; Algorithms, Architecture, Artificial Intelligence, Compilers, Database, Data Mining, Distributed Systems, Machine Learning, Networking and/or Systems.</li> <li>Demonstrated background in computer science, with competencies in data structures, algorithms and software design. </li> </ul>",
    "responsibilities": "<ul> <li>Research, conceive and develop software applications to extend and improve on Google&#39;s product offering.</li> <li>Contribute to a wide variety of projects utilizing natural language processing, artificial intelligence, data compression, machine learning and search technologies.</li> <li>Collaborate on scalability challenges involving access to massive amounts of data and information.</li>\n</ul>",
    "title": "Software Engineering Intern, PhD, Fall 2019"
}