{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; New York, NY, USA; Chicago, IL, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQHFE3tvayD5jnxf1wvLAAr0ki1XehwnapGK5DEKgSUSOgASYQ8wZZhQRXK7PooxvLydWSx55ChKHNWJRZZ9B3o3gcpJFUfFCUaFzbWQlMsAtCD7Jatm6KH7A8k%3D_V2&jobTitle=Go-To-Market+Reach+Planning+Lead%2C+YouTube+and+Video&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-21T20:02:35.822Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Go-To-Market (GTM) Operations organization is a global team that serves as the product/market strategy and operations partner to Sales Leadership. We manage the in-market product commercialization process, from strategy setting to deployment, to market feedback and requirements, while also defining and executing on go-to-market plans that enable each region to achieve our business growth goals. The team provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps our partner teams to drive strategic partnerships and new initiatives forward.\n</p>\n\n\n<p>As the Americas YouTube/Video GTM Reach Planning and Measurement Lead, you will provide the organization with strategic, analytical, and commercialization support. You will partner with counterparts in GTM, global product solutions teams, and product management to define the vision and go-to-market strategy. In this role, you will contribute to the prioritization of product asks and the design and execution of initiatives to accelerate adoption of reach-related video solutions.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/72203657119965894",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:55:02.002Z",
    "publish_date": "2019-02-27T19:55:02.002Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in advertising or media planning, or equivalent project management experience in a technology/media company.</li>\n<li>Experience working with cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Detailed understanding of reach planning and the video and TV buying landscape.</li>\n<li>Ability to lead complex operational and strategic initiatives.</li>\n<li>Ability to work, collaborate, and influence cross-functionally. Ability to set a goal and vision for virtual teams and translate this into quarterly goals.</li>\n<li>Excellent communication skills, problem solving, and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Oversee reach planning, insights, and measurement in the Americas.</li>\n<li>Be accountable for internal and external adoption of our solutions and develop programs to activate at scale.</li>\n<li>Be a thought partner for products and markets, and identify opportunities through video planning and measurement.</li>\n<li>Influence cross-functional teams to advocate for product requests, lead data validation, and other processes related to product launch.</li>\n</ul>",
    "title": "Go-To-Market Reach Planning Lead, YouTube and Video"
}