{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSG4cjj_Sp1Jk6IMg8LEJ2zTfutyY-mJDG6cPQmUWFcSOgCPMA3TtqzXEUPIus0UUEVGIDJjAdQ--OSEYeu6A3C5hfFF9UPRoENbV7a68sjrR-ZjcjRKMhE3B5M%3D_V2&jobTitle=Solutions+Consultant%2C+Google+Cloud+Healthcare+and+Life+Sciences&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:44.113Z",
    "description": "<p>As a Solutions Consultant, you will work side-by-side with strategic Google Cloud Healthcare and Life Sciences customers. You’ll leverage your cloud computing expertise along with hands-on experience in the healthcare or life sciences industries, helping to lead flawless implementations and integration of custom features.</p><p>Together with the team, you will support implementations of Google Cloud Healthcare products, sharing best practices, providing guidance around architectures, data migration, capacity planning, and more. </p><p>Your understanding of the customer landscape, requirements, and challenges will enable you to work hand-in-hand with our product and engineering teams to design and implement scalable customer solutions on Google Cloud and take them to market.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6332326691930112",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T22:54:57.299Z",
    "publish_date": "2019-02-27T19:39:51.545Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or related technical field or equivalent practical experience.</li>\n<li>Experience working in a cloud computing environment (infrastructure, storage, platforms and/or data).</li>\n<li>Experience working in a healthcare and/or life science domain, including deploying solutions in healthcare and/or life sciences related IT infrastructure.</li>\n<li>Experience with one or more programming languages such as Java, Python, Go, JavaScript, C++ or similar</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other relevant technical field.</li>\n<li>Experience working with a variety of technology systems, designing solutions or developing applications in healthcare and/or life science environments.</li>\n<li>Understanding of current trends of healthcare and/or life sciences infrastructure, (including databases, enterprise integration buses, protocols, APIs and formats), security, networking and cloud-based delivery models.</li>\n<li>Ability to quickly learn, understand, and work with new emerging technologies, methodologies and solutions in the cloud/IT technology space.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide healthcare or life sciences domain expertise in supporting the technical relationship with Google’s customers. This includes (but is not limited to) product and solution briefings, proof-of-concept work, and the enablement of integrations allowing for a full deployment of products managing healthcare and/or life sciences data in Google Cloud.</li>\n<li>Recommend integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution using best practices on Google Cloud.</li>\n<li>Work hands-on with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments.</li>\n<li>Own the technical relationship with Google’s customers, including managing product and solution briefings, proof-of-concept work, and the coordination of additional technical resources.</li>\n<li>Travel to customer sites, conferences and other related events as required.</li>\n</ul>",
    "title": "Solutions Consultant, Google Cloud Healthcare and Life Sciences"
}