{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfbSeNkTgA0V3tEP7TUvHGGtUDUhKsFRffwJ67vc5DgSOgASYQ8wufCWcVzMGmmIhqUMKP8LclAzEc2vMVlAyrZ7jGIgbpnrmMYgzP9v8GzwjECKn7Od-r697G8%3D_V2&jobTitle=Head+of+Video+Activation%2C+Product+and+Sales+Activation&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T15:31:57.416Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Product and Sales Activation team (PSA) is a global team whose mission is to bring Product to Market and Market to Product across a variety of Ads products. We collaborate closely across partner teams such as Product Management, Marketing, Global Performance, and other Google Customer Solutions (GCS) teams. \n</p>\n\n\n<p>The Head of Video Activation, in the Product &amp; Sales Activation team (PSA), is responsible for the growth of the Video Ads business for GCS.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/123052543602238150",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-07T15:31:57.416Z",
    "publish_date": "2019-03-07T15:31:57.416Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>10 years of relevant work experience, including leading strategy, sales or operations.</li>\n<li>3 years of experience leading and developing teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or other advanced degree.</li>\n<li>Experience with performance marketing, as a practitioner or working directly with marketers.</li>\n<li>Experience having worked closely with Product teams.</li>\n<li>Ability to influence stakeholders and transform complex, ambiguous topics into simple, universally understood messages.</li>\n<li>Editorial voice, writing and design skills to craft narrative.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Articulate the long term product and sales vision for the Video Ads business to ensure that their advertising can reach thousands of users and yield steady revenue growth globally. Identify and size opportunities, build the business investment case, gain key stakeholder buy-in and attain resources.</li>\n<li>Collaborate with Product teams to deliver scalable solutions to all customers globally, leveraging a deep understanding of customer needs across regions, segments and business models.</li>\n<li>Define the go-to-market/sales strategy leveraging tools, training, collateral and program design to increase the focus and quality of video selling in the GCS channel.</li>\n<li>Design and implement an end-to-end sales process, working with cross-functional partners in sales operations.</li>\n<li>Foster a high performing team that delivers results and collaborates well with each other and across teams. Inspire, coach and develop team members to drive change.</li>\n</ul>",
    "title": "Head of Video Activation, Product and Sales Activation"
}