{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQg3fpw6kR9URIqfx6-DbD0rrX-ySb7PO0zDCx_EEvcSOgASYQ8w0buetgMFc-WJKKKJruLwBfEVpASr_6sbVl-MpK2YvTS99v6ReRyaErFfgvYmfvhUp4iWgqg%3D_V2&jobTitle=Contact+Center+and+Voice+Operations+Engineer&loc=US",
    "categories": [
        "NETWORK_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T17:31:29.988Z",
    "description": "<p>Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google&#39;s complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.</p>\n\n<p>The Customer Conversations Platform team designs, develops, deploys and supports in-house and third-party contact center applications sales as well as supports users to improve productivity and customer satisfaction. You will play a major role in planning, deploying and supporting new contact center infrastructure. You will work with both internal Google teams and external vendors to research, evaluate and implement new solutions.</p><p>Google is and always will be an engineering company. We hire people with a broad set of technical skills who are ready to take on some of technology&#39;s greatest challenges and make an impact on millions, if not billions, of users. At Google, engineers not only revolutionize search, they routinely work on massive scalability and storage solutions, large-scale applications and entirely new platforms for developers around the world. From Google Ads to Chrome, Android to YouTube, Social to Local, Google engineers are changing the world one technological achievement after another.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4546881145307136",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:47:38.595Z",
    "publish_date": "2019-02-27T19:47:01.052Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Networking, related technical field, or equivalent practical experience.</li>\n<li>Experience in software development tools and languages. (Python, Go, Java, or C++).</li>\n<li>Experience in Unix, Shell or Perl scripting to automate repetitive tasks.</li>\n<li>Experience running services, including requirements and capacity analysis, service configuration, monitoring and troubleshooting, and change management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in vendor management, software and hardware evaluation, selection, deployment and system monitoring tools.</li>\n<li>Experience in automating workflows and integrating Google tools with third-party systems.</li>\n<li>Experience supporting global voice and data infrastructure deployments involving several IT teams and business units.</li>\n<li>Experience designing, supporting and troubleshooting audio quality issues on a global voice and data network infrastructure.</li>\n<li>Hands-on debugging and troubleshooting skills on various audio manipulation platforms, including Audacity or Pro Tools.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Architect, design, deploy and roll out testing and verification systems to ensure the highest audio quality standards for an enterprise-level contact center and voice system.</li>\n<li>Coordinate new system deployments working with internal and external partner Engineering teams.</li>\n<li>Lead monitoring and troubleshooting of audio quality issues for Google’s contact center voice systems and toll free numbers.</li>\n<li>Develop and produce automation of workflows, audio quality monitoring and alerting.</li>\n<li>Develop and deliver presentations to provide internal training on audio quality troubleshooting and problem isolation procedures for contact center systems. Oversee the creation of new processes and tools to support additional requirements on an ongoing basis.</li>\n</ul>",
    "title": "Contact Center and Voice Operations Engineer"
}