{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUGjumt-MGT-CPEWFoUelpVEP-Ug0nfG36oJQGtiYmgSOgASYQ8w9145nq6f11IkkwHkHbVcgZ9Ougq8jdmbx6yS_I1dZSVjl93hW60uxZZ62Hlag8RqZF0kkcc%3D_V2&jobTitle=Agency+Sales+Lead%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-14T16:31:44.123Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As a Google Customer Solutions (GCS) Agency Sales Lead, you&#39;ll manage the day-to-day of our vendor partnership and lead engagements with agencies in the U.S. and Canada markets. You will enable your team to always reach for ambitious performance goals, while working with a wide variety of Small and Medium Businesses (SMB) agencies to deliver the optimal advertising solution for every partner and their clients.\n</p>\n\n\n<p>In this role, you will manage the overall performance of vendors, and continue our effective relationships with the country management and Marketing teams. You will focus on the strategy and execution in the SMB space, supporting GCS management, vendor management, and Marketing in running a successful Google Ads Agency Sales team. You also will work closely with the central management teams (Marketing, Sales Finance and Revenue Strategy Operations), while based at our vendor operations location in Redwood City.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/97014114452153030",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:56:09.147Z",
    "publish_date": "2019-02-27T19:56:09.147Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience in sales roles.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>Experience in sales and Google Ads account management.</li>\n<li>Experience in advertising sales, digital marketing, consulting, brand marketing, or in a fast-paced media agency environment.</li>\n<li>Experience with planning, forecasting, setting operational goals, and leading business reviews.</li>\n<li>Ability to take initiative.</li>\n<li>Excellent stakeholder management, coaching, mentoring, and leadership skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive same-store business development and product adoption to meet strategic goals.</li>\n<li>Implement and maintain business processes to support remote management.</li>\n<li>Institute a culture of communication, transparency, accountability, and constructive feedback.</li>\n<li>Conduct quarterly analyses, deduce actionable business intelligence, and formulate improvement plans.</li>\n<li>Coach and develop the vendor management team towards being a self-managed organization.</li>\n</ul>",
    "title": "Agency Sales Lead, Google Customer Solutions"
}