{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckePWtQQkznf1KxIdw6Pvz7osJZkIzkvuIVCmyxMgr5MSOgCPMA3T8icNocZgprE66sWrwMJaq4pujzlU75aqojhulTl29ZxTRy89XmTR7-4wgxKkyKhmOBrWWIw%3D_V2&jobTitle=Lead%2C+Vendor+Management+Office&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:28.317Z",
    "description": "<p>As the Lead of the Vendor Management Office, you will help build the strategy on how REWS (Real Estate Workplace Services) sources and evaluates vendors, considering the medium and long-term needs for the organization. You also provide direction, vision and team leadership on how REWS engages, manages and drives transformation and innovation across its vendor base.\n</p>\n\n<p>You will effectively influence at all levels, and will interact with both Googler and vendor leadership teams. You will gather relevant data by building frameworks to extract, transform and analyze information that will ultimately drive strategic recommendations to partner managers across REWS. Googlers depend on your ability to help find the right vendor partners, identify clear vendor acceptance criteria, drive supplier management governance, analyze vendor portfolio risk and track performance and output management, all while maintaining perspective on the long-term health of REWS’ vendor relationships. You will develop relationships, influence and collaborate with cross functional REWS teams, as well as Strategic Sourcing, XWS, Legal, and other partners across Google.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5840717039730688",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T22:45:53.265Z",
    "publish_date": "2019-02-27T19:45:13.185Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of relevant work experience in consulting, operations, or vendor strategy and management. 4 years of experience in commercial negotiations.</li>\n<li>Experience with negotiating and influencing including the ability to secure business terms, partner with Legal on contractual terms and align on key deliverables.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>JD, MBA or Master’s degree</li>\n<li>Experience with outsourcing/offshoring including vendor management, vendor transitions, new site launches, Statement of Work development, contracting, changing pricing models.</li>\n<li>Ability to interpret legal documents and work with attorneys to structure agreements that align to targeted deliverables and milestones.</li>\n<li>Ability to independently lead commercial negotiations, structure agreements and manage/deliver professional services.</li><li>Ability to think globally and strategically, influencing change across multiple business units and regions.</li>\n<li>Leadership level planning, analytical, interpersonal, and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Guide REWS direction and portfolio optimization of spend, partners and services.</li>\n<li>Partner with Googlers to understand new/renewing service requirements providing guidance on contracting, pricing, and supplier track record. Partner with Google teams to assess the delivery and performance from suppliers and partners.</li>\n<li>Prioritize vendor requirements across multiple partners, functions and service lines. Support vendor escalations on partnership issues.</li>\n<li>Identify key contract risks, prioritize, and develop plans to address via contract change.</li>\n<li>Develop and lead internal supplier management best practices and processes including the optimization of the end to end lifecycle of engagement management.</li>\n</ul>",
    "title": "Lead, Vendor Management Office"
}