{
    "application_instruction": "<b>Due to business needs, we are prioritizing candidates that are available to start in June of 2019.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVmdRUGP_oPUl1kyeYL7vZWVo61t9L5DuEC7bTiSDeUSOgASYQ8wEprLge2kq_3rtPlNe5ij7l7yUZ9L3Yaw7aup8YCfepO5ml6uqXatkkvTINcEbTZm_ptF_vQ%3D_V2&jobTitle=Associate+Account+Strategist%2C+Small+Business+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-14T22:02:22.502Z",
    "description": "<p>The Customer Solutions sales teams are trusted advisors who maintain a relentless focus on customer success by bringing the best Google has to offer.</p>\n\n<p>Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.\n</p>\n\n<p>In Small Business Sales, we believe there is both a science and an art to sales, and that sales at scale drives value for both our clients and Google. We help clients grow their business in a profitable manner by optimizing account performance and growing their Google Ads investment. In this role, you will gain knowledge of the online advertising industry, while developing strong business, communication, and analytical capabilities. This will allow you to work with and influence both internal and external stakeholders to drive positive impact for our organization and clients. \n</p>\n\n<p>You are the frontline of Google’s client-facing teams and will be responsible for a book of business and the business targets that come with it. The majority of your time will be spent on the phone consulting with clients of all sizes and types, advising them on tailored solutions on how to get the best return on their Google Ads investment. You will use your problem solving, business and objection handling skills to get the job done in a fast-paced, high-performing environment.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/78049686356665030",
    "location": {
        "address_lines": [
            "Ann Arbor, MI, USA"
        ],
        "city": "Ann Arbor",
        "country": "MI",
        "country_code": "US",
        "display": "Ann Arbor, MI, USA",
        "lat": 42.2808256,
        "lon": -83.7430378
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=1168x324&zoom=12&signature=8LnraDVYxGhIHyKG7b7PRQ5sHnc=",
        "large_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=1024x324&zoom=12&signature=v7eA4ssEZFb7guDMZdU5UX8H-cM=",
        "small_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=600x400&zoom=12&signature=oFhX4JnYJqwRVThGPXhNJsUnacM=",
        "small_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=600x400&zoom=12&signature=VKXQIvW8QoK0VuXz2iHxr-9Alno="
    },
    "modified": "2019-03-15T15:01:58.926Z",
    "publish_date": "2019-03-15T15:01:58.926Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>1 year of work experience in sales, account management, customer support, marketing or consulting.</li>\n<li>Individuals applying for this position will not be eligible for immigration sponsorship.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Familiarity with Google Ads and online advertising.</li>\n<li>Experience in providing strategic advice to help our advertisers get the best return on advertising investment.</li>\n<li>Experience with structuring storylines for presentations from uncovering insights to developing materials.</li>\n<li>Proven track record in advertising sales, media account management, and successful client engagement and consistent business growth. Proven success working against an assigned quota.</li>\n<li>Ability to leverage your business acumen to strategically assess and help solve client needs.</li>\n<li>Ability to communicate effectively across various levels, including senior marketing leaders.</li></ul>",
    "responsibilities": "<ul>\n<li>Manage a portfolio of GCS medium size businesses by thoroughly understanding growth drivers, identifying opportunity for growth, managing risks and creating multi-quarter plans for achievement.</li>\n<li>Collaborate within the sales team, aligning workflow among team members to execute on a plan and ensure accountability to meet or exceed goals while prioritizing and delivering outstanding customer experience.</li>\n<li>Implement creative ways to improve our customer relationships, tailor and share performance-enhancing suggestions and promote other Google products.</li>\n<li>Identify key client stakeholders, including C-level and business owners, to support annual digital marketing discussions and budgets.</li><li>Cold calling clients within a book of business to help generate growth, and further return on investment. </li><br /></ul>",
    "title": "Associate Account Strategist, Small Business Sales, Google Customer Solutions"
}