{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Boulder, CO, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbunUup5HOm1p2cBGVIfn505YamHQvoUQIjS-2akuFMSOQASYQ8wOlEnhXRsU0JxiuFU0FHaolMXZ3ZElkHYOhXI_vzWxcAqph5VxceLXsQ2_b5g5sdMh4f7TA%3D%3D_V2&jobTitle=Technology+Program+Manager%2C+Real+Estate+and+Workplace+Services&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T22:01:33.770Z",
    "description": "<p>As a REWS Technology Program Manager, you will identify and partner with engineering resources to develop, build, and maintain REWS’ diverse range of systems and tools -- touching everything from real estate to food services to facilities operations and transportation. You will manage the customer side of complex, multi-disciplinary engineering projects using your product management expertise and outstanding communication skills. You will create requirements with REWS clients and usher projects through the entire project lifecycle. This includes helping clients define their needs, building requirements documentation and user stories, managing project schedules, identifying risks and clearly communicating them to project stakeholders, planning Googler-facing rollouts, and transitioning products to maintenance mode. You will help strategically prioritize incoming and lingering technical needs into a comprehensive project pipeline. \n</p>\n<p>You need to be equally at home explaining analyses and recommendations to customers and executives as you are discussing the technical trade-offs in product development with engineers. You have a passion for excellent customer service and thrive in a fast-paced, change-oriented business environment that requires collaboration with a global team. You must be a strong independent worker with the ability to track many overlapping projects down to small details while still keeping the big picture in focus.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/91916090008838854",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-02-27T19:48:50.111Z",
    "publish_date": "2019-02-27T19:48:50.111Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business or Technology, or equivalent practical experience.</li>\n<li>7 years of experience managing technology projects, from evaluation and planning through design, development, delivery and transition to maintenance.</li>\n<li>Experience influencing diverse technical and non-technical group [at manager level] to drive positive business outcomes.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in technology strategy development, including business case development and crafting implementation roadmaps.</li>\n<li>Experience with facilities management, hospitality services, design and construction, physical security operations, or real estate planning.</li>\n<li>Demonstrable program management skills; able to advance projects with vague/undefined scopes, and influence and align multiple stakeholders with competing priorities and resource constraints.</li>\n<li>Proven project planning abilities including attention to detail, information organization, timeline tracking, and comprehensive communication across many teams and at all organizational levels. \nAbility to drive program and process change through informal authority, serve as a trusted consultant to internal customers, and represent users and customers in every thought and interaction.</li>\n<li>Excellent analytical, communication, and interpersonal skills; takes initiative to build productive relationships and cross-functional connections.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Align internal clients and cross-functional partners to develop technology strategies and products, with a focus on scalable growth, automation, high business impact, and best outcomes for the company.</li>\n<li>Research, develop, and deliver technology solutions as part of a broader roadmap, and bring them to fruition via partnerships with third party technology providers and/or internal engineering groups.</li>\n<li>Provide end-to-end ownership of the product lifecycle: planning product roadmap, gathering requirements, developing user stories, feature prioritization, project management, testing, delivery, deployment, communication, and transition to maintenance mode.</li>\n<li>Manage complex distributed developer teams consisting of onshore / offshore / nearshore resources; including RFP, contracting, and ongoing vendor management.</li>\n<li>Establish strong cross-functional relationships with client group(s), engineering teams, and leadership to build both team effectiveness and long-term product usefulness.</li>\n</ul>",
    "title": "Technology Program Manager, Real Estate and Workplace Services"
}