{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQwc2BBEL5Hn4Ig4apg79R5_g7aFCACgoGv-KtwyBU8SOgASYQ8wuK5S9AmTpsvRIhu0l_9IU9M81cQx5Cpp70ZnsB8GrWLYAofC7-WlmxQiXaUOS5w1-JOZm6A%3D_V2&jobTitle=Enterprise+Customer+Development+Representative%2C+Google+Cloud&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-15T16:01:46.683Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p><p>As a member of the Google Cloud team, you will motivate businesses to become more productive and collaborative by using Google’s Cloud products and to free companies from the overhead of managing infrastructure, provisioning servers and configuring networks by using Google’s array of Cloud platform products.</p><p>As an Enterprise Customer Development Representative, you will work in a team with other Sales representatives supporting Google Cloud’s strategic customers and prospects. You will gain exposure to different parts of the Cloud Sales process through a variety of support responsibilities, including cultivating leads, coordinating partner efforts and developing account strategy. Additionally, you will help develop engagement plans for engaging new accounts, including analyzing data, identifying client opportunities and identifying and engaging key decision-makers.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/84021229167485638",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-15T16:01:46.683Z",
    "publish_date": "2019-03-15T16:01:46.683Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>Authorization to work in the United States.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in sales, customer support, account management, marketing, consulting or project management.</li><li>Interest in technology and cloud computing, including Google Cloud products (e.g., G Suite, Google Cloud Platform).</li><li>Ability to effectively operate and adapt in a fast-paced, continuously evolving team environment.</li><li>Ability to influence stakeholders internally and externally to deliver impact.</li><li>Ability to take initiative and work towards a goal with excellent analytical skills and an entrepreneurial mindset.</li><li>Excellent written/verbal communication and presentation skills.</li></ul>",
    "responsibilities": "<ul><li>Assist multiple field sales representatives with support activities, including developing leads, identifying key client decision-makers, coordinating partner efforts and growing existing client business.</li><li>Contribute to account/territory strategy by performing internal and external research to identify opportunities and challenges.</li><li>Prepare customer proposals and account plans.</li><li>Analyze customer and industry data to provide key business insights; prepare business reviews and help identify ways in which Google Cloud can transform businesses through defined insights.</li></ul>",
    "title": "Enterprise Customer Development Representative, Google Cloud"
}