{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckefsRA84yOoBWkl0PKw2vprSAJHPHTbJBs3WsTicPB4SOgASYQ8wEZVoTwedYZau87r7Bd1avgSv2E254ls5aDJONVQOBclsRP3-9DHjz1324u2yNrXB-7ibr_g%3D_V2&jobTitle=Partner%2C+Area+120&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-21T22:01:38.590Z",
    "description": "<p>Area 120 is a startup incubator inside Google. We invest in small, diverse teams of entrepreneurial Googlers that spend 100% of their time building new Google products and services from scratch. Over time these projects may grow to have significant global impact for Google and our users.\n</p>\n\n\n<p>We source ideas and teams through both a regular bottom-up application process inside Google and through partner-led approaches both internal and external to Google. Successful teams continue in the program until they have generated sufficient value to graduate back to Google. \n</p>\n\n\n<p>As an Area 120 Partner, you will be responsible for providing ongoing leadership in Area 120. This includes identifying investment leads and advising teams on how to succeed within Google. You will also work with the Partnership to run an incubator, including defining and embodying the culture of Area 120, working with cross-functional partners to access the best of Google, and pushing to make it easier to operate like a startup within Google.</p><p>Area 120 is a workshop for Google’s experimental products. One in which entrepreneurial Googlers can explore, build, and grow new businesses that have meaningful impact on the world.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/138196104500912838",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-13T20:02:07.440Z",
    "publish_date": "2019-03-13T20:02:07.440Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in a technical, scientific or business field or equivalent practical experience.</li>\n<li>10 years of work experience in a relevant field, of which 5 years on a startup founding team, as a startup investor and/or with venture capital communities.</li>\n<li>Experience mentoring or advising teams.</li>\n<li>Experience in the diversity, equity and inclusion space.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience building culture in a high growth environment.</li>\n<li>Experience identifying, evaluating, and valuing acquisition and strategic investment opportunities.</li>\n<li>Project or program management, including setting up and executing projects and operational processes.</li>\n<li>Deep understanding of the tech world and insights into upcoming opportunities.</li>\n<li>Quantitative and qualitative analytical skills, including evaluating business performance.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand the primary drivers of a variety of businesses, identify upside, and diagnose potential pitfalls.</li>\n<li>Assess, influence, and garner trust from top talent and co-founders.</li>\n<li>Listen to and interact effectively with team members and people across Google from various functions and cultural backgrounds.</li>\n<li>Be flexible, resourceful, high integrity in your work ethic, and enjoy working in a small team under constraints.</li>\n<li>Be entrepreneurial, hands-on and have a problem solving attitude suited for working in startup environments.</li>\n</ul>",
    "title": "Partner, Area 120"
}