{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckS4eTcZA4RMHPG7KGAgYII-foDwn--ENopoGdxsbc50SOgASYQ8wW7MEWDeorTppJVooFjpVSogUTRPUvTiSqmis9NyNYUIkj33E0lgeb8voqbtSRXg-ju7J3-g%3D_V2&jobTitle=Account+Executive%2C+Small+and+Medium+Businesses%2C+Cloud+%28Spanish%29&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T21:31:45.115Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As an Small and Medium Businesses (SMB) Account Executive, you&#39;ll help to drive growth over the phone and through our partners. You are passionate about sales and possess analytical and creative skills which allow you to assist customers effectively and to drive new business growth opportunities. By leveraging the innovative power of our products, you will identify opportunities while delivering the highest quality customer experience. Additionally, you&#39;ll bring Google&#39;s portfolio into small and medium-sized companies around the world, handling complex customers and stakeholder relationships with ease.\n</p>\n\n\n<p>As a member of the Google Cloud team, you&#39;ll inspire leading companies, schools, and government agencies to work smarter and more efficiently by using Google tools like G Suite, Search, and Chrome. You leverage the innovative power of our products to make organizations more productive, collaborative, and mobile. Using your passion for Google products, you will help spread the magic of Google to organizations around the world.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82614340420543174",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:31.552Z",
    "publish_date": "2019-02-27T19:50:31.552Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in sales/relationship management within the technology industry.</li>\n<li>Experience working with cloud, SaaS, IaaS, and PaaS products.</li>\n<li>Ability to speak and write in English and Spanish fluently and idiomatically.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with CRM systems (e.g., Salesforce.com).</li>\n<li>Ability to effectively operate and adapt in a fast-paced, constantly evolving team environment.</li>\n<li>Ability to build influential relationships and to deliver results in a cross-functional/matrixed environment.</li>\n<li>Ability to take initiative and work confidently.</li>\n<li>Abilityt to zoom in/out from to get the whole picture.</li>\n<li>Excellent analytical, organizational, and project management skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Grow business and G Suite adoption with customers.</li>\n<li>Drive business development, manage multiple opportunities simultaneously, and forecast accurately.</li>\n</ul>",
    "title": "Account Executive, Small and Medium Businesses, Cloud (Spanish)"
}