{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZV086eWB9PjIfgQ87_ZNiNGFAqHHznoDBwWVNiIBMwSOgCPMA3TsMuMH2jddDLikaICseQ2cC0bd6P8JZpSWySqNf8Jh3J1yvQVlPBRyDxuEi3gkJHtoB7Qap0%3D_V2&jobTitle=Global+Product+Lead%2C+Google+Customer+Solutions+Tools+and+Infrastructure&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-18T17:31:43.814Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p><p>The Global Product Lead (GPL) team’s mission is to empower Google Customer Solutions (GCS) to grow small and medium businesses (SMB) globally by delivering solutions through technology and operational excellence. We do this by partnering closely and building trust with GCS business and technology teams and delivering excellent products/solutions for our users. We are focused on aligning the highest-level company priorities with strong day-to-day operations and helping evolve early stage ideas into future feature initiatives.</p><p>You will partner closely with our Regional Strategy and Operations Leads to deeply understand user pain points, form business requirements and prioritize solutions to influence the direction of product development. This is truly a cross-functional role where you’ll be given significant responsibility and the ability to drive growth across all facets of the GCS team through technology. You will also play a key role in training development and larger deployments globally.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5887440583852032",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:53:19.333Z",
    "publish_date": "2019-02-27T19:53:19.333Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in a quantitative field (e.g., Engineering, Computer Science, Mathematics, Physics, Statistics, Economics, Finance) or equivalent practical experience.</li><li>5 years of experience in product management, management consulting, or equivalent project management experience in technology.</li><li>Experience influencing Product Management/Engineering teams, senior leadership, and cross-functional stakeholders.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience manipulating large data sets using SQL and a passion for analyzing large, complex datasets and converting them into insights to drive decisions.</li><li>Experience effectively influencing PM/Engineering teams, senior leadership, and cross-functional stakeholders.</li><li>Ability to speak to technical/business stakeholders and users and interact at all levels of the organization.</li><li>Demonstrated flexibility and ability to work in a fast-changing environment.</li><li>Distinctive problem solving and analytical skills with the ability to define problems and identify potential solutions.</li><li>Proven project management, relationship management and change management skills. Excellent presence and written/verbal communication skills.</li></ul>",
    "responsibilities": "<ul><li>Garner impactful product insights through your deep knowledge of the user, workflows, sales and marketing processes, and the strategic initiatives of the business.</li><li>Identify gaps in current tools and infrastructure, prioritize and craft business cases to validate the importance of new feature requests.</li><li>Articulate business requirements to our Product Management and Engineering teams; influence the quarterly/annual roadmap to address them.</li><li>Articulate a vision for the area; where we need to improve now and where we want to go to drive an overall roadmap.</li><li>Partner with senior leadership and cross-functional global stakeholders to understand and prioritize business needs, build consensus and communicate needs through business requirement documents and less formal means. Collaborate with product teams on design sprints, product requirement documents, business requirement documents, and product pilots.</li></ul>",
    "title": "Global Product Lead, Google Customer Solutions Tools and Infrastructure"
}