{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdMawo8vE2TH6_PJAKGdU3snexMnExH4ewq3rEet1T4SOgCPMA3Tae8iIHT4TASDKO0atqRhMBYLeNd6hbvVnD4oaluhjnhMVdZhI6x7Lv1p95MlO0h9hpAbivI%3D_V2&jobTitle=Network+Transport+Engineer%2C+Optical&loc=US",
    "categories": [
        "NETWORK_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:31:59.701Z",
    "description": "<p>Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google&#39;s complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.</p>\n\n<p>In this role you are responsible for defining and qualifying platforms and solutions for scaling Google’s optical transport network. Optical transport networking covers a wide range of optical technologies and reaches - from client transceivers to metro and long haul Dense Wavelength Division Multiplexing (DWDM) coherent systems. This includes driving the technological evolution with Software Defined Networking (SDN) and network automation. Your work will involve specifying the hardware, embedded software and control / management software requirements for optical platforms, as well as evaluating and qualifying new technologies and developing tools and processes for introducing these in the network. \n</p>\n\n<p>The work requires a thorough understanding of optical physical layer technologies and transport-layer networking systems and an ability to apply your knowledge to creative, scalable, and cost-effective solutions. You will be designing and specifying test methodologies and automated test plans for optical transport systems and contributing to the development and implementation of them. You will work closely with Network Architecture, Network Design, Optical Operations, Physical Operations, Network-SRE, G-scale, and Platforms internal teams. You will also engage with external optical equipment vendors. You will be expected to think critically and strategically to solve Google’s networking challenges and absorb and process high amounts of technical information in a continuously evolving environment.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4710064822878208",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:51:55.758Z",
    "publish_date": "2019-02-27T19:45:54.076Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Electrical Engineering, Chemical Engineering, Computer Science or equivalent practical experience.</li>\n<li>Proficient in Python, Go, C++ or equivalent software language.</li>\n<li>Experience in developing software automation tools. Development or operational experience with modern optical transport systems (metro and long-haul DWDM systems).</li>\n<li>Experience in using and automating optical test equipment and infrastructure.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Electrical Engineering, Chemical Engineering or Computer Science.</li>\n<li>5 years of experience in developing and operating large scale network infrastructures in operational or engineering roles.</li>\n<li>Experience in optical link design (link budgets, OSNR calculation).</li>\n<li>Experience with optical physical-layer analysis and testing.</li>\n<li>Clear focus under pressure. Creative approach to problem solving and ability to think out of the box.</li>\n<li>Exceptional analytical, negotiation and organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design and develop test plans and automation for optical physical-layer, transceiver, transponder, sub-systems and line-systems.</li>\n<li>Automate test infrastructure to qualify and introduce new products into our production network.</li>\n<li>Define requirements and identify technologies for scaling our transport network in a cost-efficient and operationally streamlined manner.</li>\n<li>Develop tools and processes for automation of acceptance, operational, troubleshooting and network health reporting.</li>\n<li>Work with Network Design, Deployment and Operations teams to operationalize stable, scalable platforms.</li>\n</ul>",
    "title": "Network Transport Engineer, Optical"
}