{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcCOcWQpor-8qNL7K4mraczPxA87YuUDFxApr2IHFWoSOgCPMA3Tgyv6rdpe25XIehvZBDEIu-LMj0cdgo9ya9ooSx1flSCrrLyyEYVuZzKp8Boxry9iw27lCPk%3D_V2&jobTitle=Technology+Manager%2C+Online+Partnerships+Group&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "PRODUCT_MANAGEMENT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:45.379Z",
    "description": "<p>Successful sales in today&#39;s online advertising space require minds that can not only keep pace with rapid technological change, but stay one step ahead. As a Technology Manager, you will lead cross-functional teams of Engineering, Sales, and Product management members to leverage emerging technologies for our customers. From design and conceptualization through to testing and deployment, you will oversee the technical execution and business operations of Google&#39;s online advertising and platform partnerships. You will work on developing product and technical strategies as well as prioritize projects and resources to assist our account management team and partners. You&#39;re able to balance business and partner needs with technical constraints and love bringing new products to market and to our partners.</p>\n\n<p>As a Technology Manager, you will drive the development of applications for our Sales, Support, Operations and Channel Partner teams, whether sourced externally or built from conception to launch in close partnership with our Engineering team. You will be comfortable working both in a rapid prototyping mode, or building for growth - always with a mind toward integrating data, processes and identity across applications.</p><p>Google’s Online Partnerships Group works with a wide range of partners to bring the best of Google to power their business. The team partners with Publishers and App Developers of all sizes to promote their ad inventory, working with Google&#39;s broad range of partner solutions including AdSense, DoubleClick Platform Solutions and the Ad Exchange, across mobile, display, and video formats, helping our partners and their audiences get the most out of the web. In addition, the Partnerships team supports Google’s own product teams with essential partnerships to help power Google’s user experiences in search, maps, travel, shopping, payments and more.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6467590522339328",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:45:06.716Z",
    "publish_date": "2019-02-27T19:45:06.716Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or related technical field, or equivalent practical experience.</li>\n<li>2 years of experience in a product management, software engineering or similar technical role.</li>\n<li>Experience with mobile cloud applications (e.g. JavaScript, HTML, JSON, AJAX etc.), full lifecycle from conception and requirements gathering, to development to deployment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in product design.</li>\n<li>Knowledge of internal business client applications (customer relationship management (CRM), sales, demand management, support organization ticketing business intelligence and analysis).</li>\n<li>Ability to evolve business and product strategy based on research, data and industry.</li>\n<li>Significant people and organizational management skills. Developed problem solving and analytical skills.</li>\n<li>Developed cross-functional project management and communication skills. </li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify the applications and features that will give our internal teams and ecosystem partners an advantage and make them productive in their daily work.</li>\n<li>Craft a product strategy and roadmap. Make the business case for applications or features that support our go-to-market processes and further our technology goal of achieving a integrated, flexible, 100% Cloud infrastructure.</li>\n<li>Execute against our product roadmap, define comprehensive product requirements, and initiate and prioritize projects within the Rapid Prototyping Team and Publisher Intelligence teams. Make sound technical vs. requirements scope tradeoffs, help determine the best technical implementation methods and manage the project execution.</li>\n<li>Establish the key operational metrics and goals for our applications. Coordinate with relevant teams across Online Partnerships Group to ensure that operational requirements are defined and met in addition to the product requirements.</li>\n<li>Build and manage relationships with Engineering, Sales, Support and Operations teams. Create cross-functional product and project teams optimized for successful product and business execution.</li>\n</ul>",
    "title": "Technology Manager, Online Partnerships Group"
}