{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVWhHbkv1vZVPL7B3LVbtX3C--AfUEQgu16FhiygMjQSOgASYQ8ww7b4-01vE3d1X3oM0lExY3vAc6iql2wH6copRw2Ea50U5WH0JpPN1UBioejS9-9gNAgd0FI%3D_V2&jobTitle=Strategy+and+Operations+Manager%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-18T15:31:34.779Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>As a Strategy and Operations Manager, you&#39;ll help the Trust and Safety business grow and operate effectively. You will establish and lead operating processes for effectively managing the YouTube Trust and Safety function in the U.S.</p><p>You will work closely with Trust and Safety’s leadership across functions and teams to provide a consistent strategic narrative across initiatives. You&#39;ll provide a sounding board to the leadership team and ensure communication is effective and cascaded to the broader organization including cross-functional groups.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/109612296134632134",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T02:02:12.478Z",
    "publish_date": "2019-03-07T02:02:12.478Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a related field or equivalent practical experience.</li>\n<li>Experience working in management consulting or corporate strategy in a fast-paced environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Effective analytical problem-solving skills with experience structuring and executing complex strategic initiatives.</li>\n<li>Excellent interpersonal and communication and presentation skills, with the ability to influence multiple level audiences.</li>\n<li>Ability to work effectively in high-pressure situations and smoothly take the lead if necessary.</li>\n<li>Ability to work successfully in global cross-functional teams, stakeholders and executives.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify key challenges across Global Scaled Operations, leveraging your influential skills to scope, prioritize and resource global initiatives.</li>\n<li>Lead large, cross-product, YouTube-wide initiatives focused on scaling operations and driving performance; drafting communications and managing org-wide initiatives aimed at improving commuinication, execution and follow through.</li>\n<li>Initiate and implement programs to promote inclusiveness, diversity, leadership development, well-being and collaboration.</li>\n<li>Oversee onboarding to efficiently and thoroughly ramp new hires.</li>\n<li>Support annual and quarterly planning process to ensure cohesion of strategy, process, and implementation.</li>\n</ul>",
    "title": "Strategy and Operations Manager, Trust and Safety, YouTube"
}