{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXx8lR06Yn0c6kuSo4DggPURGAGM_VZ9dufjpa0Xhl4SOQASYQ8w2yz0t216dY4oozzXCMExwpcQYs76OuQiiKNOpUOCVMTgCIeHArtASA1FOOceVuRUALysLQ%3D%3D_V2&jobTitle=Manager%2C+Sales+Strategy+and+Operations%2C+Google+Ads&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T17:01:53.553Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p><p>Our team is responsible for strategy and operations across GCS channels, and leading the design and planning for sales programs that generate business growth for Google. We work in partnership with cross-functional teams across Sales, Marketing, Finance, and Engineering.</p><p>You&#39;ll be responsible for overall productivity and effectiveness of the sales organization, partnering closely with sales leadership and the broader sales team to drive strategic initiatives and optimize our processes. You&#39;ll build our operations excellence, and you&#39;ll ensure we provide the right care to our customers. This role combines operations and strategy, and you&#39;ll run operations for the programs while also stepping back to critically think through strategic issues.</p><p>You&#39;re an experienced performer who can add value to a variety of business challenges. You will combine excellent business acumen with operational thoroughness, and you&#39;ll gain invaluable experience in this high-impact role working in a changing global environment.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/107007301698626246",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-07T17:01:53.553Z",
    "publish_date": "2019-03-07T17:01:53.553Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>6 years of experience in a management consulting, sales operations, investment banking/private equity/venture capital, or marketing analytics role.</li></ul><br><p>Preferred qualifications:</p><ul><li>2 years of relevant experience.</li><li>Experience with SQL.</li><li>Experience researching and analyzing key business drivers, trends and operating metrics.</li><li>Experience identifying opportunities for product, program, and process improvement.</li><li>Analytical mindset, with the ability to analyze structured data and synthesize data into useful formats to bring actionable insights.</li></ul>",
    "responsibilities": "<ul><li>Evaluate the efficiency of each onboarding program and advise the Leadership team on where to focus to maximize return.</li><li>Drive analyses to direct the sales organization, including quota achievement, coverage, retention, segmentation and productivity. Support annual/quarterly business planning processes.</li><li>Design the sales team&#39;s metrics, reporting and dashboards to improve business operations. Maintain a high-level of data integrity.</li><li>Identify tools, processes and automation to improve the sales processes, and build and implement them in partnership with Sales, Global Product Leads and Engineers.</li><li>Oversee implementation of enabling systems and tools, working closely with internal systems teams. Troubleshoot assignment workflow bottlenecks and resolve day-to-day issues to support the frontline.</li></ul>",
    "title": "Manager, Sales Strategy and Operations, Google Ads"
}