{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Austin, TX, USA; New York, NY, USA; Seattle, WA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVoquy_4ilX2jfbVs9pkka_AzEqe1xfZCroOdeDGXwcSOgASYQ8wxeOixVfXG5aXpfggYJ0kF3x6Rl6TWe-meDM7JuvlvMKIYIWp6uT1cs5lbz7oZKTlkcrzXHQ%3D_V2&jobTitle=Partner+Operations+Manager%2C+Tech+Support%2C+Google+Cloud&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T18:31:46.180Z",
    "description": "<p>The Cloud Support team helps customers solve technical problems with excellent customer care. As a Partner Operations Manager, you’ll be part of a team of partner managers that work directly with strategic alliances, technology partners, resellers, managed service providers and their customers to apply Google Cloud technology to deliver excellent customer care. In your region of operations, you will work closely with customer- and partner-facing teams to build an excellent partner support experience across all partner types and their Google Cloud customers.</p>\n\n\n<p>Your ability to identify and create technical and process integration points with partners and customers is crucial in helping to grow our Google Cloud business and bringing our product portfolio into companies both big and small around the world. This will require you to work closely with Cloud Support teams and our partner teams to onboard and develop partners to deliver fully-managed support services to Google Cloud customers. You will handle sensitive partner escalations by combining business acumen with technical assessment skills. You will also be the &quot;voice of the Partner&quot; within the Cloud Support organization to help identify key trends in partner and customer needs.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103923011326747334",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-12T18:31:46.180Z",
    "publish_date": "2019-03-12T18:31:46.180Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical field or equivalent practical experience.</li>\n<li>5 years of experience in a partner or channel manager role with building scalable partner ecosystems.</li>\n<li>Experience managing internal stakeholders and external partners.</li>\n<li>Ability to travel 25% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree in Computer Science or a related field, or MBA degree.</li>\n<li>Experience in helping to integrate processes between Google and external parties and designing systems, tools and workflows that help Google work with external parties.</li>\n<li>Experience in a customer support environment.</li>\n<li>Experience as a solutions engineer or developer with Google Cloud Platform, or similar public cloud environments.</li>\n<li>Proven ability to execute in a customer-focused environment and advocate for partners/customers in a cross-functional organization.</li>\n<li>Ability to interact with diverse technical and non-technical groups, work in ambiguous, rapidly-changing environments.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop technical integration designs and plans, and lead on-boarding efforts for new partners (strategic alliances, resellers, technology partners, managed service providers) who provide or resell Cloud Support to end-customers.</li>\n<li>Develop relationships and collaborate across all Google Cloud customer-facing teams in the region to deliver a unified approach with partners and contribute to the growth and direction of Google Cloud’s Partner business.</li>\n<li>Lead ongoing management and monitoring of support quality provided by the partner to their customers.</li>\n<li>Complete regular reviews to evaluate and assess existing partners&#39; competencies along with key trends in customer needs to surface improvement or new tech adoption opportunities for partners.</li>\n<li>Interact directly with executive stakeholders to resolve high-profile escalations and issues, improve the customer experience and drive initiatives to increase their likelihood of success on Google Cloud Platform.</li>\n</ul>",
    "title": "Partner Operations Manager, Tech Support, Google Cloud"
}