{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckShVvNfm9S3AZv3EdFFtmv76knMFzvcvESQSaPG1CocSOgASYQ8w9V92bMTyXQHtrb9EImiKbD63E1GZvIpIpEMrAQ2_HKk7TGTAJDMpc-Z_A1xtYtZieq5sF3Q%3D_V2&jobTitle=Japanese+Localization+Analyst%2C+Partner+Programs%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T22:01:49.876Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p><p>The Google Cloud global Partner Programs team is focused on accelerating the adoption of Google Cloud by attracting and growing partners and making them successful. As a Japanese Localization Analyst, you&#39;ll focus on supporting a Partner Relationship Management (PRM) user interface for our Japanese partners, forecasting and prioritizing Japanese language data and content translation and localization work with teams across the business. The role involves multiple tasks where delivering high-quality work within a collaborative environment is required.</p><p>Our team is dedicated to delivering programs that create value for our partners’ businesses. Our goal is to reward and recognize our partners’ successes as they use our offerings to deliver an excellent experience for our customers. Ultimately accountable to Google Sales Leadership, you&#39;ll work closely with internal stakeholders and subject matter experts to manage Japanese localization activities, ensuring effective PRM system translation and content that will support our partners&#39; experiences and the delivery of a partner program. You&#39;ll work cross functionally to meet business goals.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/115285971420750534",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-07T22:01:49.876Z",
    "publish_date": "2019-03-07T22:01:49.876Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree with a focus on linguistics, translation, and/or language localization or equivalent practical experience.</li><li>7 years of experience with content management translation activities (e.g., systems and workflows).</li><li>Ability to speak and write in English and Japanese fluently and idiomatically.</li></ul><br><p>Preferred qualifications:</p><ul><li>5 years of partner programs experience at an enterprise software or cloud company, and experience with partner programs.</li><li>Editorial and publishing experience.</li><li>Ability to drive system UI localization from English to Japanese.</li><li>Passionate about the partners with the ability to achieve quick results, with the capacity to assume increasing responsibility in a fast-paced global organization.</li></ul>",
    "responsibilities": "<ul><li>Support and adhere to business rules, quality/style guidelines, and processes to ensure the effective and consistent delivery of Japanese localization services for the Google Cloud Partner organization.</li><li>Collaborate with others to define a standardized localization strategy that delivers a consistent partner experience and optimizes spend for localization needs.</li><li>Ensure that Japanese Partner Relationship Management UI and partner content is actively managed, remains complete and accurate, and delivers a consistent experience.</li><li>Collaborate across the organization and effectively manage internal stakeholders and subject-matter experts to help produce high-quality and engaging partner content in Japanese.</li></ul>",
    "title": "Japanese Localization Analyst, Partner Programs, Google Cloud"
}