{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeewAY5N2iGTNADIf4WLc29sz7OWFAHKhJZ3eLuN8T4SOgASYQ8w_qm7cyupxWt1a-YENBAoaukebSAM-58PTXAMoSzmIMWv69xMf2rhky906euPU9T_bB6rFY0%3D_V2&jobTitle=Manager%2C+Research%2C+Survey+and+Insights&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T20:01:46.264Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>As the Research, Survey and Insights Manager, you will lead the development and execution of innovative research and survey methodology to help the GCS organization deliver better customer success. You&#39;ll be responsible for GCS-wide primary research and will take the lead on executing and analyzing existing surveys in addition to finding new ways to improve our understanding of customer satisfaction.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/81624889074557638",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:53:36.085Z",
    "publish_date": "2019-02-27T19:53:36.085Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Master&#39;s degree in Statistics, Mathematics, a quantitative field or equivalent practical experience.</li>\n<li>5 years of experience in survey methodology and design, customer research and/or customer insights.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Expertise in a variety of statistical techniques required to analyze customer data.</li>\n<li>Ability to distill insights to presentations for non-technical audiences.</li>\n<li>Ability to integrate multiple viewpoints and synthesize key messages into high-impact communications.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with partner teams to ensure that all elements of the research meet GCS’ objectives.</li>\n<li>Work with partner teams to improve contact data and response rates.</li>\n<li>Develop findings into compelling narratives, insights, and action plans. Become the advocate for the voice of the customer and help the organization collect feedback at scale.</li>\n<li>Work with internal business partners to drive the implementation of solutions and measure their impact.</li>\n<li>Manage the operational survey process, monitor methodology and questionnaire changes, investigate flows and completion patterns, enhance program designs through testing and analysis, and engage with partners to streamline and enhance processes.</li>\n</ul>",
    "title": "Manager, Research, Survey and Insights"
}