{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYzISt4jDP5I-JsvLQRPj3A69-ajozgYdHP65gJEdZcSOgASYQ8wRukIvpl5maToaizmNs5VvN2VP32May_9g4z_CGw_kJPOEP-CmQZOHHIwiz0Jzw6iHdXnsq0%3D_V2&jobTitle=Facilities+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-23T23:01:40.320Z",
    "description": "<p>At Google, we aim to foster Googley work environments that are collaborative, friendly and fun. The Facilities Management team brings our spaces to life as you oversee the daily operations of our offices. While roles with similar names at other companies can be far more mundane, you&#39;re a creative, organized customer service specialist, who takes pride in seeing things run smoothly and efficiently. You go out of your way to make sure clients are not only satisfied, but singing Google&#39;s praises. You&#39;re comfortable in a fast-paced environment with the highest standards of excellence. You aren&#39;t afraid to have fun with your job, and bring an enthusiasm, dedication and a collaborative spirit to build and maintain office spaces that facilitate some of the world&#39;s most cutting edge innovation.</p>\n\n<p>You&#39;re a great communicator who is comfortable taking on complex projects with a diverse set of stakeholders. You have an analytical mindset, constantly work to improve the efficiency and effectiveness of your projects and deliver innovative solutions to workplace operations.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5578471157825536",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T21:27:06.768Z",
    "publish_date": "2019-02-27T19:50:38.930Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience in facilities, hospitality, corporate services, event management, workplace design, property management or equivalent office management experience.</li>\n<li>Ability to travel once per quarter as required for regional meetings, trainings and summits.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience and working knowledge of facilities, both ‘soft services’ and ‘hard services’, employee services (e.g., amenities, fitness, food), design and construction. Experience with mechanical systems (e.g., HVAC, lighting, BMS systems).</li>\n<li>Ability to navigate architectural plans and technical drawings.</li>\n<li>Ability to think outside the box and develop creative, non-standard and innovative solutions.</li>\n<li>Ability to handle multiple requests, navigate ambiguity and work in a fast-paced rapidly changing environment. Ability to be responsive to customer requests/service issues.</li>\n<li>Ability to manipulate data and see beyond the numbers, be strategic and draw business conclusions. Developed analytical and problem-solving skills.</li>\n<li>Excellent time management skills. Ability to meet tight deadlines and make sound decisions.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Assist in facility service operations in New York (e.g., new office builds, fast-paced expansions, capacity and space planning, implementation of new processes and procedures). Provide exceptional customer service experience and act as the face of Workplace Services to our end users, partnering with Googlers to deeply understand their needs and deliver the right solutions.</li>\n<li>Collaborate with the Facilities Management team, Real Estate and Workplace Services partners, IT, People Operations, Program Managers, and Finance to ensure an efficient, productive integration for regional initiatives, fiscal responsibilities, data analysis, new program implementation and mergers and acquisitions activities.</li>\n<li>Influence the customer, clients and other internal organizations. Drive consensus and compromise when needed. Come to the right conclusion via collaboration. Communicate program information and updates to Googlers using various Google tools.</li>\n<li>Support financial functions, procurement, vendor management, employee services, transportation programs and general office services. Find innovative ways to streamline and enhance service delivery, while keeping an eye on the bottom line.</li>\n<li>Partner with outsourced facilities services vendors and ensure that best practices are created by using and testing Google products. Maintain a general oversight of daily operations of office(s) for reception, space, moves, safety, maintenance, mail and work order ticketing system. Influence peers on initiatives and work side-by-side to accomplish yearly objectives.</li>\n</ul>",
    "title": "Facilities Manager"
}