{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaOjPqVx99Tk2yjd_nfgJj3EclKi1MMwFwGUiHZ_pTMSOgCPMA3TQEkeUMzqEhL8irLeaKzgr8mGbrAroHl_nlQpDDxONFqYldRWNNfQ8dSQ4eUPEhkNb3ckXpQ%3D_V2&jobTitle=Global+Process+Manager%2C+Global+Adjustments%2C+Customer+and+Partner+Operations&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T20:32:11.783Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>The Customer and Partner Operations (CPO) team manages Google&#39;s Order-to-Cash (O2C) processes globally across all product areas, including Ads, Digital Goods, Cloud, and Hardware. We ensure Google’s growth is handled in an efficient, controlled, and compliant manner. Our team powers Google&#39;s growth by creating innovative ways to manage our set of billing and payment transactions, making processes more efficient and scalable, minimizing operational risk, integrating Google acquisitions and new products, connecting with new payment and invoicing partners, and so more.\n</p>\n\n<p>As a Global Process Manager, you will join the CPO and help manage the billing adjustments for all Google products (e.g., Google Ads, Google Cloud, Display, Hardware) across all regions and all methods of billing. As a member of this team you will be supporting and consulting the business to find effective solutions. You will be managing a vendor team and be accountable for your own processes. In this role, you will help make processes more efficient and scalable, ensuring the highest level of quality in our operations and proactively minimizing operational risk. Additionally, you will collaborate with internal and external stakeholders (e.g., Sales, Product Management, Engineering, customers, and vendors) to deliver best-in-class solutions for our customers and drive key initiatives for the Global Adjustments team.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5623740882944000",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:29:14.455Z",
    "publish_date": "2019-02-27T19:53:30.175Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Operations, or equivalent practical experience.</li>\n<li>4 years of experience in Finance, Management Consulting, Corporate Strategy, or similar environment (e.g., Finance Operations, Project Management).</li>\n<li>Experience in audit, payments, compliance, or banking.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in financial operations, accounting, or process design.</li>\n<li>Ability to communicate clearly and influence leadership teams in both product areas and finance.</li>\n<li>Excellent leadership, project management, and process design skills.</li>\n<li>Excellent judgment and problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with key stakeholders, Engineering, and vendors to improve financial processes and perform effective escalation management.</li>\n<li>Provide customer feedback analyses, operational monitoring, troubleshooting, and error resolution to prevent inaccuracies, reduce process latency, and drive process excellence.</li>\n<li>Provide performance reporting and analysis to management.</li>\n<li>Manage outsourced operational activity, including Service Level Agreements, adherence to documented processes and quality of results, performed by third party vendors.</li>\n<li>Drive system solutions and design tools for our day-to-day operations in conjunction with our Payments Engineering partners. \nEnsure tax, local entity compliance, and readiness on supporting new and existing functionality.</li>\n</ul>",
    "title": "Global Process Manager, Global Adjustments, Customer and Partner Operations"
}