{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke0jugk8OsAFUIyD4HQTosG2l7FjBT0jioJ4AQv3Zm4SOgCPMA3TnLj82oWUF_fmfx510ZIfMTxm69kSgMiEBSXexwxMimVVYt3BdMbGFiR4Nt5EyVAgJ4KuEcM%3D_V2&jobTitle=Director%2C+Trust+and+Safety%2C+Ad+Traffic+Quality+Operations&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T17:31:52.694Z",
    "description": "<p>Google&#39;s brand is only as strong as our users&#39; trust--and their steadfast belief that our guiding principles are what&#39;s best for them. Our Trust and Safety team has the critical responsibility of protecting Google&#39;s users by ensuring online safety by fighting web abuse and fraud across Google products like Search, Maps, Google Ads and AdSense. On this team, you&#39;re a big-picture thinker and strategic leader. You understand the user&#39;s point of view and are passionate about using your combined technical, sales and customer service acumen to protect our users. You work globally and cross-functionally with Google developers and Product Managers to navigate challenging online safety situations and handle abuse and fraud cases at Google speed (read: fast!). Help us demonstrate that quality on the Internet trumps all.\n</p>\n\n\n<p>Digital Advertising is the foundation of Ad Powered Free Web that has become a integral part of our lives. An unwavering trust in the ecosystem by Advertisers, Publishers and users is fundamental for the growth of the industry. Google Ads are displayed across multiple surfaces like web, App, Video and both on Google owned and Publisher owned inventory. Ensuring the integrity of valid traffic is integral to building the Advertiser Trust in the network is a tall order and Google is highly committed to it. \n</p>\n\n\n<p>As the Director of Ad Traffic Quality in Trust and Safety, you’ll lead a global team responsible for protecting Google Ads ecosystem from invalid traffic and building trust among our Advertisers. This role requires deep domain understanding of Ad Fraud, Invalid Traffic, Malwares, BotNets and malicious business models like Pay to Click. The role involves defining a vision for the future, a strategic plan to achieve the vision and guiding the team to deliver stellar execution in our anti-fraud/anti-abuse initiatives.\n</p>\n\n\n<p>You will ensure trust and reputation not only for this product, but also for Google as a broader brand and company. You are a strategic leader who possesses the ability to work globally and cross-functionally with several internal stakeholders through effective relationship building, influence and communication. You demonstrate analytical thinking through data-driven decisions. You have the technical know-how, charisma and ability to work with your team to make a big impact.</p><p>At Google we work hard to earn our users’ trust every day, knowing this is critically important to our success. Trust &amp; Safety is Google’s team of best-in-class abuse fighting and user trust experts working daily to make the internet a safer place. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work together to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4684471221813248",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:25:48.668Z",
    "publish_date": "2019-02-27T19:47:25.138Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Bachelor’s degree or equivalent practical experience.</li> <li>15 years of experience working in the technology industry.</li> <li>7 years of experience in defending digital advertising systems against Ad Fraud, Invalid Traffic, Malwares, BotNets, and malicious business models like Pay to Click.</li> </ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in a related field (Analytical, Technical, Legal, Operations Management).</li>\n<li>Experience in C-level global management roles, handling multiple senior stakeholders and a proven ability to influence at all levels of the organization.</li>\n<li>Experience leading global operations teams and initiatives at scale in a large matrixed organization. Proven track record of working with diverse cross-functional partner teams.</li>\n<li>Passion for preventing fraud and abuse, expertise in operational scaling and ability to meet challenging operational goals.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand Google&#39;s product policy, enforcement and risk strategy in order to identify key policy and enforcement operational successes, risks and inconsistencies and opportunities for improvement.</li>\n<li>Define and implement team and sub-team level strategy.</li>\n<li>Partner with cross-functional teams in Engineering, Product Management, Legal and other teams to increase operational excellence and mitigate risks based on impact.</li>\n<li>Lead a global operations team focused on analytical problem solving, efficiently running operations and improving the business while reducing abuse, spam or fraud.</li>\n</ul>",
    "title": "Director, Trust and Safety, Ad Traffic Quality Operations"
}