{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXCdGhtY2VGzxatNVkfrb-XPAdrhcW5mmeaZjwLytAwSOgCPMA3T4TgXHFn8ePHBHsdBX7TVYQFccfPT-uwnX56w2QWhEKx8xny-1zkzVVblKTV-jgCHUp1gFuM%3D_V2&jobTitle=Product+Design+Engineer%2C+AR%2FVR&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-17T21:01:41.045Z",
    "description": "<p>As a member of a fast-paced multi-disciplinary team, you use your creativity and diverse range of engineering experience to explore solutions to a variety of engineering problems. As a mechanical engineer, you participate in the design, analysis, and prototyping of new concepts. You work in a manufacturing and product oriented development environment and collaborate with vendors and outside sources in order to see parts through to manufacture.</p>\n\n<p>In this role, you will help us set the product roadmap for AR/VR hardware products. The AR/VR Hardware product design team will drive product excellence through rapid prototyping and feasibility study of AR/VR hardware product concepts. Our goal is to validate use cases and prototype hardware product concepts and technologies for testing and software development. Our work will inform the product roadmap and set the bar for hardware across AR/VR platforms.</p><p>The Google Virtual Reality and Augmented Reality team is a fast moving group of engineers, designers, and research scientists tasked with building the foundations for great immersive and augmented reality apps and prototyping novel, delightful user experiences. We are focused on making virtual reality accessible to millions of people through mobile devices, and its scope continues to grow and evolve.<br></p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4604998878953472",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:54:15.277Z",
    "publish_date": "2019-02-27T19:54:15.277Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Mechanical Engineering, Product Design, related field, or equivalent practical experience.</li><li>3 years of work experience in consumer electronic or handheld product design, using different materials and manufacturing techniques (e.g., injection, compression, insert molding, sheet metal forming, and casting).</li><li>Experience with Computer Aided Design (CAD) tools (e.g., PTC Creo or NX) and mechanical simulation tools.</li><li>Experience in the mechanical design of plastic and metal components, Printed Circuit Boards/Flexible Printed Circuit Boards (PCB/FPCB), and acoustics used in consumer electronic products.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Mechanical Engineering.</li>\n<li>5 years of experience in consumer electronics with a focus on mobile consumer electronics.</li>\n<li>Experience in shipping multiple products in a lead or principal engineer role.</li>\n<li>Experience with fabrication.</li>\n<li>Experience collaborating across project teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define new architectures for AR/VR products while collaborating with ID and Human Factors teams.</li>\n<li>Solve all issues associated with the natural path of product development with creativity and smart designs.</li>\n<li>Manage all aspects of product design activities starting at early stages of the concept design, into prototyping, and manufacturing.</li>\n<li>Onboard and guide other Product Design team members.</li>\n<li>Work directly with Engineering partners, Reliability, and Operation to ensure excellence in product design execution.</li>\n</ul>",
    "title": "Product Design Engineer, AR/VR"
}