{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYaIerVbJVVppFNKX3ezE8rbEImq57BCaVtxXyH0zJISOgCPMA3TrEBST9RrG_qwVPXPHiPvuzi_VgspjfYUv-jeRHoWKJvBIE-3OJ7Mom27P6XJRXcjy0uQCsY%3D_V2&jobTitle=Technical+Program+Manager+Leadership%2C+Wear+and+Fit&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T09:31:43.793Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n\n<p>Our mission is to build amazing fitness and health experiences, and bring the best of Google services to users&#39; wrists. As a Technical Program Manager, you&#39;ll partner with leadership and shape the future of Wear and Fit. You will create and shape the processes of the entire organization - from how we develop and deliver software to how we communicate and coordinate across continents. You&#39;ll shape and drive multi-quarter roadmaps, work with partner engineering to deliver quality platforms, identify projects and their key path dependencies, mitigate risks, bring order out of chaos and ensure that our organization is strategically aligned with the needs of our customers.</p><p>One of the many reasons Google consistently brings innovative, world-changing products to market is because of the collaborative work we do in Product Management. With eyes focused squarely on the future, our team works closely with creative and prolific engineers to help design and develop technologies that improve access to the world&#39;s information. We&#39;re responsible for guiding products throughout the execution cycle, focusing specifically on analyzing, positioning, packaging, promoting and tailoring our solutions to all the markets where Google does business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6048291953508352",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:47:26.904Z",
    "publish_date": "2019-02-27T19:47:26.904Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related engineering field or equivalent practical experience.</li>\n<li>6 years of industry experience managing large, complex projects.</li>\n<li>Experience working on consumer electronic devices.</li>\n<li>Ability to travel (domestic and international) up to 30% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience hiring and leading teams including distributed teams and vendors.</li>\n<li>Ability to understand software engineering fundamentals and exposure to large-scale systems.</li>\n<li>Adept at leading teams of highly talented, independent individuals with a track record of quickly earning credibility.</li>\n<li>Ability to think strategically to plan and anticipate future needs/challenges while also being able to operate tactically when the situation warrants.</li>\n<li>Effective analytical, problem-solving and organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage and grow a team of highly motivated and diversely skilled Technical/Program Managers. Identify and solve cross-functional and inter-team challenges quickly.</li>\n<li>Manage multiple interdependent projects of moderate to high complexity and scope.</li>\n<li>Use technical judgement to drive project delivery, technology reviews, challenge proposals and build consensus.</li>\n<li>Advocate quality practices across Wear, Fit, and throughout Google.</li>\n<li>Build positive, trusting relationships through consistent, on-time delivery of commitments and effective communication.</li>\n</ul>",
    "title": "Technical Program Manager Leadership, Wear and Fit"
}