{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYbIcYuIGDusL3h-FpSgtTaY1Qks6jb7p4fshg4F1P4SOgCPMA3TNJV117ilZlpAjYcz3XxyRIdBdFswKekOoEv7DFbLyBoZm7ponn9uIaFJRoHgWqIliIysoCE%3D_V2&jobTitle=Data+Science+Program+Manager%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:43:34.470Z",
    "description": "<p>At Google, data drives all of our decision-making. Data Science Program Managers work all across the organization to help shape Google&#39;s business and technical strategies by processing, analyzing and interpreting huge data sets. Using analytical rigor and statistical methods, you mine through data to identify opportunities for Google and our clients to operate more efficiently, from enhancing advertising efficacy to network infrastructure optimization to studying user behavior. As a Data Science Program Manager, you do more than just crunch the numbers. You work with Engineers, Product Managers, Sales Associates and Marketing teams to adjust Google&#39;s practices according to your findings. Identifying the problem is only half the job; you also figure out the solution.</p>\n\n\n<p>The Google Customer Solutions (GCS) Sales and Market Intelligence team (SMI) helps to power Google&#39;s high growth Small and Medium Businesses organization. We are looking for a Data Science Program Manager (PM) to lead our strategy to transform the GCS organization by delivering advanced machine learning and predictive analytics solutions at scale, in close partnership with Engineering, Sales, and Marketing teams across Google.\n</p>\n\n\n<p>As a Data Science PM, you will utilize the power of Google data, machine learning, and artificial intelligence, to deliver insights at scale that drive both long term strategy and daily insights for Marketing and Sales. You will also partner with different Google Engineering teams to develop automated customer-level insights, consolidating existing Google technologies and building new ones. You will leverage your product and business experience to define and prioritize product requirements for the engineering teams. \n</p>\n\n\n<p>You have the ability to break down complex problems into steps that drive product development at Google. You&#39;re organized and have excellent influencing and negotiation skills. Additionally, you will have meaningful exposure and visibility to senior executives and cross-functional leaders as you promote the product roadmap, clearly articulating the impact from solutions.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5760648723890176",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:51:38.783Z",
    "publish_date": "2019-02-27T19:51:38.783Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a quantitative discipline (e.g., Operations Research, Statistics, Applied Mathematics, Engineering, Social Sciences) or equivalent practical experience.</li>\n<li>6 years of experience initiating and developing data products.</li>\n<li>Experience with statistical modeling and machine learning algorithms.</li>\n<li>Experience with coding technologies, e.g. JavaScript, Java, Python, R, SQL.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in a quantitative discipline or equivalent practical experience.</li>\n<li>10 years of experience working across-organizations initiating and developing data products.</li>\n<li>Experience in technical roles with Data Science, Product Management and Engineering, and launching products to sales teams.</li>\n<li>Comfortable working in a fast-paced and fast-changing environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand business practices and identify opportunities where data science can contribute to GCS strategic goals.</li>\n<li>Collaborate closely with sales and marketing leads, and technical partners to evaluate opportunities, and translate business opportunities into data solutions.</li>\n<li>Analyze data to validate approaches, propose solutions, provide guidance to data scientists, and design roadmaps for exploration and development.</li>\n<li>Initiate and prioritize implementation projects with technical and engineering teams, track product development, and develop launch plans.</li>\n<li>Drive global feature prioritization, process improvements, and tools requirements to improve product serviceability.</li>\n</ul>",
    "title": "Data Science Program Manager, Google Customer Solutions"
}