{
    "application_instruction": "<b> <p>This role is based in our Tempe, Phoenix, AZ vendor office. </p> </b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfTyx9jerU9213QNXkWLmWCuzAX6IO9U2gvNvU1fYMQSOgASYQ8wfz1kI2UvUCZK_g-TKowxaN52tUF82qZI8aylACklQ24HY-UEPQvUaV9HvQhcjtRQVcynAXQ%3D_V2&jobTitle=Scaled+Sales+Manager%2C+New+Business+Sales&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T23:31:40.396Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p> <p>The New Business Sales (NBS) Scaled team&#39;s Sales Manager supports our outsourced Medium-sized Businesses (Mid-Market) acquisitions. With an interest in large-scale program management, sales and business development, you will set up a new scaled operation serving the North America region and will partner with the vendor to recruit and enable a new Sales team and to drive sales productivity. You will manage the day-to-day relationship with our vendor partner and drive effective partnership with the internal teams. You will focus on the rhythm of the business, supporting the vendor management team in running a successful Google Ads Sales team. You will also work closely with the NBS Americas management team as well as other NBS Scaled sites in the region.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/99970066503606982",
    "location": {
        "address_lines": [
            "Phoenix, AZ, USA"
        ],
        "city": "Phoenix",
        "country": "AZ",
        "country_code": "US",
        "display": "Phoenix, AZ, USA",
        "lat": 33.4483771,
        "lon": -112.0740373
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Phoenix%2C+AZ%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Phoenix%2C+AZ%2C+USA&size=1168x324&zoom=12&signature=Cx1fIDiEyRFXUUD7TbHseZXWMps=",
        "large_2x": "/maps/api/staticmap?center=Phoenix%2C+AZ%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Phoenix%2C+AZ%2C+USA&scale=2&size=1024x324&zoom=12&signature=YKFK6_gkO8iZxihwBbqQ84ltHtg=",
        "small_1x": "/maps/api/staticmap?center=Phoenix%2C+AZ%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Phoenix%2C+AZ%2C+USA&size=600x400&zoom=12&signature=0RRN1IWypZnIDDQ5ZeeD2QkS-Mc=",
        "small_2x": "/maps/api/staticmap?center=Phoenix%2C+AZ%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Phoenix%2C+AZ%2C+USA&scale=2&size=600x400&zoom=12&signature=00qf-AATzMJ06OygDDDzO3ikk8o="
    },
    "modified": "2019-03-07T23:31:40.396Z",
    "publish_date": "2019-03-07T23:31:40.396Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Bachelor&#39;s degree or equivalent practical experience.</li> <li>4 years of experience in sales management.</li> <li>Experience in digital advertising sales.</li> </ul><br><p>Preferred qualifications:</p><ul> <li>Demonstrated product training, business partnering, and leadership abilities.</li> <li>Strong ability to manage projects, problem-solve, and translate analysis and insights into actionable business plans.</li> <li>Excellent communication skills.</li> </ul>",
    "responsibilities": "<ul> <li>Drive Mid-Market customer acquisitions through effective business partnering and overall support of our vendor operations to meet and exceed business goals. Coordinate with relevant internal Google departments and work on initiatives and projects that improve operations.</li> <li>Serve as an onsite Google representative, providing Google-specific product and tool support for our vendor partner. Act as a liaison between our vendor and country Business-to-Business (B2B) marketing team.</li> <li>Work closely with various internal groups to understand business requirements, implement new processes, and contribute to ongoing process and product/tools improvements.</li> <li>Analyze and present weekly performance figures and participate in weekly updates and monthly business reviews.</li> <li>Deliver induction training for new sales representatives, especially with regards to Google Ads product training, campaign building, and regular product and policy updates.</li> </ul>",
    "title": "Scaled Sales Manager, New Business Sales"
}