{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVLZFsInyd7rvoIXOLOJyQYKGT_ngtU07GqOyOOTeUoSOgASYQ8w-I6jPu_jFPv7lGLRCwk1GbzGNZKMwbGoAdutpOkHywi7xRn1IBs_qnL2m0d2cSu_jkowI34%3D_V2&jobTitle=Real+Estate+Project+Executive&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-25T21:01:58.265Z",
    "description": "<p>As a member of the Google Real Estate team, you will be on the front lines of Google&#39;s physical expansion. You will think critically and be part of a team with a wide range of responsibilities, including the design and construction oversight of our next and ever expanding offices. You will help manage spatial requirements for a workforce that is growing to ensure that the job is done to Google&#39;s high and industry-setting standards and in a way that promises long-term sustainability and care for our world&#39;s resources.\n</p>\n\n\n<p>As a Real Estate Project Executive, you will lead a scope of services and associated teams involved in the planning and management of Google’s real estate projects. You will be directly responsible for planning/development, financial analysis/administration, and design/construction oversight of new and/or expanding corporate offices across Google’s portfolio.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/98285372561072838",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:40:54.319Z",
    "publish_date": "2019-02-27T19:40:54.319Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Architecture, Construction, Engineering, a related field or equivalent practical experience.</li>\n<li>15 years of experience in planning, design development, project management, and/or real estate development and leadership of corporate real estate assets.</li>\n<li>Experience in corporate design or construction project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Architecture, Business, Construction Management, or Engineering.</li>\n<li>Experience in a fast-paced technology environment.</li>\n<li>Ability to produce and deliver executive presentations, project status reports, and communicate deliverables to stakeholders and management teams.</li>\n<li>Ability to translate ideas and capabilities into effective initiatives.</li>\n<li>Ability to think creatively and provide non-standard and innovative solutions. Ability to influence strategic change and initiatives.</li>\n<li>Excellent vision, leadership, and strategic skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead all aspects of the program, concept and design development, schedule and budget management, and construction of Google real estate. Manage tenant improvement and build-to-suit projects.</li>\n<li>Engage with customers, cross-functional partners, and internal organizations, demonstrating your ability to drive consensus and compromise. Communicate project information and updates to Googlers and leadership.</li>\n<li>Contribute to market specific portfolio strategy. Manage and track all aspects of the design, schedule, budget, and construction.</li>\n<li>Work independently on real estate challenges requiring in-depth analysis and evaluation of business situations. Manage and participate in transactions process and entitlements for the properties as defined by the real estate strategy.</li>\n<li>Perform analysis on build vs. lease and retrofit vs. new construction analysis, financial analysis, budgeting, tracking and schedule management for all aspects of the project. Contribute to and implement a multi-year master plan process.</li>\n</ul>",
    "title": "Real Estate Project Executive"
}