{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU7Kg-wwYTZCygkD2-rCy2UIGZsInprxF1U2k-eC_aESOgCPMA3Tt9caaNExIOVudLxi2XOBMFzM-ezsSNIwEERrXQTpnb9Kzx_T7mJzY0KFj8NWQ97IRvdAKho%3D_V2&jobTitle=Organizational+Change+Manager%2C+Finance&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:03:23.710Z",
    "description": "<p>Organizational Change Managers drive critical priorities for Google by leading and assisting in projects of all sizes. Drawing from your strong financial background, you work with a diverse team to manage projects from concept to implementation and keep Google-wide stakeholders informed as you go. You get down into the details of complex analyses without losing sight of the overall objective. When working on multiple projects at once, you intuitively know which issues to highlight and can bring key decision makers together to come up with effective solutions. Once a project is completed, you&#39;re able to clearly communicate the results and draw the key learnings for senior management. You are efficient and organized, making the most of everyone&#39;s abilities and holding the team to a high standard.</p><p>In this role, you will help transform Finance’s systems and processes, working closely with Business and Engineering teams across the organization to help Googlers and other relevant stakeholders understand, embrace and sustain change. You will lead stakeholder identification and impact management, establishing and executing communication strategies, assessing readiness and managing training. You will inspire and articulate value and change management outcomes to leaders. As a trusted advisor and coach, you will be the advocate for our end users throughout the lifecycle of every project.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6251233285439488",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:44:32.519Z",
    "publish_date": "2019-02-27T19:44:32.519Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience in management consulting, systems integration, change management, training and/or communications.</li>\n<li>Experience managing transformational and multi-disciplinary change initiatives for Finance, Supply Chain and/or Procurement.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or other advanced degree in a relevant field.</li>\n<li>Experience in change management principles, methodologies, tools and best practices.</li>\n<li>Experience in executing global enterprise resource planning (ERP) and business process transformation.</li>\n<li>Experience navigating large, dynamic organizations.</li>\n<li>Excellent organizational skills.</li>\n<li>Effective written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Perform stakeholder and impact analyses for complex programs with large audiences.</li>\n<li>Partner closely with project teams and executives to create adoption and enablement plans for technology and process changes.</li>\n<li>Manage communications that educate business partners about the value of change management.</li>\n<li>Manage training plan and training resources.</li>\n<li>Build executive presentations and status reports.</li>\n</ul>",
    "title": "Organizational Change Manager, Finance"
}