{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Boulder, CO, USA; Irvine, CA, USA; San Francisco, CA, USA; Los Angeles, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckT2vC7GH6GjoCMYZzf6rVcDAKQW__inSMHrHUFy53XoSOgCPMA3T_e0rpKDKxA12pwEILfvU9LRV0bud9IGSoCENrzSVNdlEdr9ZJsbUyD_ROI7zXy_BACmdRQU%3D_V2&jobTitle=Sales+Engineer%2C+AdTech%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:55.594Z",
    "description": "<p>When leading companies choose Google Cloud it&#39;s a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p>\n\n<p>You are a Sales Engineer with excellent technical, communication, organizational skills and have a passion for how cloud technologies can transform the digital marketing industry. You have big data experience combined with knowledge and experience with digital marketing technologies such as Google Marketing Platform, Google Ads, etc. You will use your expertise and presentation skills to engage with customers to understand their business and technical requirements, and present practical and useful solutions on Google Cloud.\n</p>\n\n<p>In this role, you will work hand-in-hand with technical Sales teams as an AdTech subject matter expert to differentiate Google Cloud to our customers. You will help prospective customers and partners understand the power of Google Cloud, explain technical features, help customers design architectures, and problem-solve any potential roadblocks.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5467244957204480",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:40:44.943Z",
    "publish_date": "2019-02-27T19:40:44.943Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, related technical field or equivalent practical experience.</li>\n<li>Experience with digital marketing solutions (Google Marketing Platform, Google Ads, etc.) and their application to marketing strategies.</li>\n<li>Experience as a technical sales engineer in a cloud computing environment or equivalent experience in a customer-facing role (including working as a member of a professional services or systems engineering team).</li>\n<li>Experience with data analysis, interpretation and visualization of data.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or other technical field.</li>\n<li>Experience with cloud big data analytics solutions to ingest, transform, query and visualize; such as Pub/Sub, BigQuery, Airflow, Dataprep, Dataflow, Datalab (iPython/Jupyter) or equivalent on other Cloud vendors.</li>\n<li>Experience with Machine Learning (regression/classification, supervised/unsupervised learning). Ability to explain concepts such as feature engineering, training and scoring; ability to interpret results of the algorithms.</li>\n<li>Expertise in Google Marketing product APIs: DoubleClick Campaign Manager, DoubleClick Bid Manager, Google Ads.</li>\n<li>Ability to quickly learn, understand, and work with new emerging technologies, methodologies, and solutions in the Cloud/IT technology space.</li>\n<li>Ability to provide insights and recommendations along with effective presentation skills; ability to deliver a technical pitch.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and qualify business opportunities, understand key customer technical objections, and develop the strategy to resolve technical blockers.</li>\n<li>Support the technical relationship with Google’s customers; including product and solution briefings, proof-of-concept work and partner directly with product management to prioritize solutions impacting customer adoption of Google Cloud.</li>\n<li>Work with customers to demonstrate and prototype Google Cloud product integrations in customer/partner environments.</li>\n<li>Recommend integration strategies, enterprise architectures, platforms and application infrastructure required to successfully implement a complete solution using best practices on Google Cloud.</li>\n<li>Travel to customer sites, conferences, and other related events as needed.</li>\n</ul>",
    "title": "Sales Engineer, AdTech, Google Cloud"
}