{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc2iANkunRCrpO5e594DsboD-oZMEbO4VRa7XMX8WncSOQCPMA3TzxpLJz3yi42-p0zaZ5VgDcOjomAvwKWg52NwZroKfaRER8b_-6IfbnQ7sOri7pZ4mASJeQ%3D%3D_V2&jobTitle=Camera+Design+Engineer%2C+Nest&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T23:02:02.465Z",
    "description": "<p>Google engineers develop the next-generation technologies that change how users connect, explore, and interact with information and one another. As a member of an extraordinarily creative, motivated and talented team, you develop new products that are used by millions of people. We need our engineers to be versatile and passionate to take on new problems as we continue to push technology forward. If you get excited about building new things and working across discipline lines, then our team might be your next career step.</p><p>The Nest Camera team architects, designs, develops, validates best in class camera subsystems for delivery to the market in Nest products. As a Camera Design Engineer, you&#39;ll take full responsibility for the design and specification of cameras.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5882430336729088",
    "location": {
        "address_lines": [
            "Palo Alto, CA, USA"
        ],
        "city": "Palo Alto",
        "country": "CA",
        "country_code": "US",
        "display": "Palo Alto, CA, USA",
        "lat": 37.4418834,
        "lon": -122.1430195
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=1168x324&zoom=12&signature=GOsGrZ9EmFQ3uc0juSXRlav_Xl4=",
        "large_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=1024x324&zoom=12&signature=WhIGOqmPY8srQgQr1foTtlDHCuw=",
        "small_1x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&size=600x400&zoom=12&signature=clZaI6MOROjEZw8MkX1WgHhMqS0=",
        "small_2x": "/maps/api/staticmap?center=4001+Miranda+Avenue&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=4001+Miranda+Avenue&scale=2&size=600x400&zoom=12&signature=xx5ozNYJWlySSyqNwNprOYpuunw="
    },
    "modified": "2019-02-27T22:32:01.164Z",
    "publish_date": "2019-02-27T22:32:01.164Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BS degree in an engineering field (electrical, mechanical or related) or equivalent practical experience.</li><li>3 years of practical experience in camera engineering.</li></ul><br><p>Preferred qualifications:</p><ul><li>MS degree in an engineering field (electrical, mechanical or related) or equivalent practical experience.</li><li>Experience in optics design and stray light analysis. CMOS image sensor experience including interfacing and tuning.</li><li>Experience in image quality evaluation including test charts, algorithms, and lighting.</li><li>Experience in prototype bringup and debugging, functional verification, and manufacturing support.</li><li>Background in mechanical design and tolerance analysis of highly constrained, high-volume designs.</li><li>Familiarity with digital imaging pipeline, image quality, and algorithms (AE, AWB, etc).</li></ul>",
    "responsibilities": "<ul><li>Design Nest’s future cameras by leading sensor selection, lens specifications, module architecture, and camera system level design.</li><li>Work with cross-functional teams (software, product design, industrial design, program management, operations, finance, etc) to deliver a successful product to market.</li><li>Validate designs (component and system level validation, ensuring highest level image quality standards).</li><li>Bring designs to mass production by setting factory test requirements, assisting in software bring up, traveling on-site to the manufacturer to ensure the design is built and tested successfully.</li><li>Collaborate on the future architecture and specifications of future Nest’s products.</li></ul>",
    "title": "Camera Design Engineer, Nest"
}