{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Redwood City, CA, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWW2zPNYx0zuh8Yas7ZWSpduSEkrF9waE83-44hXPlwSOgASYQ8w2OziN5B0l1XrM-sgOGmbFek5syOp7ncH5BHkz6lBbwp-drcxbFlVXuEo9ie8gGxocHLIojI%3D_V2&jobTitle=Technical+Project+Manager%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T19:01:46.101Z",
    "description": "<p><b>This role will be transitioning from Mountain View to our campus in Redwood City.</b>\n</p>\n\n<p>Our clients&#39; needs are constantly changing, and so our products need to change with them. Strategic Partner Developers serve as our consultants to our customers, using research and analytics to build long-lasting relationship with our partners. Your expertise of Google&#39;s products and our partners&#39; businesses allow you to identify new opportunities for their growth, launch new products, and expand the impact of our clients&#39; work. You possess strong relationship-building skills and are apt to work effectively with Google&#39;s partners, in order to best represent our users, products and programs and drive growth.</p>\n\n<p>As a Technical Project Manager, you will be responsible for working with partners to support early technical conversations and advise our partners as they build custom advertising solutions. You will work in a technical consultative capacity with our partners to identify technical challenges, provide engineering guidance and solutions, and establish development timelines. You will support our Business Development team and our Partner Management team in assessing partner technical needs and educating partners as they design their platform solutions. You will also integrate with the various Technical teams of our partners, including C-level executives, Product and Engineering Managers, and Developers.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/105841959093838534",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T22:32:03.775Z",
    "publish_date": "2019-02-27T22:32:03.775Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Computer Science, related technical field, or equivalent practical experience.</li><li>3 years of experience working in Software Engineering, Product Management, or Technical Program Manager role.</li><li>2 years of experience building deliverables across the different phases of the Software Development Lifecycle (SDLC).</li><li>2 years of experience in building APIs or managing technical integrations through APIs.</li></ul><br><p>Preferred qualifications:</p><ul><li>2 years of experience working with web technologies (e.g. HTTP, HTML, XML).</li><li>Experience and product knowledge in Google Ads.</li><li>Experience with Agile delivery frameworks.</li><li>Effective project management and business optimization skills.</li><li>Developed organizational and analytical skills.</li><li>Developed consulting and communication skills.</li></ul>",
    "responsibilities": "<ul>\n<li>Identify and optimize business growth flow from new business opportunities by leveraging Google technologies.</li>\n<li>Lead a cross-functional team with Engineering Sales and Partner Managers; work towards strategic business goals with specific partners.</li>\n<li>Address product related questions and technical challenges; improve product feature offerings by providing partner feedback to internal cross-functional teams.</li>\n<li>Analyze and optimize the business growth of existing partners. Work closely with our partners across the solution development cycle from strategy and solution definition through launch and go-to-market; co-manage and drive the completion of key execution deliverables.</li>\n<li>Manage and maximize opportunities through Google&#39;s small and medium sized business channel partners and implement new processes for managing, engaging, and expanding technology partnerships.</li>\n</ul>",
    "title": "Technical Project Manager, Google Customer Solutions"
}