{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYrjZcbRYO93SvYQi-SFtBSzRUB1gf_Cwi0I0Lu_S9oSOgASYQ8wBxEQJMq1lCPf6lYReN7PKk47bJkjHQw23HQ6YHZ7m0deMA180RhrSSuhxruw4WN2t8wjFDU%3D_V2&jobTitle=Global+Product+Lead%2C+Salesforce%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-08T15:01:44.469Z",
    "description": "<div>Our team is focused on the unique needs of small- and medium-sized businesses (SMB) — businesses that often serve an exclusively local audience. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for small businesses of every stripe.</div><div> </div><div>In this role you will lead the development and deployment processes of one of GCS’ Salesforce instances. You will help build and support the tools our GCS sales and operations teams use, to support our SMB customers. </div><div> </div><div>You will work with cross-functional teams to provide the personalization infrastructure for delivering novel services. You have a bias for action, and can break down complex problems into steps that drive product development at Google speed. </div><div><br></div><div>Additionally, you will have exposure and visibility to senior executives and cross-functional leaders as you advocate the product roadmap you have designed, clearly articulating the impact from your solutions.</div><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/122644501979112134",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:43:41.273Z",
    "publish_date": "2019-02-27T19:43:41.273Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of project management experience in CRM with Salesforce.com or similar.</li>\n<li>3 years of hands-on experience configuring Salesforce or similar CRM Product, including workflows, validation rules, and security controls.</li>\n<li>Experience setting priorities and managing multiple projects concurrently.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Certified Salesforce Administrator/Advanced Administrator.</li>\n<li>Experience participating in key meetings with clients (e.g. requirement sessions, system demos, user acceptance testing, and end user training).</li>\n<li>Detail-oriented individual with the ability to quickly ramp up on new clients, their business needs, and technology.</li>\n<li>Proven ability leveraging analytical and problem-solving skills in a fast paced environment.</li>\n<li>Ability to handle and prioritize multiple tasks within a collaborative team environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Gather, document and validate business requirements, system functional and nonfunctional.</li>\n<li>Collaborate with and prioritize asks with the business to ensure in alignment with business strategy.</li>\n<li>Collaborate with internal teams to improve Salesforce integrations with internal systems.</li>\n<li>Articulate design considerations, trade-offs, benefits, and recommendations for system design.</li>\n<li>Communicate a project&#39;s status to stakeholders (i.e. key accomplishments, next steps, issues/risks etc.)</li>\n</ul>",
    "title": "Global Product Lead, Salesforce, Google Customer Solutions"
}