{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA; Boulder, CO, USA; Kirkland, WA, USA; Austin, TX, USA; Chicago, IL, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckY2gW4fUUM5EG96WIP_e0uFP4JBD0u59b1eMErhTZCESOgCPMA3TTVTF6Zlw_ArEChlJ7ne7IiQM95blXpnIqSc3E91r82See6DcGMJ2GwXF3b5er5xpjEzPH1w%3D_V2&jobTitle=Chrome+Browser+Customer+Engineer%2C+Google+Cloud&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:22.837Z",
    "description": "<p>When leading companies choose Google Cloud it&#39;s a huge win for spreading the power of cloud computing globally. Once educational institutions, government agencies, and other businesses sign on to use Google Cloud products, you come in to facilitate making their work more productive, mobile, and collaborative. You assist fellow sales Googlers by problem-solving key technical issues for our customers. You liaise with the product marketing management and engineering teams to stay on top of industry trends and devise enhancements to Google Cloud products.</p><p>As a Chrome Browser Customer Engineer, you’ll be joining our team to work with customers to act as a technical advocate and assist them with the goal of growing adoption of Chrome Browser in their environment. This will be in a variety of capacities both building out Proof of Concepts in order to present demos, or to provide support to overcome technical obstacles that block adoption. </p><p>You&#39;ll have the opportunity to work closely with Product Management, Engineering and Marketing teams and help to influence the product features based on feedback from customers. As the Chrome Enterprise team continues to build features that bridge into other Google Cloud solutions, you will play a pivotal and strategic role in bringing new customers to Google Cloud via their first enterprise experience with Google and Chrome Browser.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6414335107858432",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-02-27T19:44:16.484Z",
    "publish_date": "2019-02-27T19:44:16.484Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>5 years of experience architecting, deploying, and operating mid-to-large scale enterprise end-point computing solutions.</li><li>Experience architecting and supporting device management and application solutions (i.e. Windows GPO/AD).</li><li>Experience working with end-user compute IT administration including Windows, Mac, Linux, and virtualized environments.</li></ul><br><p>Preferred qualifications:</p><ul><li>MCSE, CCE-V, VCP and/or VCAP certification.</li><li>Experience with user directory services (Active Directory) and Identity Management (SSO, SAML).</li><li>Experience architecting and supporting device management applications (JAMF, EMM solutions like Intune/AirWatch).</li><li>Experience with application packaging and deployment technologies (SCCM, Landesk, etc).</li><li>Ability to handle a fast-paced environment, and the flexibility to adapt quickly to changing business needs.</li><li>Demonstrated written and verbal communication skills, including the ability to confidently present in front of customers or at events.</li></ul>",
    "responsibilities": "<ul><li>Work alongside Chrome and Google Cloud Sales teams and certified partners to be a subject matter expert supporting customer opportunities for Chrome browser enterprise adoption and support.</li><li>Develop and create technical collateral and demo videos on how to leverage Chrome browser enterprise features. Participate in regional and industry events to help build awareness for Chrome browser&#39;s enterprise benefits and engage with customers and prospects.</li><li>Liaise with Product Marketing to help provide technical content for Chrome browser collateral and product management to provide feedback and test out new features.</li><li>Build the Proof of Concept environment in order to test or deliver demonstrations.</li><li>Travel up to 30% of the time as required.</li></ul>",
    "title": "Chrome Browser Customer Engineer, Google Cloud"
}