{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSi-5zsD6hj6c72lQdiu_C4ELI1SR42JA48I2TH5dNMSOgASYQ8wG5hrkhhj4lgGihRsvdNGg7Q9rh5XXZHDBNNn56FiYlKuDBfybYwtsPebhUezHY3iSNKSwV8%3D_V2&jobTitle=ASIC+Manager%2C+Networking&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-30T17:01:41.266Z",
    "description": "<p>Our computational challenges are so big, complex and unique we can&#39;t just purchase off-the-shelf hardware, we&#39;ve got to make it ourselves. Your team designs and builds the hardware, software and networking technologies that power all of Google&#39;s services. As an ASIC Manager, you design and build the systems that are the heart of the world&#39;s largest and most powerful computing infrastructure. You develop from the lowest levels of circuit design to large system design and see those systems all the way through to high volume manufacturing. Your work has the potential to shape the machinery that goes into our cutting-edge data centers affecting millions of Google users.</p>\n\n<p>Google Engineers develop next-generation technologies that change how users connect, explore, and interact with information and one another. As an ASIC Manager for an extraordinarily creative, motivated and talented team, you&#39;ll develop new products that are used by millions of people.\n</p>\n\n<p>You&#39;ll work closely with Google Product teams to ensure their goals are met. You will also work with Physical and Manufacturing teams to ensure that designs are viable.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128924727981810374",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:55:03.113Z",
    "publish_date": "2019-02-27T19:55:03.113Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>10 years of ASIC digital design experience, including SystemVerilog, scripting languages and synthesis.</li>\n<li>Experience in networking and working with Ethernet, TCP/IP, buffering, queueing, and scheduling.</li>\n<li>Experience building high throughput, low latency Networking ASICs.</li>\n<li>Experience with taking a product from silicon bringup through to deployment and general availability.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with high speed interfaces such as DDR and SERDES.</li>\n<li>Experience with common peripherals such as PCIe, UART, I2C, SPI, etc.</li>\n<li>Experience working with 3rd party IP vendors and ASIC partners.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the architecture and microarchitecture of current and future generations of ASIC.</li>\n<li>Work closely with Physical Design teams to ensure success.</li>\n<li>Consolidate demands from Verification, Manufacturing and Product teams.</li>\n<li>Help drive internal and external users to vet architecture ideas.</li>\n<li>Work with verification teams to ensure proper implementation of architecture.</li>\n</ul>",
    "title": "ASIC Manager, Networking"
}