{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA; Cambridge, MA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX1aWXZpACLWJk55visI1Oet0D8I7OKKl0aO62QOi1YSOgCPMA3TLJy9jS69jz6x3NAxj688_nLgl3eH3xxCFaAPV4klpMSqgJbLUiZCRn7wgTxXQ9_QrOHjgEk%3D_V2&jobTitle=Technical%2FProgram+Manager%2C+Search&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:37.060Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Google Search reaches billions of users globally and is the core of our business. By joining the Search team you&#39;ll have an opportunity to make an impact on users across the world, many of which are coming online for the first time.\n</p>\n\n<p>We currently have positions available with our Search teams building structured answers, Assistant features, and interest feed for global users. These teams focus on creating a fully integrated, comprehensive Search experience that understands and anticipates users’ needs.</p><p>Google is not a conventional company, and we don’t intend to become one. True, we share attributes with the world’s most successful organizations – a focus on innovation and smart business practices comes to mind – but even as we continue to grow, we’re committed to retaining a small-company feel. At Google, we know that every employee has something important to say, and that every employee is integral to our success. We provide individually-tailored compensation packages that can be comprised of competitive salary, bonus, and equity components, along with the opportunity to earn further financial bonuses and rewards. <br><br>Googlers thrive in small, focused teams and high-energy environments, believe in the ability of technology to change the world, and are as passionate about their lives as they are about their work. For more information, visit www.google.com/careers.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6586815105662976",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:42:48.945Z",
    "publish_date": "2019-02-27T19:42:48.945Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Engineering or a related technical/quantitative field, or equivalent practical experience.</li>\n<li>5 years of experience running medium to large scale software engineering projects end-to-end, project planning, tracking and managing release/risks, etc.</li>\n<li>Experience working with cross-functional or interdisciplinary teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Business or Engineering.</li>\n<li>Experience with various project management tools/methodologies and understanding of respective tradeoffs.</li>\n<li>Knowledgeable of Web and/or Android development environments and release processes is highly desirable.</li>\n<li>Proactive and willing to drive technical discussions with Engineering leads.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead end-to-end delivery of Search features on multiple platforms (e.g., Android, Web, Assistant).</li>\n<li>Collaborate effectively across functions in a matrixed organization to set and manage targets, drive consensus, manage risks and resolve blocking issues along the way.</li>\n<li>Exercise technical and product judgment to scope projects, identify dependencies, manage multi-quarter roadmap and timeline, anticipate and mitigate risks, define and implement processes to speed up and/or scale feature development without sacrificing quality.</li>\n<li>Communicate effectively to a broad range of audiences, roll up your sleeves to drive projects through ambiguity without losing sight of the big picture.</li>\n</ul>",
    "title": "Technical/Program Manager, Search"
}