{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: San Francisco, CA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYNrXpAKzH3m7rfrBrf4VQOHIguhjoMQhcSIWw421ZgSOgASYQ8wv8gHM1hLo7mGK0t6I-wugXjVigkKyUYLZM1TqN1Xqva07eiWkPor11rAhWs5zJJ8TpRDNQA%3D_V2&jobTitle=Strategic+Partnership+Development+Lead%2C+Healthcare%2C+Google+Cloud&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T19:31:56.417Z",
    "description": "<p>The Global Tech Partnerships team develops and supports strategic enterprise partnerships and the partner ecosystem across Google Cloud — G Suite, Google Cloud Platform (GCP), Maps and Education. We work closely with external partners and across Google’s product management, engineering, marketing and all customer-facing organizations to foster tighter integration by partners with Google&#39;s open APIs across Google&#39;s products. Through these technical and business partnerships, we seek to build joint success, customer multipliers and a thriving ecosystem of partners aimed at delighting customers.</p>\n\n<p>As a Strategic Business Development Lead, you will develop partnership strategy and drive business development activities to establish and build Google Cloud’s healthcare business. You will identify, incubate, and develop new opportunities to partner with strategic partners within Healthcare. You will lead product-related business development activities across a range of large enterprise focused companies. Additionally, you will bring industry and technical experience, strategic perspective, excellent business development skills, the ability to clarify and summarize complex issues and attention to detail. You also possess distinctive analytical skills regarding technical and financial issues with partners and the ability to effectively influence and communicate cross-functionally with all levels of management. \n</p>\n\n<p>In this role, you will be responsible for structuring and developing custom agreements and new templates for business initiatives to formalize new business relationships with new and existing technology partners. Additionally, you enjoy a team-oriented environment, working cross-functionally with the Product, Engineering, Marketing, Operations, and Legal teams to develop new ways to drive Google Cloud growth in healthcare.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/110388862460535494",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-13T02:31:48.690Z",
    "publish_date": "2019-03-13T02:31:48.690Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor’s degree in a technical, science, engineering field, or equivalent practical experience.</li><li>6 years of experience in partnership development and strategy.</li><li>4 years of experience in a product, partnerships or marketing function within the healthcare industry.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree, or PhD.</li>\n<li>Experience with cloud computing infrastructure technologies\n, enterprise computing, software, applications, computing hardware and/or platforms.</li>\n<li>Experience in strategic business development\n, structuring and negotiating agreements\n, technology and/or partnerships strategy development.</li>\n<li>Experience identifying partners, negotiating, analyzing, and structuring complex agreements.</li>\n<li>Effective written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with cross-functional teams in Engineering, Product, Marketing, and Sales by creating and leading or supporting high priority healthcare related projects.</li>\n<li>Develop, structure, and sign new partnerships through sourcing, framing, or vetting with inbound partners or with alliances and strategic partner prospects.</li>\n<li>Develop and maintain partner strategy by researching and analyzing product, customer, and market needs.</li>\n<li>Partner with healthcare leadership and leads to identify and develop partner centric initiatives.</li>\n<li>Work with leadership and decision-makers to explore, frame, and operationalize partnership strategies for healthcare.</li>\n</ul>",
    "title": "Strategic Partnership Development Lead, Healthcare, Google Cloud"
}