{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWjyqtNjMVpov_V5J1eoMVzwQdRDtjn5IXZFIGr3qdsSOgASYQ8wu8wOxTEeBIBw35C4097FqkOG83hqiVnG0P-qPhxyXRL5n6UVfH-PwqPgUA7oFjkKwHklt_E%3D_V2&jobTitle=Product+Marketing+Manager%2C+Developer+Marketing%2C+Google+Assistant&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T16:01:43.806Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>Google provides developers with tools and technologies, as well as education and community-oriented programs, that aim to spark innovation and inspire the development of simple, life-improving technologies and viable businesses. Developer Marketing is focused on driving the success of these technologies and programs by executing global, scalable events and creative marketing campaigns that inspire, educate and connect developers. In this role, you&#39;ll have the opportunity to shape one of Google’s conferences, Google I/O. You will create experiences for attendees; empowering the developers who will shape the future of the web and mobile.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/93695305981010630",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:48:45.266Z",
    "publish_date": "2019-02-27T19:48:45.266Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience working in product marketing, marketing program management or consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working as an active participant in technical/developer communities, open source projects or similar developer groups.</li>\n<li>Experience working in a business-to-business environment and marketing technical products.</li>\n<li>Demonstrated expertise as a creative technologist; ability to effectively communicate with engineers and to brainstorm ideas with agencies.</li>\n<li>Demonstrated record in developing effective business positioning and messaging for technical products.</li>\n</ul>",
    "responsibilities": "<ul><li>Act as a strategic partner to the Product and Developer Relations teams; establish deeper developer insights and needs through gathering market intelligence and research.</li><li>Use brand and creative judgment to establish brand guidelines for the product. Leverage media and audience expertise to influence strategic and creative conversations around awareness.</li><li>Lead the mobile and web strategy and execution for all Google I/O surfaces that event attendees will interact with.</li><li>Conceptualize creative solutions and deliver integrated marketing campaigns and programs in order to drive developer engagement.</li><li>Collaborate closely with Developer Relations to amplify and strengthen outreach programs and activities.</li></ul>",
    "title": "Product Marketing Manager, Developer Marketing, Google Assistant"
}