{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckW3X__kN6tBGJxj3Oz1Deog3vJKpcEYEk_vT0Xyh5YISOgASYQ8wJB3PWpRN9cvSVxiGyUYXhQ0NvHjk1DlUL6IuoBiUs7SmS6eew6xLAZQ3p4dFoMKaC-CLgAY%3D_V2&jobTitle=Systems+Abuse+Investigations+Lead%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T15:01:49.756Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n\n<p>As a Systems Abuse Investigations Lead, you’ll lead a global function, be a thought leader, an abuse expert and will collaborate with many teams both within and outside of Trust and Safety. You will bring a passion for user protection, deep technical expertise of abuse trends and an innovative approach to problem-solving. Additionally, you will lead a high performing team to deliver excellent business results while partnering with Engineering, Product, Legal, Policy and Vendor Operations teams to identify risks in our product suite, introduce new controls and drive operational performance to lower abuse rates. In this role, you will work with your management team to advocate for the Trust and Safety mission of protecting users and to provide a rich and rewarding experience for your team members.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/126680423691363014",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:52:38.897Z",
    "publish_date": "2019-02-27T19:52:38.897Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Technology or equivalent practical experience.</li>\n<li>10 years of experience in operations, program management or management consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience driving and managing strategic programs that span multiple organizations and have a direct measurable business impact.</li>\n<li>Experience in leadership, people management and hiring mentoring and retaining talent across global locations.</li>\n<li>Ability to make trade-offs with excellent analytical and problem-solving skills.</li>\n<li>Ability to synthesize information and see the big picture while effectively managing details. Ability to craft and deliver executive presentations.</li>\n<li>Ability to take initiative, adapt quickly and work in as fast-paced, changing team environment with excellent interpersonal skills and a solutions oriented attitude.</li>\n<li>Ability to effectively influence and communicate cross-functionally and across geographies with all levels of management.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be the global functional lead of the Systems Abuse Investigations group in Trust and Safety (T&amp;S) Ads, encompassing both the Ads Security and Account Enforcement teams. Provide thought leadership and influence as part of the Ads and broader Trusted Content Leadership teams.</li>\n<li>Manage, coach, and mentor managers and independent contractor (IC) teams across multiple locations to deliver exceptional business results.</li>\n<li>Partner with the Product Management, Engineering and Legal teams to research abuse trends on our ads products, develop and implement risk mitigation strategies and measure the abuse rate impact of our operations. Structure and execute programs by developing plans, gathering and synthesizing relevant data, leading analyses and developing final recommendations.</li>\n<li>Develop industry and technology experience to stay ahead of abuse threats on our ads ecosystem.</li>\n<li>Define, launch and drive strategic and operational initiatives by working collaboratively and cross-functionally to ensure coordination and alignment on objectives and key results.</li>\n</ul>",
    "title": "Systems Abuse Investigations Lead, Trust and Safety"
}