{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWWQ8xf2-MkWn1f6ttBqlAo660E1IW_CGIusMmB90ukSOgASYQ8wZjdVDj6wP4dl-pEmX5n0bbE0joqIuRlqnAUHe-VHifuEEv8ykghLICG5HhObdQlgHW11yVA%3D_V2&jobTitle=Risk+Management+and+Compliance+Associate&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T18:02:47.157Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s business objectives.</p>\n\n\n<p>The Platforms and Ecosystems Risk Management and Compliance team helps Google to manage commercial agreement and spend governance and the diverse universe of risks associated with these commitments. You will manage agreement and spend review committee reviews of important, high-value commitments, and ensure that Google&#39;s agreement and spend governance policies and processes are effective, efficient, and accountable.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139605746992980678",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-08T18:02:47.157Z",
    "publish_date": "2019-03-08T18:02:47.157Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in management, strategy consulting, or a similar multi-disciplinary in a business capacity.</li>\n<li>Project management experience, including working with cross-functional teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or PhD.</li>\n<li>Internal finance tool experience.</li>\n<li>SQL or AppScript coding experience.</li>\n<li>Experience implementing projects, managing programs, and designing and implementing processes/controls.</li>\n<li>Experience engaging with and crafting communications for executives.</li>\n<li>Excellent communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead cross-functional spend review forums.</li>\n<li>Influence executives and stakeholders to close gaps in control frameworks and develop scalable solutions. Identify, create, and measure process and control improvements that automate manual steps, consolidate bespoke processes, and scale with Google’s growth.</li>\n<li>Draft, vet, and build cross-functional support for new policies and training of teams.</li>\n<li>Use data to architect metrics, solve problems, and enhance executive decision-making.</li>\n<li>Define, implement, and maintain processes and procedures to support sound spend governance by working closely with business partners.</li>\n</ul>",
    "title": "Risk Management and Compliance Associate"
}