{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeyN2L5ylOMo5UYe3ZSYKr4uIlRWL_lQ3JRYdeqjGpESOgASYQ8w6g-E5LDJtVkZAD7-gm0VUMeuMTgVarhAjNTrDNbTsnrNhci_FaR1h1RP6W6IHx5jumDRJnU%3D_V2&jobTitle=Distribution+Program+Manager%2C+Go-To-Market+Partnerships&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-13T01:02:37.787Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>The Cloud Partnerships team is focused on accelerating the adoption of Google Cloud by attracting and growing partners who can acquire new customers and make them successful. \n</p>\n\n\n<p>As the Distribution Program Manager, you&#39;ll be responsible for designing and evolving programmatic policies and investments to accelerate growth with the Google Cloud distributors and indirect reseller ecosystem.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/117855670486606534",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-13T01:02:37.787Z",
    "publish_date": "2019-03-13T01:02:37.787Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in program management, partner development, and/or channel sales in the business technology market.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of partner programs experience at an Enterprise, Software, or Cloud company.</li>\n<li>Experience with competitive partner programs or working with IT channel distributors.</li>\n<li>Track record in designing and executing large scale sales programs across multiple regions and teams.</li>\n<li>Ability to manage numerous projects simultaneously and drive them to successful completion, with a wide range of stakeholders and tight timelines.</li>\n<li>Passion for partners, with ability to achieve quick results. Ability to assume increasing responsibility in a highly successful, fast-paced global organization.</li>\n<li>Excellent communication and interpersonal skills, with ability to influence at executive levels.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define and evolve framework for Google Cloud to work with distributors and indirect resellers at scale.</li>\n<li>Work cross-functionally to define product, industry vertical, and ecosystem priorities in Google Cloud’s multi-tier go-to-market strategy.</li>\n<li>Be an expert on the business and economic models of different partner types. Identify and advocate for levers available to Google to make partners successful.</li>\n<li>Work cross-functionally to design, operationalize, and launch multi-tier channel program offerings aligned to strategic goals.</li>\n<li>Define the set of required enablement elements (tools, resources, etc.) for distributors and indirect resellers to build and grow business focused on Google Cloud technologies.</li>\n</ul>",
    "title": "Distribution Program Manager, Go-To-Market Partnerships"
}