{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Kirkland, WA, USA; Seattle, WA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfsE76VBTvzRca2wKEjxOCSdQdOY22-53wneemz1tVwSOgCPMA3THHjwwBfguYSOvsw1n09HK6jbv60oKlP6Lt_PrAF7a3lhZgOTi860itYx8rmZ2Rr0jH4GDL8%3D_V2&jobTitle=Staffing+Lead%2C+Sourcing&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-28T16:33:14.052Z",
    "description": "<p>Our Staffing Channels Specialists tell the story of Google to the world. They care deeply about cultivating relationships, have lively, thoughtful conversations with their candidates, and know our organization and its products well enough to articulate life-changing opportunities. As an expert in the talent needs of our business, you’ll be an adviser to the extraordinary people you find, engage, and guide through Google’s hiring process. By the time you’ve introduced a would-be Googler to our partners in recruiting, they are comfortable, well informed, and excited about the possibilities that await them here. The demands of our company, as it continues to grow and transform the industry, are great. Your analytical mind, curiosity, and sincere approach to your work make you exceptional enough to meet them.</p>\n\n<p>As the Channels Lead, you will work with the broader Channels and Staffing teams to deliver the best talent from the industry pipeline. You will partner with other team leads and key stakeholders to understand business needs and set expectations accordingly both with your team and partners. \n</p>\n\n<p>Our Channels Leads rely on analytics to challenge conventional thinking and make Google a smarter, more diverse place. Leading a team creative, ambitious Channels Specialists, you will improve and redefine the systems that help secure the most coveted technical leaders and thinkers in our industry. The needs of our clients are varied, complex, and global in scope. To meet these demands for hiring managers around the world, you will find novel ways to motivate the team in its pursuit of lofty hiring goals and influence staffing leaders with rich, meaningful narratives built around data. You will do this while ensuring the clients and candidates that move through your hiring process have a wonderful experience found only at Google.</p><p>Great just isn&#39;t good enough for our People Operations team (you probably know us better as &quot;\u0098Human Resources&quot;). Made up of equal parts HR professionals, former consultants and analysts, we&#39;re the champions of Google&#39;s colorful culture. In People Ops, we &quot;find them, grow them, and keep them&quot;\u009d - we bring the world&#39;s most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5759925938356224",
    "location": {
        "address_lines": [
            "Seattle, WA, USA"
        ],
        "city": "Seattle",
        "country": "WA",
        "country_code": "US",
        "display": "Seattle, WA, USA",
        "lat": 47.6062095,
        "lon": -122.3320708
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=1168x324&zoom=12&signature=ps_sPvgcgFUcz72GpSwau1rebxc=",
        "large_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=1024x324&zoom=12&signature=LGHj2cxqA3QhLZJTwZmYSkwFGho=",
        "small_1x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&size=600x400&zoom=12&signature=D1jnhP7KcjQ4mOvW3HCzt_s7wc8=",
        "small_2x": "/maps/api/staticmap?center=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=601+N.+34th+Street%2C+Seattle%2C+WA+98103%2C+USA&scale=2&size=600x400&zoom=12&signature=LHlLQ_7VV0axWi1ctKvQwOcu_UM="
    },
    "modified": "2019-03-15T17:31:45.356Z",
    "publish_date": "2019-03-15T17:31:45.356Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of relevant experience, including working in a staffing or human resources function.</li>\n<li>5 years of experience leading and managing a team.</li>\n<li>2 years of sourcing or full life cycle recruiting experience, including using an applicant tracking system.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to manage a team through ambiguity in a fast-paced, deadline-driven environment, while accepting ownership and accountability of the process and deliver on commitments.</li>\n<li>Ability to take initiative and build productive relationships.</li>\n<li>Demonstrated analytical skills, a data-driven approach to decision making and a systems-thinking style when problem solving.</li>\n<li>Developed communication, interpersonal and customer service skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with key stakeholders in staffing and broader global team to develop strategy and deliver pipeline according to business priorities.</li>\n<li>Monitor, analyze, and report on key data sets to ensure team performance and manage partner relationships.</li>\n<li>Manage the dynamic workload, optimally distributing amongst the team and empowering our team members to ensure that the team can maintain continuity, quality and a magical experience for our candidates.</li>\n<li>Work across teams to ideate and implement new initiatives and drive them through completion with ongoing assessment and reporting on success metrics.</li>\n<li>Build and lead a team of sourcers to hit/exceed hiring goals.</li>\n</ul>",
    "title": "Staffing Lead, Sourcing"
}