{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdzMYKFQKEgBX6NEXR8gJuPyYTK1yh_sNWo-rvZ9Eb4SOgCPMA3T_f4BtmmkL1iU69Bygh960cz1bqLu_sHDO61L-Iuraq-ZJPIGN5TGFCc5scHc6ofqDzIn0Xs%3D_V2&jobTitle=Account+Manager%2C+Digital+Advertising+Sales&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-14T23:01:40.227Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google solution works for all. Your knowledge of specific area combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business.</p><p><b>Please note, by applying into this position you will be considered for roles in the following domains:\n</b></p>\n\n<p><b>Google Customer Solutions:</b> Our team is dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for every type of businesses.\n</p>\n\n<p><b>Large Customer Sales:</b> Our teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age.\n</p>\n\n<p>Positions are open within the following verticals: Telecom, Financial Services, Performance, Branded Apparel, Pharmaceutical, and Food, Beverage and Restaurants.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6096991451021312",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:39:18.429Z",
    "publish_date": "2019-02-27T19:39:18.429Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree or equivalent practical experience.</li><li>3 years of account management experience in digital advertising, mobile, video, or programmatic sales.</li><li>Experience growing client accounts for a variety of business partners.</li></ul><br><p>Preferred qualifications:</p><ul><li>Expertise in managing digital advertising campaigns with Google Ads or a similar product.</li><li>Experience working towards sales goals.</li><li>Ability to troubleshoot potential issues and articulate problems with internal groups.</li><li>Success in optimizing products and services based on client needs.</li><li>Demonstrated success at working with cross-functional teams and building strong relationships internally and externally.</li><li>Ability to multi-task across multiple projects, sales leads and internal stakeholders.</li></ul>",
    "responsibilities": "<ul><li>Work collaboratively with a team to drive growth with existing accounts.</li><li>Ensure all partners in our portfolio are following Google best practices in setting up and managing their customers&#39; accounts.</li><li>Identify and promote other opportunities for partners across portfolio.</li><li>Develop forward thinking, data-driven analysis and recommendations that align with client goals and quantify high-impact opportunities with clear recommendations to pitch to clients.</li></ul>",
    "title": "Account Manager, Digital Advertising Sales"
}