{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdCIaO5CbGwv2Wpy3SF07KWtH9iEjAfWBwHHgsZviIUSOgASYQ8wcAw0khwWxFNLCAN96MeRudLsDHIlyYNaFHXqgkbKUn8ZAzA57kWYwNi3kUsBCaczC7ZFczs%3D_V2&jobTitle=Global+Process+Owner%2C+Procurement+Operations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T20:01:57.505Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.<br><br>As a Global Process Owner you are directly responsible for either a global process or a set of processes in a region. You lead your team with a clear, strategic vision, always keeping the quality and scalability of your processes in mind, and know how to build trusting relationships with your team and your peer group.</p>\n\n\n<p>The Supplier and Procurement Operations team strives to have the best internal purchasing tools, systems, and processes available. As a member of this team, you will find innovative ways to manage our complex operations. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations, and you proactively minimize operational risk.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/92853768208425670",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-11T20:01:57.505Z",
    "publish_date": "2019-03-11T20:01:57.505Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>10 years of experience in operations, supply chain, and/or procurement.</li>\n<li>Experience in sustaining and new product introduction (NPI).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Experience and success in leading and developing teams with a focus on performance, coaching, mentoring, and collaboration.</li>\n<li>Ability to navigate and get things done across a complex, cross-functional engagement.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead team members to ensure that a cohesive, centralized buying process is designed from user, process, operations, and systems perspectives.</li>\n<li>Lead and set the strategic direction for indirect and supply chain procurement policies, processes, and systems.</li>\n<li>Influence how stakeholder groups procure goods and services, overseeing change management.</li>\n<li>Work closely with partners to ensure that all business requirements are delivered in system functionality. Partner with business stakeholders to launch materials requirement planning systems across new product areas.</li>\n<li>Support NPI purchasing for key product areas, operationalize support models across both on and off shore centers, drive improvements in quality and productivity in procurement support, establish and maintain flexible yet controlled and scalable processes, ensure appropriate governance across Google’s spend, and drive efficiency in operating model and unit cost.</li>\n</ul>",
    "title": "Global Process Owner, Procurement Operations"
}