{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckd0casMkxqyV5uQyA8Z8lPRDgzSA4kz3jJ9eZd895VESOgASYQ8wlJal_mnFujSsThYumcWHG5B499UvrPur3pejKoV4fyct0BuY8dk4JEGavtFpy1HN5wv68oM%3D_V2&jobTitle=Revenue+Programs+Lead%2C+Cloud+Business+Finance&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T18:31:32.805Z",
    "description": "<p>As a Revenue Programs Lead, you will contribute analytical skills and strategic thinking to drive our business forward, providing finance support to business partners as well as offering scope for leadership of individual analytical projects. You will work in close partnership with highly talented finance colleagues and consult on planning, reporting, and decision support for product and program launch processes, assist with management of growth reporting, and work directly with agreement teams to structure programs for operational simplicity while maintaining competitive pricing strategies and economic incentives. </p>\n\n<p>In this role, you will work with high-performing teams across Finance, including Financial Operations, Accounting, Tax, and Financial Planning and Analysis (FP&amp;A), to play a core role providing analytical, technical, and reporting solutions. You will take initiative and contribute knowledge of Business Intelligence (BI) tools and approaches. You will also work with the business in understanding their evolving requirements and with Engineering to deliver practical but innovative solutions of real business benefit. Additionally, you will use your personal skills, creativity, and initiative to build your own prototype solutions and to provide training and guidance to team members and partners.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/114056712991711942",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-19T20:01:58.688Z",
    "publish_date": "2019-03-19T20:01:58.688Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>CPA or CA.</li>\n<li>7 years of experience in public accounting, finance, project management, and/or working in technology organizations.</li>\n<li>Experience with U.S. GAAP.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>MBA.</li><li>Experience empathizing with and influencing others without direct line authority and resolving conflicts diplomatically in high-pressure situations, across different functional groups in a high growth company.</li><li>Experience using SQL to extract and manipulate data.</li><li>Knowledge of ASC 606.</li><li>Ability to work on and prioritize multiple projects while meeting goals and deadlines. Ability to communicate effectively with various levels of management, demonstrating high attention to detail and excellent organization, program management, and communication skills.</li></ul>",
    "responsibilities": "<ul>\n<li>Support Cloud product launches by engaging with cross-functional departments including Product, Financial Planning and Analysis, Engineering, Treasury, Tax, and Financial Operations on new product and system initiatives.</li>\n<li>Partner closely with the controllership team to understand accounting requirements for new product launches and develop operational processes to launch, track, and assess success of products post-launch.</li>\n<li>Develop an end-to-end understanding of the go-to-market processes to be able to identify dependencies between functions and systems and opportunities for improvement.</li>\n<li>Manage project issues/risks, facilitate escalations when needed to management, publish regular project status, and manage other project communications</li>\n<li>Create monthly metrics and key performance indicators (KPIs) to ensure an analytical review of product and monthly financials.</li>\n</ul>",
    "title": "Revenue Programs Lead, Cloud Business Finance"
}