{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYdA5nWn1X_7jTBxy_Ajloyi7KgAVu-WRjNIVnsCfkMSOgASYQ8w30Mn3njpdX35oTP6AOtoBiwoOwMVO4XkFwq68XwJI5F2FNeQrFkJwJbA7hfPSGvlEiMGwUw%3D_V2&jobTitle=Data+Center+Supplier+Quality+Program+Manager&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T18:32:00.002Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Google Data Centers (GDC) make up one of the largest and most powerful computing infrastructures on the planet. The GDC End to End Quality team is responsible for delivering state-of-the-art physical plant infrastructure with predictable quality. As a Google Data Center Supplier Quality PM, you evaluate product and workmanship quality requirements, designs, specifications, suppliers, production lines, quality assurance/control strategies, commissioning, integrators, logistics, assembly and operations to assure on-time delivery of our power, cooling and infrastructure control systems. Your team works cross-functionally with R&amp;D, Platforms, Hardware Operations, Global Commodity Management, Data Center (DC) Design, DC Engineering, DC Program Controls, and DC Operations, to deliver more efficient and greener capacity globally with increasing predictability, low cost of poor quality and shorter lead times. \n</p>\n\n<p><br></p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/94560565663277766",
    "location": {
        "address_lines": [
            "Lithia Springs, GA, USA"
        ],
        "city": "Lithia Springs",
        "country": "GA",
        "country_code": "US",
        "display": "Lithia Springs, GA, USA",
        "lat": 33.7939953,
        "lon": -84.6604899
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Lithia+Springs%2C+GA%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Lithia+Springs%2C+GA%2C+USA&size=1168x324&zoom=12&signature=4ysSf8ndqagDNgryHf_sDrHwXOI=",
        "large_2x": "/maps/api/staticmap?center=Lithia+Springs%2C+GA%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Lithia+Springs%2C+GA%2C+USA&scale=2&size=1024x324&zoom=12&signature=h0FbaztxtO302lN0f0pZmJchSB0=",
        "small_1x": "/maps/api/staticmap?center=Lithia+Springs%2C+GA%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Lithia+Springs%2C+GA%2C+USA&size=600x400&zoom=12&signature=cRCM5eNW96dYyVSDm65Ev4fZyB0=",
        "small_2x": "/maps/api/staticmap?center=Lithia+Springs%2C+GA%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Lithia+Springs%2C+GA%2C+USA&scale=2&size=600x400&zoom=12&signature=WvMHyIMrfqtRzSPMOLp9P6oEvPw="
    },
    "modified": "2019-03-14T18:32:00.002Z",
    "publish_date": "2019-03-14T18:32:00.002Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in a quantitative/technical field or equivalent practical experience.</li>\n<li>Lean/Six Sigma certification (e.g. Green or Black Belt).</li>\n<li>4 years of relevant work experience.</li>\n<li>Experience auditing and managing product or services suppliers/vendors.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>ASQ Certification</li><li>Familiarity with 8D, statistical process control and other predictive quality tools.</li><li>Construction, electrical and/or mechanical engineering background.</li></ul>",
    "responsibilities": "<ul>\n<li>Assemble heatmap and trend data presentations for monthly E2E Quality, New Product Acceleration, and other forums for ongoing supplier, integrator and general contractor engagements. Characterize high priority risk areas based on both quantitative and qualitative assessments.</li>\n<li>Conduct supplier audits, inspect production facilities/lines, articulate and follow through on quality improvement activities to reduce variability, improve predictability, streamline lead time, and improve output quality. Observe Factory Witness and Acceptance Testing. Assure closed loop learning with supplier quality management systems.</li>\n<li>Track supplier quality management system capability and execution to assure QA/QC activities are conducted by suppliers, integrators and general contractors to produce predictable results. Drive consistency in quality metrics presentation layers to enable faster decision making for both product and process improvements for our key suppliers.</li>\n<li>Provide analytical leadership to statistically connect production line metrics and QA/QC audits/testing to field performance. Support analysis to relate supplier field performance to Google experience with product and workmanship quality.</li>\n<li>Support efforts to converge back end tools, logical and physical data models to allow multiple functions and companies to share, analyze, and drive continuous improvement based on quality data.</li>\n</ul>",
    "title": "Data Center Supplier Quality Program Manager"
}