{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckR5ZegvkmtfdltqOu3Z6ureKRNQZRuH8BH0bsc7MtI8SOgASYQ8wMcbDwUFeTnDPJVUkLJDO3Po32qCDQ01F76ZIc8_AROFEftSr9ffR4gjwrh6ur4ykem-ysGQ%3D_V2&jobTitle=Deal+Desk+Contracts+Manager%2C+Partnerships%2C+Go-to-Market%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T19:31:48.572Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>The Cloud Partnerships team is focused on accelerating the adoption of Google Cloud by attracting and growing partners who can bring in new customers and make them successful. The Cloud Partnerships team is dedicated to delivering a partner program that creates value in our partners’ businesses. Our goal is to reward and recognize our partners’ successes as they harness the collective strengths of our organizations to deliver an exceptional experience for our customers. As a Deal Desk Contracts Manager, you will work closely across the Global Partner Strategy and Program team, Finance, and Legal.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/107586403413435078",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:34.238Z",
    "publish_date": "2019-02-27T19:50:34.238Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in agreement negotiation and/or managing a deal desk.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Juris Doctor degree.</li>\n<li>Understanding of Google Cloud technologies from a business perspective.</li>\n<li>Experience with financial modeling, agreement valuation and/or structuring.</li>\n<li>Ability to manage numerous agreements simultaneously and drive them to successful completion, with a wide range of stakeholders and timelines.</li>\n<li>Ability to present analysis in a clear and compelling way.</li>\n<li>Excellent analytical and problem solving skills, combined with effective business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with our Business Development team(s) to resolve agreements for our partner channel.</li>\n<li>Understand our agreements and agreement playbook, to help our Business Development team successfully resolve them.</li>\n<li>Assess risk, anticipate bottlenecks and balance customer demands versus technical constraints related to agreements.</li>\n<li>Participate in and lead projects related to deal desk process, documentation creation, representative agreement, and agreement training. Provide new product support to improve the scalability of the deal desk function and representative efficiency.</li>\n<li>Influence problem-solving with our Business Development team with the goal of training the team to better help themselves.</li>\n</ul>",
    "title": "Deal Desk Contracts Manager, Partnerships, Go-to-Market, Google Cloud"
}