{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUbMvNKIRznukoddVvz7L6y0RXit_xzcl0G5TzwjulwSOgCPMA3TsLXF_WPUGlc2MQIm0jynbdTYzBD1h_2EX6LXeBDaEw-ZegBK-LjZY6bGZHTIHGDoLDgQ8To%3D_V2&jobTitle=Technical+Account+Manager%2C+Android+Automotive%2C+Android+Partner+Engineering&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:00.135Z",
    "description": "<p>As a Technical Solutions Consultant, you are responsible for providing technical solutions and managing relationships with Google&#39;s largest and most strategic online publishers. As a liaison between clients and our technical staff, you flawlessly lead deployments, implementations and integrations of a variety of our product lines (such as Search, Mobile, Video and Commerce). From monitoring product performance to debugging and troubleshooting product code, you are the resident expert that addresses partner needs. You are a technical expert with an entrepreneurial drive and passion for client management.</p>\n\n<p>The Android Partner Engineering team at Google works closely with a varied set of partners across the globe on all aspects including chipsets, devices, carriers and customer support. The team works in a fast paced technology driven environment to align the strategic goals of Google and its partners with the goal of making Android the platform of choice across multiple consumer and enterprise domains.\n</p>\n\n<p>As a Technical Solutions Consultant in Android Partner Engineering Automotive team, you are the engagement manager taking responsibility for the success of our largest Android Automotive partnerships. You manage the technology engagement with partners on all matters related to Android, with the goal of building strong, successful, long-term partnerships. You also lead deployments, optimize implementations and integrations to drive mutual business success around Android and Google services.\n</p>\n\n<p>With your technical expertise, you work on simplifying and streamlining processes, you support code and architecture reviews from internal and external stakeholders, you gather and analyze data that help Google and its partners to make informed decisions. You also define the scope of technical projects and oversee the execution.\n</p>\n\n<p>You are an excellent communicator, a creative thinker, who thrives in a fast-paced, market-driven environment. You thrive on analyzing technical issues and creating scalable solutions. You are self-motivated and looking to solidify Google&#39;s strategic partnerships on Android.</p><p>Whether working with next-gen chipset manufacturers or emerging market telcos, Google&#39;s Android Partner Engineering team helps solve some of the toughest mobile technology problems. We work with teams throughout Google to develop solutions for strategic partners around the globe. We maintain crucial relationships with and build technical solutions for our long-term partners who are making Android into a world-changing platform. But we&#39;re just getting started.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6334973223305216",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:42:21.909Z",
    "publish_date": "2019-02-27T19:42:21.909Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in C/C++, Java, or scripting languages.</li>\n<li>Experience in the mobile/consumer electronics/embedded space.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Android device development.</li>\n<li>Linux kernel, Linux device drivers and System on Chips (SoC) experience.</li>\n<li>Experience with automotive product development or delivery</li>\n<li>Knowledge of system architecture.</li>\n<li>Demonstrated creative problem-solving approach and strong analytical skills, combined with a strong sense of ownership, and a proactive can-do attitude.</li>\n<li>Excellent communication and project management skills, with a track record of handling multiple customers and streams of work.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Perform implementation reviews, advocate new product features, and ensure the prompt and proper resolution of technical challenges.</li>\n<li>Improve product feature offerings by providing partner feedback to internal cross-functional teams including Product Management and Core Engineering.</li>\n<li>Guarantee the technical aspects of a partner’s integration (both new and ongoing) by providing necessary documentation and technical guidance.</li>\n<li>Identify, drive, and optimize technical and business process flows for existing and new opportunities by leveraging Google technologies.</li>\n</ul>",
    "title": "Technical Account Manager, Android Automotive, Android Partner Engineering"
}