{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; Los Angeles, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTSrB9v0pm6PZhteuJOe1YMcWvaeE_FiPIBAn3mWBrkSOgASYQ8wtSf_kRmq-E_q368WG_wr4tMB0M3TupULVuctec0Y3uDoi_wud-xcVWG3l9kLwdc2jIxqO5c%3D_V2&jobTitle=Technical+Integration+Lead%2C+Experience+Studio&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T16:01:43.846Z",
    "description": "<div><b>This role may also be located in our Playa Vista, CA campus.</b></div><div>As a Technical Integration Lead, you&#39;ll play a key role in the design, development, delivery, and maintenance of a portfolio of Experience Studio’s physical spaces and interactive exhibits. In this role you will be providing strategic solutions for standardizing technology, technical documentation, and technical support models across the portfolio. In addition to this, you will be in charge of ensuring the highest show quality of complex multidisciplinary projects where you will leverage your experience in AV/hardware, controls, software, and network to drive optimal integration solutions across all technical disciplines.</div>\n\n<p>Experience Studio is a team of designers, producers, engineers, and business thinkers whose mission is to inspire Google’s customers through the creation of interactive spaces and exhibits. Our job is to design and deliver engaging physical experiences that tell Google’s story, make Google’s magic more apparent, and communicate Google’s ability to grow customers’ businesses into the digital age and guide their brands into the future. Experience Studio is part of gTech, a global support and operations team, with a mission to delight our customers with care so good, it’s got to be Google.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4769966489370624",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T18:31:45.382Z",
    "publish_date": "2019-03-18T18:31:45.382Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Engineering, Computer Science or related technical field, or equivalent practical experience.</li>\n<li>5 years of experience managing technical workflows for physical installations in theme parks, museum exhibits, retail environments, the performing arts, or a similar environment, including coordinating multidisciplinary teams of engineers, designers, integrators, producers, and business stakeholders.</li>\n<li>Experience in developing and prototyping design solutions.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working across technical disciplines such as audio, video, lighting, show control or creative technology.</li>\n<li>Experience in audio and DSP systems including QSC Q-SYS, projection and media playback systems such as Picturall, architectural and theatrical lighting and control systems including ETC Mosaic and Paradigm, and control systems including Crestron.</li>\n<li>Experience in web technologies (object-oriented JavaScript, HTML, CSS), IT, networking hardware and computer platforms; Linux, MacOS, and Windows, including provisioning, shell scripting, and remote support (SSH, SCP, VNC).</li>\n<li>Scripting languages, such as Python and Lua, Raspberry Pi, Arduino, custom electronics and 3D prototyping.</li>\n<li>Excellent communication skills, with the ability to communicate technical topics clearly and manage client expectations.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive supportability and scalability of technology in spaces and interactive exhibits by setting technology and service design standards and by ensuring that the standards are implemented by internal teams and vendors (e.g. through documentation, training etc.).</li>\n<li>Act as a Technical Director on interactive exhibits and design/build projects by leading an interdisciplinary team across av, control, hardware, network and engineering workstreams in order to design, test and commission optimal technical integration solutions.</li>\n<li>Manage all technical aspects of engagement with vendors, including interviewing and determining technical capabilities, dividing scope, developing standards, maintaining schedules, and ensuring a successful installation.</li>\n<li>Oversee all design/build and new exhibit projects with internal engineers, including dividing scope, developing tests for integration between vendor and internal code, and maintaining schedules.</li>\n<li>Build relationships with technical Google partners, such as AVEng, NetOps, engineers and Technical teams throughout Google to devise technical standards and secure approvals for use.</li>\n</ul>",
    "title": "Technical Integration Lead, Experience Studio"
}