{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Washington, DC, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcauJ_4RjoRhVMjyjIcshje3F5mJIVQIyM6uVhaK4iQSOgASYQ8wFTmakWYa9wNkCVlAdlbDvuWqFk7luBoCwe-mIFq9QSI-VzORUNf2KaV1E2BVm7ty3QsAqCY%3D_V2&jobTitle=Manager%2C+Government+Affairs+and+Public+Policy%2C+Cloud+Standards+and+Compliance&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T20:01:57.088Z",
    "description": "<p>As a member of Google’s Government Affairs and Public Policy team, you&#39;ll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual rigor with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You&#39;re passionate about the opportunity to shape the future of how we use and build technology for everyone.</p>\n\n\n<p>The development, compliance with, and updating of standards are critical to Google Cloud’s business. Accordingly, we have teams dedicated to standards-setting and compliance. In this role, you will work closely with Cloud Trust, Engineering Compliance, and other stakeholders across Google Cloud to develop and execute on strategies and tactics for working on standards and compliance matters with public policy stakeholders.</p><p>Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.<br></p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87778500380893894",
    "location": {
        "address_lines": [
            "Washington, DC, USA"
        ],
        "city": "Washington",
        "country": "DC",
        "country_code": "US",
        "display": "Washington, DC, USA",
        "lat": 38.9071923,
        "lon": -77.0368707
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&size=1168x324&zoom=12&signature=INQ2tYfa33uh4YB3KdYOzWGIRgE=",
        "large_2x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&scale=2&size=1024x324&zoom=12&signature=F02zb3nllEVVQPDVulGaHeF2OnY=",
        "small_1x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&size=600x400&zoom=12&signature=Leq_NLtAoHWBM4BdqTNjtYrRsFQ=",
        "small_2x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&scale=2&size=600x400&zoom=12&signature=KeifREUolWXC01FFllmzO3_ZwWo="
    },
    "modified": "2019-03-19T20:01:57.088Z",
    "publish_date": "2019-03-19T20:01:57.088Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience</li>\n<li>7 years of experience working on technology policy issues within government, think tanks, public interest groups or relevant industry associations.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with international teams and a variety of stakeholders, and in executing strategies to deliver exceptional solutions.</li>\n<li>Subject matter expertise with regulatory compliance issues generally or in a relevant vertical industry (e.g., financial services).</li>\n<li>Ability to identify opportunities and areas for improvement and to operate in a fast-paced environment.</li>\n<li>Ability to exercise good judgment in a rapidly changing and sometimes stressful environment.</li>\n<li>Excellent leadership and communication skills, with the ability to collaborate with multiple teams simultaneously.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build internal partnerships with Google Cloud’s standards and compliance teams to identify and develop strategies for addressing blockers as well as identify opportunities for Google Cloud in the standards space.</li>\n<li>Work collaboratively with Google Cloud and Public Policy stakeholders to address proposed standards, codes of conduct, and similar compliance requirements outside of the legislative and regulatory space.</li>\n<li>Work collaboratively with Google Cloud’s standards and compliance stakeholders and the Public Policy team on engagement with government officials and other public policy stakeholders that interact and engage with standards and compliance organizations, processes, and requirements.</li>\n<li>Partner with Google Cloud stakeholders to draft white papers, develop collateral, and respond to requests for comment from government agencies and regulators with oversight and/or enforcement authority over target verticals.</li>\n</ul>",
    "title": "Manager, Government Affairs and Public Policy, Cloud Standards and Compliance"
}