{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRZopJtNT4D2SUDwGSLl__XGbpGRbfuIc-iE9tL7pw4SOgASYQ8wdIYDY1twpkXHngxV-sw_wOKyc650FGW7Mj-loS-DZJGwzbTu3y9ObZ_8ci7Djojf3I-D2L4%3D_V2&jobTitle=Agency+Sales+Lead%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T20:36:52.573Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p>As a Google Customer Solutions (GCS) Sales Agency Lead, you&#39;ll manage client relationships and lead the sales engagement with agencies in the market. You will enable your team to always reach for ambitious performance goals. You and your team will also work with a wide variety of top GCS agencies to deliver the optimal advertising solution for every partner and their clients.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for every type of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/85526700567208646",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-19T20:36:52.573Z",
    "publish_date": "2019-03-19T20:36:52.573Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>10 years of sales experience in technology, advertising and/or internet, experience growing a market</li>\n<li>4 years of experience leading a Sales team, including coaching, mentoring and team development.</li>\n<li>Experience devising plans to develop and maintain client relationships and accounts.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience in business leadership with strategic and commercial acumen, proven capability to develop and deliver a joined up business strategy that is dynamic and balances short term delivery with longer term sustainable success.</li>\n<li>Sales leadership experience with an ability to open up and develop successful and long term business opportunities and relationships. Ability to develop and close agreements and to build and run a pipeline both directly and through coaching others.</li>\n<li>Strong analytical skills to assess performance, develop actionable insights to capture opportunities.</li>\n<li>Ability to travel up to 20% of the time.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver business growth, engagement and client satisfaction for a portfolio of GCS-managed agencies in an assigned market. Manage and strengthen executive-level agency relations through key meetings, business reviews and speaking engagements.</li>\n<li>Recruit, retain and lead the team of GCS Sales Development Managers and Account Strategists, to ensure improved same-store-growth, high agency satisfaction and enhanced portfolio health.</li>\n<li>Lead and coach a sales team and help them engage with stakeholders in GCS agencies and customers. Build and actively manage effective long-term agency planning process.</li>\n<li>Define the future of agency management and help to develop the necessary infrastructure and processes. Initiate and run strategic initiatives to further develop new and existing GCS agency business.</li>\n</ul>",
    "title": "Agency Sales Lead, Google Customer Solutions"
}