{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUgyfevgkc9Y59Tm-arofePUHa0txmFqOupF_wiegasSOgASYQ8wB9V05DFZ8hIiMgk-WflycWJvRg7cL82u_VcU_N6-uHcOUL9gUFsETY5WgRvwGmec96FAQZQ%3D_V2&jobTitle=Communications+Manager%2C+Ads&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-15T15:31:43.142Z",
    "description": "<p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns; engage in face-to-face meetings with commentators and other opinion formers; and develop print and web-based material supporting these campaigns. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.</p>\n\n\n<p>As a Communications Manager, you will be responsible for leading cross-product narrative storytelling for Google’s Ads and Commerce Communications team. The role carries a broad mandate to develop strategies and narratives across the company’s diverse advertising and commerce business—including Search, YouTube, Display and Video, Apps, Measurement and Analytics, Travel, Payments, and Shopping—and drive key communications initiatives that reside at the intersection of our consumer and B2B offerings.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be a creative self-starter who is willing to try new things and can manage numerous projects with tight deadlines. Things happen quickly at Google, and to do great work you need to be an enthusiastic team player who can work cross-functionally with partners across PR, comms, marketing, product and beyond.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/133800793481323206",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-15T15:31:43.142Z",
    "publish_date": "2019-03-15T15:31:43.142Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in public relations, working with journalists and members of the media.</li>\n<li>Must have work authorization in United States.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with agencies or marketers, digital publishers, or complex organizations with multiple product lines and diverse stakeholders.</li>\n<li>Writing experience, with the ability to help shape organizational and business needs into a speech or narrative.</li>\n<li>Knowledge of the online advertising industry.</li>\n<li>Demonstrated ability to operate efficiently, maintain good judgment in fast-paced environments, and work directly with leaders in the Product, Engineering, Sales, and Marketing organizations.</li>\n<li>Effective written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work closely with Business and Product teams to develop compelling communications materials.</li>\n<li>Devise press strategies, clear messaging, and communications guidance related to our ads offerings for specific audiences.</li>\n<li>Develop and maintain close, productive relationships with journalists, partners, and influencers in the advertising and trade press.</li>\n<li>Train and coach company spokespeople for press engagements.</li>\n</ul>",
    "title": "Communications Manager, Ads"
}