{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckREcpKox-Jsme1_Sh9FiH2kyhzy1g0g8o37oOoYodkQSOgASYQ8wffB98p0J7aB9NK8vcmRgdB6vERMKI4lQEIvhNrE3iaGYfg8b_3oyVRd_ngvOzCFsxJMjEME%3D_V2&jobTitle=Account+Executive%2C+Apps+Vertical&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-31T18:32:12.216Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p>As a Google Account Executive, you&#39;ll help to provide integrated, cross-platform advertising solutions. Google has become a leader in this space because we&#39;ve developed effective products and services for marketers and consumers. The primary responsibility of the Account Executive is to drive and grow new business with Google’s advertisers. You&#39;ll manage business relationships to ensure that needs and requirements are met. This will require you to serve as an advocate within Google while collaborating with other Google teams to provide a comprehensive portfolio of solutions and options. This is a client-facing role requiring deep industry expertise, proven business ability and a broad base of industry contacts. You understand and anticipate how decisions are made, and you will persistently explore and uncover the business needs of clients.</p>&lt;p&gt;Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build strong businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.&lt;/p&gt;",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/128181945600221894",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:48:51.121Z",
    "publish_date": "2019-02-27T19:48:51.121Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>6 years of experience in online sales, business-development and digital advertising sales/marketing.</li></ul><br><p>Preferred qualifications:</p><ul><li>8 years of relevant experience in digital advertising sales.</li><li>Experience in online sales, marketing and creative consulting.</li><li>Knowledge of App Promotion and Universal App Campaigns (UAC) platform.</li><li>Strong knowledge of Google products such as Google Ads.</li><li>Strategic and analytical sales approach with a focus on building relationships with clients.</li><li>Deep understanding of the industry&#39;s issues, a vision for its growth and a commitment to advance Google&#39;s forward-looking strategies within the marketplace.</li></ul>",
    "responsibilities": "<ul><li>Work collaboratively with a team to drive growth with new and existing customers.</li><li>Develop high-level relationships to serve as a trusted consultant with customers to optimize their advertising.</li><li>Generate business plans to define your strategies and tactics.</li><li>Understand and adapt to Google&#39;s ongoing product and technology developments.</li><li>Manage multiple cross-product opportunities and projects.</li></ul>",
    "title": "Account Executive, Apps Vertical"
}