{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckerOeR-HevwWWHmjy3xtPQzMkHWt405Lz5X1RjlWZdISOgASYQ8wj82pzYEXGl8jJnhL9Gk357XZeJQW5APumQMeyrz7WafSUO6_cOlz3rLKCw3XySO3wPJSkS0%3D_V2&jobTitle=Privacy+Compliance+Program+Manager&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T17:31:46.895Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Privacy Compliance Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>As Google grows, we continue to look for ways to better understand and manage compliance with other intersecting obligations, both to our users and with respect to regulatory and legal requirements. The Privacy Compliance team provides assurance that Google’s privacy program is applied consistently and comprehensively, meets our regulatory obligations and improves our users’ trust.\n</p>\n\n<p>In this role, you&#39;ll use your experience in program management to help scale our privacy compliance efforts. You care deeply about user trust, you have excellent organizational program management skills, and can bridge the gap between Engineering and Legal teams. You&#39;ll interact with Product, Privacy and Compliance teams across the company and with the Privacy and Data Protection Office to develop deep insights into the mechanics of how Google Product teams incorporate privacy-by-design into their engineering lifecycles.\n</p>\n\n<p>You will create and drive a program to oversee privacy control governance and look for ways to improve our ability to measure and report on effectiveness. You will work closely with cross-functional teams to analyze, define and verify current and future control solutions to manage risk across Google’s products and services. You will also drive execution of remediation plans when control gaps are identified.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/132836584463442630",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-13T17:01:46.130Z",
    "publish_date": "2019-03-13T17:01:46.130Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience with governance and privacy or security processes and controls at the systems, network and application level.</li>\n<li>Compliance, information security, IT audit and/or risk management experience (ISO 27001, PCI, HIPAA, SOC, SOX, and others).</li>\n<li>Experience with a range of technical infrastructures, such as storage layers, application servers, etc.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Computer Science or related field.</li>\n<li>CIPP or CIPM privacy certification.</li>\n<li>Experience with privacy compliance frameworks, controls, and best practices, including AICPA attestations, ISO 27000 Series.</li>\n<li>Experience working with engineering and non-engineering teams and other cross-functional stakeholders.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Take regulatory and policy requirements and create robust, scalable programs to deliver policy and compliance objectives in Google product areas and storage infrastructure.</li>\n<li>Define metrics for various stakeholders in the privacy programs, and design processes that can be used to collect, process and report on metrics.</li>\n<li>Establish relationships with key technical and functional stakeholders within Google, and leverage cross-functional coordination skills to drive program objectives with teams.</li>\n<li>Work closely with security and privacy leadership to help define and refine security and privacy policy.</li>\n</ul>",
    "title": "Privacy Compliance Program Manager"
}