{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXS-ovPVjcqK6t39xn_whs8WUsWbaN1CWHFpmQUjKzUSOQCPMA3TlRzMiHoAKmYzxBltPdykPBUK7-QN3W-U45PpbnzUbLOFnEZv9KYx2MRi-L0K8SFxmy0tIw%3D%3D_V2&jobTitle=Building+Systems+Lead&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-10T15:31:41.012Z",
    "description": "<p>Buildings at Google embody our culture and inspire our employees to deliver ambitious products and services. As a Building Systems Lead in our Real Estate Development organization (DevCo), you are on the front lines of Google&#39;s physical expansion, working to design campuses and buildings that shape the Google of tomorrow. In this role, you&#39;ll work directly with the DevCo leadership team, helping to define and articulate our vision for performance of the built environment. You&#39;ll be responsible for communicating Google’s built environment performance expectations to a wide range of audiences, as well as guiding and collaborating with technical teams who design, construct and operate our buildings. You have the ability to envision a future that will challenge the idea of traditional design and construction practices, and you&#39;ll ensure that projects achieve our aspirational environmental goals.</p><p>Developing innovative products and services that improve the lives of as many people as possible has been core to Google from the beginning. The Real Estate Investment and Development team is focused on creating inspiring places that enable Google, our employees and communities to thrive. Through thoughtful collaborations and transformational investments, we’re on the front lines of facilitating the next wave of Google’s ground-up developments that embody our culture and inspire a new way of developing places. As an in-house development group, our team’s diversified real estate expertise spans asset and portfolio management, transactions, urban planning and design, entitlements, construction management and district infrastructure.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6483883240914944",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:12.283Z",
    "publish_date": "2019-02-27T19:54:12.283Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Engineering or Building Sciences or equivalent practical experience.</li>\n<li>10 years of experience in building systems design, engineering, or construction, with a focus on mechanical and/or electrical systems.</li>\n<li>Experience working in design and construction delivery processes with experience in ground up design and construction.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in Engineering, Architecture, or Building Sciences.</li>\n<li>Licensed Professional Engineer.</li>\n<li>Experience in district scale system analysis, design and delivery.</li>\n<li>Proven vision, leadership and critical thinking skills. Ability to prioritize evolving initiatives in a fast-paced environment.</li>\n<li>Detail-oriented and highly proficient in producing and delivering executive level presentations. Ability to read audiences and adapt communication style and delivery of information accordingly.</li>\n<li>Ability to translate ideas and capabilities into unconventional solutions and deliver effective initiatives that exceed expectations and spark market transformation.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with internal leaders (e.g., District Directors, Development Executives, District Design Leads and Facilities Engineering Leads) to define and articulate design and performance expectations for building systems on Google’s development projects.</li>\n<li>Collaborate with relevant cross-functional stakeholders and subject matter experts to align building system design with Google’s diverse priorities, while leveraging expertise and lessons learned across all development projects.</li>\n<li>Research and help to select high-performing engineering consultants and trade partners. Provide leadership and direction to these teams assuring that they execute to Google’s vision.</li>\n<li>Define measurable outcomes and performance expectations for Mechanical, Electric and Plumbing (MEP) systems and track success from design through occupancy.</li>\n<li>Evaluate technical solutions, and bring industry-leading ideas on building technologies and integrative processes to the forefront in order to guide building systems decisions and offer innovative solutions.</li>\n</ul>",
    "title": "Building Systems Lead"
}