{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXdHnsxQArmbiAm6asrYCUzMtVUaxB6zB34iZclKXdsSOgASYQ8wYf_gHktCVOXsx_5a22-_QNGlYYeyT1K-bk6l3yshir7HKHb_NaY5gFOP3hsAvAB4IdxLTrw%3D_V2&jobTitle=Communications+Manager%2C+YouTube+Entertainment&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-14T21:31:50.490Z",
    "description": "<p><b>This role may also be located in our Playa Vista, CA campus.</b></p><p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns based on understanding of journalists&#39; interests; engage in face-to-face meetings with commentators and other opinion formers; develop print and web-based material supporting these campaigns; and counter misinformation that might interfere with our business and ability to serve our users. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.<br><br>As a leader, you will keep your team on track with the overall strategy, giving them direction when it comes to specific product and business area decisions. You will also provide direct communications support for senior executives.</p>\n\n\n<p>You are a smart, experienced PR professional to conceive and execute creative campaigns around original series and films being released on YouTube. As a key member of the YouTube PR team, you will strategize and execute the PR strategy for Original series and film campaigns, as well as play a key role in all entertainment PR efforts at YouTube.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values, and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be able to combine creativity with the organizational skills to manage numerous different projects to tight deadlines simultaneously, as well as enjoy pitching to all kinds of journalists, bloggers and commentators (we find it hard too!), or producing internal communications and events for our employees. Things happen quickly at Google and to get stuff done here you need to be an enthusiastic team player - a self-starter who can work cross-functionally and isn&#39;t frightened to take risks or try out new ways of doing things.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139843367937680070",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-18T18:31:43.388Z",
    "publish_date": "2019-03-18T18:31:43.388Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of relevant work experience in consumer publicity, including experience running PR campaigns for TV series or films.</li>\n<li>Experience in writing and strategic communications.</li>\n<li>Authorization to work in the United States.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Solid understanding of entertainment industry, including experience running TV/film campaigns and crafting entertainment awards campaigns.</li>\n<li>Proven record of placements and press contacts with TV, Film and digital journalists.</li>\n<li>Team player who can effectively and efficiently manage multiple high profile campaigns simultaneously.</li>\n<li>Detail-oriented, self-starter, who can work in entrepreneurial environment. Capable of working calmly and quickly in high-stress environments.</li>\n<li>Strong writing and grammatical skills, with the ability to quickly craft press releases, blog posts and production notes.</li>\n<li>Excellent communication skills. Persuasive when presenting to larger groups or in regular meetings, both internally and externally.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Conceive and execute PR campaign strategies to drive consumer and industry interest in original content from YouTube.</li>\n<li>Collaborate with cross-functional departments including Original Content, Content Partnerships, Marketing, Product, and Social Media teams to execute strategic plans.</li>\n<li>Manage and cultivate partnerships with TV, film, general entertainment and digital reporters, including proactively pitching key media on behalf of original content and entertainment initiatives.</li>\n<li>Support media relations efforts at events.</li>\n<li>Liaise with production partners and talent on campaign plans and status.</li>\n</ul>",
    "title": "Communications Manager, YouTube Entertainment"
}