{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Cambridge, MA, USA; Mountain View, CA, USA; New York, NY, USA; Chicago, IL, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfmWV7TUjC0LTRklIQeBMWSizwp84TCcc3S6bKNvv3wSOgASYQ8wi334-F9zx-uYrkLlfFYf5xaE0ajoQA-mUgVjJYy2i6d__PULFG6eFBkeGV_p0TpO7ZuWiaI%3D_V2&jobTitle=Technical+Business+Lead%2C+Sales+Training&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T19:02:20.844Z",
    "description": "<p>As the Technical Business Lead, you will create technical solutions to business problems by designing and/or implementing new technologies and products. You will work with cross-functional stakeholders to prioritize requirements, define scope, ideate, design solutions, get buy-in, then implement the chosen solution either in code or by partnering with internal and external development teams.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/78713854327956166",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-14T19:02:20.844Z",
    "publish_date": "2019-03-14T19:02:20.844Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Design, a similar technical or design field or equivalent practical experience.</li>\n<li>Experience in developing software in a general purpose programming language or designing software products and technologies.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience developing software in Python or JavaScript.</li>\n<li>Experience architecting full-stack web applications.</li>\n<li>Experience with Learning Management Systems and related technologies.</li>\n<li>Experience in corporate training.</li>\n<li>Experience in creating and delivering high-quality learning solutions.</li>\n<li>Experience in independently managing large projects with cross-functional stakeholders.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand customer needs and gather product requirements.</li>\n<li>Create and present mockups and designs, soliciting and incorporating feedback.</li>\n<li>Design, develop, test, deploy, operate, maintain, and improve software and web services.</li>\n<li>Drive complex projects to completion, including developing and maintaining requirements documents and schedules, influencing partners, keeping other contributors in sync, and pushing new releases through privacy and security reviews.</li>\n</ul>",
    "title": "Technical Business Lead, Sales Training"
}