{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSxcny13O0Y1d8XWNYhsQawwjTIa-yT_7yR4zENZI3MSOgCPMA3Txn5QeVc3mGG1ath-fBLE6yVRNNyvKaHKiJuswjYqcqZsVzx0f3eGOmfi8aeBWNA3IuYhqMg%3D_V2&jobTitle=Manager%2C+Product+Solutions+and+Go-to-Market%2C+Online+Partnerships+Group&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:50.241Z",
    "description": "<p>The Online Partnerships Group (OPG) uses our portfolio of product solutions, including AdSense and Google Marketing Platform tools, to help online publishers grow their businesses. You&#39;ll provide creative, industry-leading online advertising solutions for publishers and developers and identify new opportunities. Some of the largest publishers on the web rely on our products and we&#39;re always trying to exceed their expectations and strengthen our long-term partner relationships. We help grow Google&#39;s business with the largest online publishers and provide account management for users of AdSense, Google Ad Manager and more.</p>\n\n\n<p>As a Product Solutions and Go-to-Market Manager, you will be taking on a multi-faceted role encompassing managing a team which leads product commercialization and sales campaign management, and hands-on technical optimizations of our Web partners. You and your team members will be working directly with partners on technical optimizations and troubleshooting. You&#39;ll also work closely with our Sales and Support teams to strategize and communicate new product and feature launches, bringing them to market with uptake and growth. Insights you gain from interactions with partners and our sales teams will then be fed back into our product strategy.</p><p>Google helps our partners find better ways to reach their audiences and manage their digital businesses. In return, our partners provide great content for our products, and they syndicate Google products to enhance their sites and apps. Global Partnerships team members expand and support these relationships by continually finding new opportunities and solving technical problems for our partners. The wider Global Partnerships team includes a variety of different organizations, including CorpDev, Emerging Business Development, Strategy and Operations, Google for Startups, Area 120 and our Display Advertising Business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6453234074058752",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-13T15:31:40.822Z",
    "publish_date": "2019-03-13T15:31:40.822Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree in Computer Science/Software Engineering, or equivalent practical experience.</li><li>4 years relevant working experience.</li><li>Experience working with HTML, JavaScript and SQL.</li><li>Experience in managing or leading teams.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience with product/feature prioritization and data-driven decision making.</li><li>Experience with client service and a passion for building and maintaining successful customer relationships.</li><li>Ability to anticipate the unexpected to succeed in unpredictable situations and resolve complex issues.</li><li>Effective spoken and written communication skills with attention to detail and organizational skills.</li><li>Comfortability working cross-functionally with Product, Engineering, and Marketing teams.</li><li>Demonstrated logic-based problem-solving and analytical skills.</li></ul>",
    "responsibilities": "<ul><li>Manage a team while driving additional efficiencies.</li><li>Partner and collaborate with our Acquisition team around pre-sales pitches and client facing engagements and work to enhance the experience of our partners through exceptional 1:1 customer support.</li><li>Serve as the voice of our publishers and work with Product Management and Engineering teams to influence product strategy, design, and prioritization.</li><li>Collaborate with Sales, Marketing, and Scalable Support teams to maximize product uptake and growth.</li><li>Identify and implement technical optimizations that grow partner businesses.</li></ul>",
    "title": "Manager, Product Solutions and Go-to-Market, Online Partnerships Group"
}