{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfMB6quOd6eQzQYz51m6kCxU1oMHj_9iMzYDrdxuyFwSOgCPMA3T3mEvwD2mno7jhcXnKKmDkjmTz_e2NcLm9l0vDw0PeMhqmTBy7Vq_mVHH7QRamiq2JhpzoAY%3D_V2&jobTitle=Global+Data+and+Analytics+Practice+Lead%2C+Google+Cloud+Professional+Services&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-20T16:01:35.874Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n\n<p>As the Global Data and Analytics Practice Lead, you will be responsible for creating Professional Service’s (PSO) roadmap, designing and building new solutions, market testing and scaling all offerings relating to Google Cloud Platform’s (GCP) data and analytics tools and services. As part of scaling, you will work with both our field PSO teams as well as coordinate rollout and enablement of our broader partner ecosystem. You will serve as the focal point and conduit between PSO and the broader Product Management and Engineering teams.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6275842198142976",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:39:39.367Z",
    "publish_date": "2019-02-27T19:39:39.367Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, a related technical field or equivalent practical experience.</li>\n<li>Experience with data processing software (e.g., Hadoop, Spark, Pig, Hive), data processing algorithms (e.g., MapReduce, Flume) and programming in Java or similar language.</li>\n<li>Experience deploying cloud solutions on one or more cloud vendors.</li>\n<li>Ability to travel up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in technical consulting.</li>\n<li>Global leadership experience with cross-functional teams. Experience with developed professional documentation or published articles.</li>\n<li>Experience working data warehouses, including data warehouse technical architectures, infrastructure components, ETL/ELT and reporting/analytic tools and environments.</li>\n<li>Experience architecting, developing software, or internet scale production-grade Big Data solutions in virtualized environments such as Google Cloud Platform.</li>\n<li>Experience working with big data, information retrieval, data mining or machine learning as well as experience in building multi-tier high availability applications with modern web technologies (such as NoSQL, MongoDB, SparkML, Tensorflow).</li>\n<li>Excellent customer-facing communication, with the ability to work directly with customer’s executives and technical teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Mentor regional leads and practice members and provide industry thought leadership through conferences, articles, videos and social media.</li>\n<li>Drive services product roadmap for the Data and Analytics practice and be critically focused on developing new intellectual property to accelerate services product development.</li>\n<li>Manage and participate directly in the development of services packages, reference architectures, scripts and templates as required.</li>\n<li>Work cross-functionally to understand relevant product direction and inform product roadmap as the voice of the customer.</li>\n<li>Coordinate regional field enablement with regional PSO leadership and work closely with partner organization on external enablement activities.</li>\n</ul>",
    "title": "Global Data and Analytics Practice Lead, Google Cloud Professional Services"
}