{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUuYJjyjdQ85jisT-NYV3pKNz0d-JIKdHyE_Rab65J8SOgASYQ8wakXfLJYyQ_lDWaZlL7o6nFqEtWl9l0uhXqXXVyytUUBmMd7VMBv-kVFtDOMkCzQu4nF5ij0%3D_V2&jobTitle=Program+Manager%2C+Google+Works%2C+People+Operations&loc=US",
    "categories": [
        "PEOPLEOPS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-06T19:01:51.805Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>We focus on hiring the world&#39;s best talent and keeping Googlers happy and productive, growing and developing. We partner with People Operations (POps) to make magical experiences for Googlers, as part of the Google Works mission to build innovative products that inspire and enable Googlers to be successful every day. At POps Works, we build and implement products and technology that enable processes such as Hiring, Talent Management, Benefits, Compensation, and Learning and Development.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87949752940798662",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:09.805Z",
    "publish_date": "2019-02-27T19:49:09.805Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>2 years of experience managing technology projects.</li>\n<li>Experience designing and/or implementing enterprise systems.</li>\n<li>Experience with third-party software integrations and/or in-house software development.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience developing technology roadmaps for a business or a functional domain.</li>\n<li>Excellent executive presence.</li>\n<li>Experience influencing leaders.</li>\n<li>Ability to develop and grow relationships with key stakeholders and partners.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with Engineering and UX teams to drive design, development, implementation, and maintenance of HR solutions, with a first-party and third-party products.</li>\n<li>Develop and execute technology and product roadmaps for HR domain areas.</li>\n<li>Partner with technical and functional leads to identify dependencies and ensure a well-coordinated project plan.</li>\n<li>Oversee the daily operations of project team and workstreams.</li>\n</ul>",
    "title": "Program Manager, Google Works, People Operations"
}