{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdomT3rF_Ahzsf6DL5h4FxtvvvUYkRcaCm8riPr-j6MSOgCPMA3TrXPbarHUAIk3nSEmFmyeLVtpQ78AAbXjiSVEd1hHNSp68GiyJu2iRhU6_8afb46ppJXPoTc%3D_V2&jobTitle=Director%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:29.385Z",
    "description": "<p>As the Director of Google Cloud, you will have a highly visible leadership role in a fast-growing, quick-moving area of Google’s business. You will bring an operational approach to recruiting, coaching, and managing your team. Embracing the mindset, you will drive the team to meet and exceed challenging growth targets. You fully understand the technology of Google’s solutions in the enterprise space, and you are equally comfortable and effective at interfacing with client executives and working in the details of a large business agreement. Leveraging your entrepreneurial talents, you will run the business autonomously and in the way that the group fits into the broader organization.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5863058574606336",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:51:47.124Z",
    "publish_date": "2019-02-27T19:51:47.124Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>15 years of experience in the sales/business development function.</li><li>10 years of experience selling IT solutions to companies.</li>\n<li>10 years of experience leading a team.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in in cloud computing with technical depth.</li>\n<li>Strong experience in customer engagement with a track record of growing the business or product.</li>\n<li>Excellent market reputation and actionable list of network contacts.</li>\n</ul>",
    "responsibilities": "<ul><li>Manage a team of Field Sales Executives and Sales Managers to meet quarterly and annual business growth goals for the region by working with enterprise companies.</li><li>Recruit talent and coach the team with a focus on providing actionable, forthright feedback.</li><li>Create and drive innovative programs focused on achieving growth at scale. Work through and manage details in the business as required.</li><li>Meet with customers or prospects and participate directly in the key agreements and accounts within the region.</li><li>Continue to inject operational rigor into the organization.</li></ul>",
    "title": "Director, Google Cloud"
}