{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdwOnv-383Ij08jVg5PTvhEjFv99jT9L2sS2PqUiQH8SOgASYQ8wy47nN0zArYJMyZ4Mqnj2XYQjewEDj_SkkNX1svgkOBo7knnLKZARaBhqiYN8xgghlAR2M38%3D_V2&jobTitle=Social+Insights+Analyst%2C+Social+Lab&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-06T03:31:38.663Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n<p>As a Social Insights Analyst, you will ignite user connections through breakthrough conversations. You will be responsible for extracting insights to assess our brand and community health, and define and track social KPIs that translate to tangible marketing and business impact.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/138353998773002950",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T22:32:11.018Z",
    "publish_date": "2019-02-27T22:32:11.018Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of digital marketing experience.</li>\n<li>5 years of relevant experience working in social media analytics for global consumer brands.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>A thought leader, with the ability to create unique, value-add and evolving insights.</li>\n<li>Ability to influence at all levels and work effectively across functions and geographies.</li>\n<li>Proactive and independent, with the ability to work well with minimal guidance.</li>\n<li>Well-versed in story-based reporting.</li>\n<li>Excellent analytical skills and a point of view on how to best leverage available analytics platforms.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and manage social analytics frameworks that can track and quantify social impact on core marketing and business goals.</li>\n<li>Establish best practices on how to define, measure, report, and analyze social media program performance against their objectives.</li>\n<li>Serve as primary point of contact for cross-functional teams for all things social analytics and infrastructure.</li>\n<li>Accelerate insights for timely decision making, spot trends early and gain predictability in where and how we invest our resources.</li>\n<li>Use analytics in influencer targeting and develop a data-driven identification process to help determine the influencers.</li>\n</ul>",
    "title": "Social Insights Analyst, Social Lab"
}