{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcka56PDEqoqOdHCULsGsfRrpeDGxgEz_2A96qI0T-VVgSOgASYQ8wzDe2o-4rBugPT7s0zMxhFJR2BoGc2bAr3402PL-IPtsjV9d--ofHKgYvsr_MkYxASM3o3nE%3D_V2&jobTitle=Abuse+Product+Specialist%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-28T17:32:17.686Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, presenting unique challenges and opportunities to support over a billion monthly users globally. Fast-paced, dynamic, and proactive, the YouTube Support team provides seamless, brilliant support to our content creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it, and to allow our users’ voices to help shape product solutions. <br><br>As a member of the Support team, you&#39;ll analyze top issues facing our users and content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you&#39;ll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.</p><p>As an Abuse Product Specialist, you&#39;ll serve as a product and abuse vector expert, and end-user advocate (including creators, viewers, and advertisers) working closely with Product Management, Engineering and Trust and Safety as an integral member of cross-functional Product teams. You will play a key role as the interface between YouTube’s product and operation teams to make sure our products are being designed, communicated, and used in responsible and intended ways. You will also act as an internal product expert for operations teams internationally, collecting and analyzing data to influence product roadmaps and the prioritization of product features.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/120357070982521542",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:01:52.648Z",
    "publish_date": "2019-03-07T01:01:52.648Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>Experience working in a fast-paced, ambiguous, sensitive, and technical environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in project management and execution, multi-tasking and delegating.</li>\n<li>Experience in technical operations and/or relevant experience in similar roles.</li>\n<li>Understanding of YouTube ecosystem (e.g. viewers, partners, advertisers), workflows and products.</li>\n<li>Knowledge of SQL and advanced spreadsheets.</li>\n<li>Ability to structure agreements skills and to influence others.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide strategic insights and lead continuous product improvement efforts at YouTube, working closely with Product, Engineering, and Trust and Safety teams.</li>\n<li>Prioritize feedback/ideas based on robust data and build business cases in order to embed requests within product roadmaps.</li>\n<li>Be a product expert and serve as a consultant for the partnership/ops teams and be responsible for product knowledge dissemination in the organization.</li>\n<li>Work cross functionally with multiple teams to guarantee market readiness, communications, trainings and support for launches. Manage technical challenges and collect user feedback from the field and provide guidance on resolution to Partnership teams.</li>\n<li>Plan, coordinate and manage launch, activation and adoption activities for key product features and platform changes to Content Partnerships.</li>\n</ul>",
    "title": "Abuse Product Specialist, Trust and Safety, YouTube"
}