{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaJS2zkRNh2MdbRShmkinjdR9Y8gFgKvlotaR5_e65oSOgASYQ8wuKsbzNvvtBVttLP_B7Wg3RiyEMBV0Woeq9eQKQQiU7rQl1wr6RFHjHESl__9Hc5HCy5GNmo%3D_V2&jobTitle=Central+Strategy+and+Operations+Manager%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T02:01:49.260Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Central Strategy and Operations (CSO) team within GCS Revenue Strategy and Operations (RSO) is responsible for consolidating decisions and owners in key areas that are global, cross-functional, and across all programs. This is accomplished through the creation of strong Centers of Excellence against each global capability, including Strategy, Business Planning, and Incentives &amp; Integrity. CSO also leads partnerships with critical cross-functional stakeholders, such as HR and gTech.\n</p>\n\n<p>As part of the Sales Capabilities team, you will work cross-functionally to ensure GCS is on the cutting edge of the development of our people and their capabilities. You will be a thought leader on transforming seller capabilities and developing people strategies to strengthen GCS foundations for the future. You will regularly interface with leadership within GCS as well as critical partner teams such as HR, Staffing, Sales Mastery, Learning and Development (L&amp;D). And finally, you will establish operating rhythms and governance to ensure the GCS people priorities and executed to drive impact for the business.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/82672898004656838",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:56:40.962Z",
    "publish_date": "2019-02-27T19:56:40.962Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience</li>\n<li>8 years of experience in a sales leadership, sales strategy and operations, corporate strategy, corporate development or management consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in project management, problem-solving, and analysis.</li>\n<li>Excellent communication skills, both verbal and written; ability to distill insights into presentations for non-technical audiences and to integrate and synthesize multiple viewpoints and key messages into high-impact communications.</li>\n<li>Experience in researching and analyzing key business drivers, trends, and operating metrics.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and manage multiple cross-functional programs and projects to drive the GCS People Priorities.</li>\n<li>Coordinate project delivery with cross-functional stakeholders including People Ops, Sales Mastery, Sales leaders, and Program Managers.</li>\n<li>Lead change management efforts to successfully land projects across the organization.</li>\n<li>Measure impact of these initiatives, both on our people and on the business.</li>\n<li>Synthesize findings and impact into executive-level narratives and presentations.</li>\n</ul>",
    "title": "Central Strategy and Operations Manager, Google Customer Solutions"
}