{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUSmiJ7HukxF6qVPwTXs_Uy_cW4Orv1BTsyx6NDTThUSOgASYQ8wp5NYlhxWtgrvTD45I8mOvjRmd2J81yHukCyshCWUwbzHwFFt1KAlMMXopQLm9pQ8ZbjKn2I%3D_V2&jobTitle=Mobile+Apps+Product+Strategy+and+Commercialization+Manager&loc=US",
    "categories": [
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-02T00:32:13.743Z",
    "description": "<p>The Online Partnerships Group (OPG) uses our portfolio of product solutions, including AdSense and Google Marketing Platform tools, to help online publishers grow their businesses. You&#39;ll provide creative, industry-leading online advertising solutions for publishers and developers and identify new opportunities. Some of the largest publishers on the web rely on our products and we&#39;re always trying to exceed their expectations and strengthen our long-term partner relationships. We help grow Google&#39;s business with the largest online publishers and provide account management for users of AdSense, Google Ad Manager and more.</p>\n\n<p>As the North America Mobile Apps Product Strategy and Commercialization Manager, you will be responsible for leading a team charged with commercializing the latest Mobile Apps Ads products, working closely with our Product and Engineering counterparts. \n</p>\n\n<p>Based on interactions with our front-line sales teams, as well as on their research and industry knowledge, the team works with Product and Engineering to ensure a cohesive go-to-market strategy for Ads products. Responsibilities include beta design and management, sales and support training and process design, campaign setup, and technical troubleshooting. \n</p>\n\n<p>As the leader of the team, you are a thought leader for our Apps business with a multi-year outlook. You will be responsible for building and maintaining a senior level relationship with the Online Partnerships Group’s overall Mobile Apps business owner as well as the Mobile Apps Product and Engineering leads.</p><p>Google helps our partners find better ways to reach their. e their digital businesses. In return, our partners provide great content for our products, and they syndicate Google products to enhance their sites and apps. Global Partnerships team members expand and support these relationships by continually finding new opportunities and solving technical problems for our partners. The wider Global Partnerships team includes a variety of different organizations, including CorpDev, Emerging Business Development, Strategy and Operations, Google for Startups, Area 120 and our Display Advertising Business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/123765443614646982",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:55:22.494Z",
    "publish_date": "2019-02-27T19:55:22.494Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science/Software Engineering, or equivalent practical experience.</li>\n<li>4 years of relevant working experience.</li>\n<li>Experience in managing or leading teams.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with Java, C#, Swift, and/or any additional programming languages.</li>\n<li>Distinctive problem solving and analysis skills, combined with impeccable business judgment.</li>\n<li>Attention to detail and the ability to juggle multiple work-streams in a fast-paced environment.</li>\n<li>Excellent interpersonal, written and oral communication skills.</li></ul>",
    "responsibilities": "<ul>\n<li>Inspire, lead, and manage a team of Mobile Apps Product Sales Leads to deliver product strategies and commercialization efforts that effectively drive both long-term App ecosystem health as well as Google business growth.</li>\n<li>Provide strategic thought leadership for Mobile Apps based on industry insight and publisher interactions.</li>\n<li>Develop strong cross-functional relationships with senior level Product, Engineering, Marketing, gTech, and front-line Online Partnerships Group sales and support leads.</li>\n</ul>",
    "title": "Mobile Apps Product Strategy and Commercialization Manager"
}