{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Seattle, WA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc3W2OXp0PvwYVdKe9yiSRJCBJOZr-EzRFkI7u4LT5kSOgCPMA3T1AKMI87_EofXzaBJ2Vh7Shor5kG-qEqKR8sEH2Km2zKJQlNT_HrtgUpbc7DY7tUvpS0AQJw%3D_V2&jobTitle=Food+Program+Regional+Design+Lead&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-27T19:31:43.494Z",
    "description": "<p>The Food team is responsible for creating food experiences that promote collaboration and engage and energize Googlers throughout each day. With more than 250 cafes globally serving over 215,000 meals daily, the team works with a variety of vendors to provide great service, delicious food and innovative food experiences. As the Food Program Regional Design Lead you think about everything that goes into how Googlers interact with food. From our ever-popular MicroKitchens to multi-course meals at cafes, the design, layout and experience of eating at Google should promote healthy habits and social serendipity for Googlers. Our food venues need to support the healthiest, happiest workforce.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5271395433644032",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T21:11:47.679Z",
    "publish_date": "2019-02-27T19:53:51.036Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Design or equivalent practical experience.</li>\n<li>11 years of professional design work with a focus on restaurant, hotel or other hospitality design. Experience with food service operations and flow either through direct experience or professional design work.</li>\n<li>Ability to travel up to 50% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Proven vision, leadership and strategic skills to prioritize evolving initiatives in a fast-paced environment; able to turn ideas and capabilities into effective initiatives that engage users.</li>\n<li>Ability to balance design, with operational needs and budget objectives resulting in exceptional venue environments.</li>\n<li>Detail oriented with ability to think, plan, and execute on multiple projects in different phases simultaneously with little direct supervision.</li>\n<li>Skilled in the visual, written and verbal communication of design issues with capability to think outside the box and bring creative, non-standard, and innovative solutions to the table.</li>\n<li>Understanding of permitting process, construction terminology and building systems, and overall project sequence and timing.</li>\n<li>Experience working in or across multiple countries with a preference of countries within Latin America.</li></ul>",
    "responsibilities": "<ul>\n<li>Co-create, verbalize the case for, and execute Food Program design strategy for all food venues (cafes, MicroKitchens, coffee bars, etc) within the region and provide clear, effective and timely communication of intended design guidelines, direction, and changes to all applicable project team members and consultants.</li>\n<li>Understand and identify the unique complexities of each project early on in the process in order to objectively identify the most capable resources, specifically but not limited to restaurant/cafe designer and food service equipment consultant. Additionally you should be have the ability to understand and add guidance to budgeting on all levels - overall CapEx spend per project, soft costs per project, design features and elements, value engineering when necessary, and guide future capital planning pipeline.</li>\n<li>Be a strategic partner to the real estate planning team and the local food operations team to help develop the long term food services vision for each site and campus within North and South America. Ability to think through bringing food spaces (cafes, coffee bars, etc) online at the appropriate time to meet growing population demands with each space offering a diversified culinary and user experience is preferred. At times this will include partnering with other amenity teams including fitness, massage, events, etc.</li>\n<li>Represent the Food Team on all North and South America projects approving all milestone design phases from block planning to project completion. Communicate regularly with local food operations teams, real estate project teams, and facilities operation teams in order to eliminate potential pain points to the team and help Google spend its real estate money the best way possible for efficient operations and a positive Googler experience.</li>\n<li>Manage and support a team of design and project managers both internally embedded and external to help track all details of the design, schedule and budget of each project and be able to problem solve to maintain all critical path items and budget constraints.</li>\n</ul>",
    "title": "Food Program Regional Design Lead"
}