{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Chicago, IL, USA; Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckR50z7Hs4FdgLm9iLmVi84vTPbEYa9z4RnNaReW0cPMSOgASYQ8wJhwEPyRF5nwAi5U2NDbnb22PNJXEZS0PzZzXXjrLUMB2Y36xjjfOENRTSUd6XQ4PB3PvNNo%3D_V2&jobTitle=Sales+Development+Manager%2C+Retail&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-05T17:01:48.268Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>As a Sales Development Manager (SDM), you&#39;ll promote customer conversations through strategic storytelling and actionable insights for positive growth and relationship outcomes. You will ensure that scalable, client-centered stories are developed to drive business growth across your assigned vertical. You will also oversee the development of high quality, end-to-end custom research in order to uncover novel and actionable ideas that optimally position Google’s product offerings and drive business strategies.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/121316151675232966",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-05T17:01:48.268Z",
    "publish_date": "2019-03-05T17:01:48.268Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience in digital marketing, account planning, marketing research and/or consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience with managing first- and third-party research and tools.</li>\n<li>Demonstrated knowledge of search, social, mobile, display, video, audio and local spaces.</li>\n<li>Ability to see granular as well as big-picture issues.</li>\n<li>Excellent communication, project management, interpersonal and organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Apply your vertical marketing knowledge to drive incremental growth.</li>\n<li>Lead development of scalable sub-vertical narratives that enable success for your team in priority areas.</li>\n<li>Lead consumer-focused primary research programs to unlock new growth opportunities for the vertical.</li>\n<li>Advocate storytelling principles and high-quality visualization, enabling the vertical to elevate their customer conversations.</li>\n<li>Work closely with the SDM Lead and Industry Director to execute vertical engagement. Partner with the Head of Industries, Account Executives, and Analytical Leads to deliver on strategic goals.</li>\n</ul>",
    "title": "Sales Development Manager, Retail"
}