{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckb4UBRKHmqeMIcrdXmREI7t31h_jcI2UsmAT4iy3YdASOgASYQ8wfkCD4ome_sgrvRACt7-qvKVbIVkMkskhng-56xQUgEKZcFPVgX0igBUWYTwfs6g4D2H2WuE%3D_V2&jobTitle=Global+Process+Manager%2C+Flex+Payment+Operations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-23T20:31:38.716Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>Our mission is to design and implement global, scalable, and compliant payments operations. As a Global Process Manager, you will contribute creative problem-solver while focusing on creating excellent Googler experiences, proactively mitigating risk, and finding innovative and automated solutions to improve and standardize a complex sets of processes and systems. You will work to ensure the highest level of quality of our operations by setting the vision and partnering with key stakeholders in Engineering, Product, Finance, and Legal as well as collaborating externally with our outsourcing partners and banking institutions.\n</p>\n\n<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective, and efficient. We help our businesses scale effectively while enabling our fantastic product and services teams to grow. We design processes that work internationally while accommodating local needs and we provide rapid tactical and strategic responses to challenges, ensuring the positive impact is lasting. We take on new leadership opportunities every day and have the autonomy to identify and execute projects that will benefit Google for years to come.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5878649509150720",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-02-27T19:54:46.467Z",
    "publish_date": "2019-02-27T19:54:46.467Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Finance, Accounting, Operations, or equivalent practical experience.</li>\n<li>4 years of relevant work experience leading operations. and solving operational issues.</li>\n<li>Experience in project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>3 years of experience with accounting/finance ERP systems and business processes and related system controls.</li>\n<li>Experience with an outsourced service provider in operations, procure-to-pay, or other relevant area. Experience in Payments.</li>\n<li>Track record of successfully leading complex, global operational initiatives and system implementations in a cross-functional, fast-paced environment.</li>\n<li>Ability to manage complex escalations in a timely and efficient manner, effectively balancing business and technical risks.</li>\n<li>Excellent project management, problem-solving, and analytical skills. Excellent organizational skills and attention to detail with a bias for continuous improvement.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design, oversee, and execute the global payment release function while partnering closely with our stakeholders to understand and improve the end-to-end process.</li>\n<li>Manage Google’s global supplier payments operations executed by our Business Process Outsourcing (BPO) partner in onshore and offshore centers to deliver process excellence, focusing on efficiency, quality, controls, and compliance to local regulations.</li>\n<li>Analyze data-sets to identify, prioritize, and address risks and opportunities. Drive standardization and continuous improvement.</li>\n<li>Identify, implement, and measure process improvements that enhance and optimize the control environment, consolidate bespoke processes, and scale with growth partners, Business and Finance teams to identify and gather business requirements, design solutions, and implement end-to-end process improvements.</li>\n<li>Help create integrated system requirements, set priorities, determine constraints and dependencies, define timelines, allocate resources, write detailed functional and test specifications, evaluate design alternatives and implications on functionality, effort, performance and operations, and drive projects to completion\n\nAbility to lead RCAs, and drive process changes to address operational risks</li>\n</ul>",
    "title": "Global Process Manager, Flex Payment Operations"
}