{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXBgDV0kbc_2Mh01EppwpZHDZBPbmuA6Hlr6REHKDfESOgCPMA3TLFicPb-8SeZJNNLo4jamaxnt3frOQhkRbQaKQ_PrUzfCgRQvGXNOZlOnvZV6vXrqAVTbMHE%3D_V2&jobTitle=Program+Manager%2C+Business+Processes+Management&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-14T14:31:33.910Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>The Google Program Management Office ensures the delivery of highly effective end-to-end system and integrated process solutions to meet the goals and objectives of Google Global Delivery Operations. In this role, you are dedicated to program and project management and business/systems analysis in the area of Product Lifecycle and Technical Operations.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4668928048431104",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:50:42.579Z",
    "publish_date": "2019-02-27T19:46:06.594Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree or equivalent practical experience.</li><li>5 years of experience in a functional role in supply chain and outsourced manufacturing management.</li><li>5 years of program management experience.</li><li>Experience in manufacturing and fulfillment in high tech manufacturing operations.</li></ul><br><p>Preferred qualifications:</p><ul><li>5 years of experience in a functional role in supply chain and outsourced manufacturing management.</li><li>Developed project management skills and PMI project methodology.</li><li>Developed analytical capabilities and ability to visualize and manipulate data. Ability to work with multiple business constituencies, effectively manage their expectations and establish priorities.</li><li>Developed desktop application skills.</li><li>Demonstrated verbal and written communication skills. Developed presentation and consulting skills.</li></ul>",
    "responsibilities": "<ul><li>Identify, develop, and execute process improvement programs utilizing continuous improvement principles and/or LEAN/Six Sigma methodologies. Prioritize and lead complex process improvement programs across the organization in support of all departments and functional areas.</li><li>Drive process improvement projects and facilitate cross functional process improvement project teams ensuring deadlines and objectives are met. Work to enable the deployment of systems solutions and business processes within the organization.</li><li>Review, analyze, and evaluate business systems and processes as well as user needs. Document requirements, define scope and objectives, lead or support projects to address business strategies.</li><li>Lead the “as-is’ process flows, documenting testing scenarios, capturing day-in-the-life scenarios, validating that testing is executed and any defects logged, conducting readiness assessments, and aligning training curriculum as needed.</li><li>Conduct postmortem activities and drives closure of process gaps. Evaluate completed process improvement projects to identify and implement best practices and lessons learned. Drive KPI development, automation, tracking, and reporting.</li></ul>",
    "title": "Program Manager, Business Processes Management"
}