{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfnaSoIWrr0eVIjyWLu59jU0WJfj0kIdYPfj1hZxoB0SOgCPMA3TY7iHHBKyP-oehv4j42NEYhIaWjJmle-GuaWhWkZDNR1nOu_K7HwRd0YZxQWvFFelr_TWNX4%3D_V2&jobTitle=Manager%2C+Ads+Finance&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-20T14:31:27.109Z",
    "description": "<p>Financial Analysts ensure that Google makes sound financial decisions. As a Financial Analyst, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our leaders to make strategic company decisions. A master juggler working on multiple projects at a time, you are focused on the details while finding creative ways to take on big picture challenges.</p>\n\n<p>Ads Finance ensures that Google makes sound financial decisions. As a Finance Manager, your work, whether it&#39;s modeling business scenarios or tracking performance metrics, is used by our Sales leaders to make strategic decisions. You will find creative ways to tackle big-picture challenges and help shape Google’s business by leading the central team for Americas Ads Finance. You will be plugged into framing the strategic and competitive position on exec-level deliverables such as Target Setting, Planning, Quarterly Business Reviews, etc. and will partner effectively with various Global Sales Finance, Go To Market and other regional central teams.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5596481765703680",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T21:28:05.441Z",
    "publish_date": "2019-03-11T18:01:58.026Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Engineering, Computer Science, Mathematics, Economics, Finance, or equivalent practical experience.</li>\n<li>8 years of relevant work experience in management and strategy consulting, data analysis, or financial services with a focus on advertising and/or technology industries.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>9 years of relevant experience in finance, management consulting, corporate strategy or similar environment with a focus on advertising and/or technology industries.</li>\n<li>Analytical, financial modeling, FP&amp;A and/or project management experience with demonstrated process improvement.</li>\n<li>Experience in leading and developing teams.</li>\n<li>Ability to self-start and self-direct work in an unstructured environment. Ability to deal with ambiguity and a fast-paced environment.</li>\n<li>Distinctive problem solving and analysis skills, combined with impeccable business judgment and the ability to communicate with a senior management team.</li>\n<li>Demonstrated leadership, cross-functional communication and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive key processes that develop insights and analysis which support the Americas business and shape strategy, in partnership with Americas Sales leadership.</li>\n<li>Coordinate Americas Ads revenue budgeting and forecasting processes, working with product and sector finance teams, to ensure timely, accurate, and insightful reporting.</li>\n<li>Identify opportunities to improve Americas Ads Finance processes and lead efforts to scale best practices across the Americas.</li>\n<li>Interact with other Ads Finance, Go To Market and other regional central teams to assure strategic and analytical alignment, as well as data consistency and efficiency.</li>\n<li>Provide stakeholders with finance-based decision support for implementing new as well as maintaining existing products and processes, including project investment analysis, ongoing development and maintenance of metrics and analysis support of strategic planning activities.</li>\n</ul>",
    "title": "Manager, Ads Finance"
}