{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUIK5-OVL5JgImXMpNzolcPDPTeHDqRgLYrLT3hs82ASOgCPMA3TkOKwIIFarKn99c_oUwlAOCNFe0XLl5o5sK0TxJlB7LGcyA-9BDYmus6gDuosxKUJSs0UNbo%3D_V2&jobTitle=Account+Strategist%2C+Agency+Sales%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:03:12.303Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Google Customer Solutions sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer. We are dedicated to developing this expanding business in more than 40 languages globally and leveraging Google’s advertising solutions to make them successful online. In a scalable way, we are responsible for growing GCS Sales advertising growth by educating, providing solutions and consulting with agencies directly. GCS Sales team members are extremely proactive, motivated, team-oriented and enthusiastic about our fast-paced environment.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6085733049892864",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:41:17.004Z",
    "publish_date": "2019-02-27T19:41:17.004Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience</li>\n<li>2 years of experience in advertising, sales, marketing, consulting, or media.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to manage a sales portfolio, experience working against an assigned quota.</li>\n<li>Ability to employ sales techniques including: effective questioning, objection handling, competitive selling.</li>\n<li>Ability to develop thought leadership abilities and industry expertise. Ability to influence executive stakeholders.</li>\n<li>Ability to multi-task and manage multiple projects at a time while paying strict attention to detail.</li>\n<li>Expertise in managing digital advertising campaigns.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver against assigned quota, while prioritizing and delivering outstanding customer business experience to Google&#39;s advertisers.</li>\n<li>Implement creative ways to improve our Agency relationships, tailor and share performance-enhancing suggestions, and promote other Google products.</li>\n<li>Communicate with Agencies proactively, via phone and email.</li>\n<li>Provide strategic advice and help Agencies get the best ROI on their clients’ advertising investment by working closely with them in a consultative role.</li>\n</ul>",
    "title": "Account Strategist, Agency Sales, Google Customer Solutions"
}