{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVKM3gQyX8YtDWHiu7jn_AJiRAulfyArV-5r38LfkRcSOgASYQ8wDhbKs37s9-EEhnOipS9t6v_hnVFSADLAZYe2PecuZV1wHh1gAnDUvfJey4nyF5i0MyfSP0k%3D_V2&jobTitle=Sales+Development+Manager%2C+New+Business&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-18T22:01:56.234Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n\n<p>Our New Business Sales Development team works on ideas such as technological experiments and the expansion of existing businesses into new territories. We&#39;re a team of technologists, entrepreneurs and leaders with an eye for what&#39;s next, working across Google to develop products and ideas that revolutionize the way people connect with information.\n</p>\n\n\n<p>As a member of the New Business Sales Development team, you&#39;ll work as a thought leader to find, digest and share industry trends and key influencers. You&#39;ll open opportunities with potential partners/customers, understand their businesses and present opportunities to our executive leaders.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142779613202784966",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T22:01:56.234Z",
    "publish_date": "2019-03-18T22:01:56.234Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of relevant work experience.</li>\n<li>Experience in Sales Management and/or Sales Operations, managing metrics, incentives, tools, training and process improvements.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree.</li>\n<li>Experience managing Sales Temp Operations.</li>\n<li>SalesForce experience.</li>\n<li>Ability to navigate and operate in a complex, cross-functional environment.</li><li>Demonstrated product training, business partnering, and leadership abilities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Oversee a sales program across offices, responsible for delivering appointments between prospective new advertisers and New Business Sales Account Executives in the US.</li>\n<li>Facilitate lead generation and scalable workflows (quality and volume) across North America Marketing, Onboarding, Engineering, and Sales teams.</li>\n<li>Deliver training programs to new hires and New Business Associate Representatives. Manage a Trainer to support Global New Business Sales Development trainings.</li>\n<li>Execute processes to maximize productivity, including managing Temporary Representatives to support key potential customers.</li>\n</ul>",
    "title": "Sales Development Manager, New Business"
}