{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXQuxvYHa1mhAgJ9jVqL68uKLEi7t_xw4_4eamMZetESOQASYQ8wVLeA-8zJ5iTc382i0H_-BfhxTCCxrII8OckQzRT8RhvnZRna680bsTOJcvW_AuPtwES0KA%3D%3D_V2&jobTitle=Transportation+Analytics+and+Insights+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T09:31:32.831Z",
    "description": "<p>As a member of Google’s global Transportation Team, you play a key role in Google’s growth. You will be part of the team overseeing one of the largest corporate transportation programs, ensuring excellence in service delivery. You will lead our team&#39;s data management, forecasting, resourcing and initiative prioritization. With a mindset that data drives the decision-making, you will be responsible for quantifying potential impacts that help us identify and prioritize efforts to enhance transportation programs to enable future company growth. </p>\n\n<p>This role requires frequent interaction with multiple internal and external stakeholders in a fast-paced and highly collaborative environment. With a high volume of complex and time sensitive requests, you are someone who works well with teammates, senior leaders and other cross-functional colleagues. You are willing to pitch in on projects outside of your core role to advance the team’s goals.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/98377870453154502",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:47:44.763Z",
    "publish_date": "2019-02-27T19:47:44.763Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in City Planning, Economics, Business, a related field or equivalent practical experience.</li>\n<li>6 years of experience in qualitative and quantitative methods of data analysis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>Experience developing strategic plans for a growing organization.</li>\n<li>Knowledge of computer applications relative to business intelligence and transportation operations and planning activities, such as geographic information systems (GIS), data visualization (e.g. Tableau, Data Studio), and scripting languages (e.g. R, Python).</li>\n<li>Demonstrated ability to work calmly and collaboratively in fast-paced and ambiguous environments, maintaining good judgment and the ability to escalate appropriately.</li>\n<li>Ability to prioritize numerous initiatives and turn ideas/capabilities into effective initiatives that improve efficiencies.</li>\n<li>Detail-oriented and well organized with excellent written and verbal presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Assemble, organize and present relevant transportation data and metrics tracking. Make recommendations for strategic decision-making, business case making and return on investment analyses.</li>\n<li>Quantify local trip making and the percentage of commuters using each mode of transportation to identify the most effective opportunities to reduce congestion that will enable additional growth.</li>\n<li>Lead projects that solve for data related challenges. Develop prioritized long range transportation plans based on forecast headcount growth, including prioritization of operating and capital expenses, trip making goals, sustainability strategies and local traffic regulations.</li>\n<li>Research demographic, home location, commute behavior, transportation regulations and other data used to develop strategies for employee commuting behavior change.</li>\n<li>Present program data in user friendly, customizable and shareable dashboard tools working towards a unified and automated transportation dashboard that will support decision-making for each program, adding insights and recommended business decisions.</li>\n</ul>",
    "title": "Transportation Analytics and Insights Manager"
}