{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckf40aJynOe8UnCMOSx-07oiJhQyhi8pPhG8wEBxFUCcSOgASYQ8wub6OkUm0E5gRxdGAwzKz7fG7WvB1zb9hQHlU0zMqKgg2WXw4qQxp74nlPJ6TcbUHLEO2svQ%3D_V2&jobTitle=Program+Manager%2C+YouTube+Paid+Products+Support+%28English%29&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T11:31:36.319Z",
    "description": "<p>YouTube&#39;s user base is growing and changing, presenting unique challenges and opportunities to support over a billion monthly users globally. Fast-paced, dynamic, and proactive, the YouTube Support team provides seamless, brilliant support to our content creators, advertisers, and viewers on all platforms around the world. Our goal is to ensure users have easy access to comprehensive support when and where they need it, and to allow our users’ voices to help shape product solutions. <br><br>As a member of the Support team, you&#39;ll analyze top issues facing our users and content creators, work with cross-functional teams to resolve them, and help manage support operations. Whether directly engaging with our biggest creators, surfacing problems to our technical teams, driving analytical insights, or liaising with vendors to provide stellar support, you&#39;ll drive reach, satisfaction, and resolution — making YouTube an exceptional user experience for everyone.</p>\n\n\n<p>As a Program Manager on the YouTube Paid Products Support team, you will ensure that our agents have access to all of the information and processes that they need in order to address and resolve any user issues on YouTube paid products. You will also play an integral role in defining team workflow processes and developing the Process Excellence program; agents’ effectiveness and efficiency will be a direct reflection of your success. You will be in charge of building and maintaining our global internal resources used by vendor agents and internal partners to understand our products and resolve any customer issues quickly and effectively.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/99984454644048582",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T11:31:36.319Z",
    "publish_date": "2019-03-07T11:31:36.319Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>Experience in working independently and on multiple initiatives at the same time.</li>\n<li>Experience working effectively cross-functionally with a proven track record of achieving goals.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Project Management Professional (PMP) and Six Sigma/COPC Certification.</li>\n<li>Experience writing documentation (operational writing) for call center agents.</li>\n<li>Experience managing a Customer Relationship Management (CRM) program or Knowledge Base (KB).</li>\n<li>Experience with vendor management and/or vendor communications.</li>\n<li>Experience structuring content to be visually appealing and easily interpreted.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Audit all internal resources to ensure agent troubleshooting tools and documentation have accurate, current, and consistent content.</li>\n<li>Work with technical writers to create and maintain additional operational content for global call center agents.</li>\n<li>Manage agent knowledge bases, driving content improvements by collaborating with Product Support Leads and Product teams across YouTube and Google.</li>\n<li>Work alongside Product and User Support teams to prepare for product launches and process changes and to keep pace with product changes.</li>\n<li>Serve as a POC across Product/Engineering and User Support with a focus on product support strategy and prioritization as well as on user experience and support efficiency.</li>\n</ul>",
    "title": "Program Manager, YouTube Paid Products Support (English)"
}