{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaZ769C2gNkrNRmEMDrZSVNtGEEhNqzjBUwajOeoOJYSOgCPMA3TroJjdBK5bYz55LTqI25O_lPYWbd42TWgtM2XxpGworI6grC9vbjL_-dBNIHFu9HKoU_5Ahk%3D_V2&jobTitle=Global+Product+Lead%2C+Data+Platform+and+Cross+Product&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-13T22:31:52.828Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We are are focused on the unique needs of small and medium-sized businesses (SMB), which often serve an exclusively local audience.</p><p>As a Global Product Lead, you will partner closely with the Strategy and Operations team to determine the needs and priorities of the business. You’ll then partner with Engineering and Product Management to bring these ideas to life. Finally, you will work closely with business focussed teams to pilot, deploy, and continuously improving these systems. </p><p>Google helps millions of advertisers be successful in their businesses every year. Data Quality and Cross Product Integration is a key pillar for enabling our Sales teams and requires excellent coordination across Sales, Service, Marketing, and Product teams to work well around the world. In this role, you will focus on ensuring Sellers have all the tools and infrastructure needed for success, from customer relationship management (CRM) to machine learning(ML). You will work to create solutions that enable this critical function of the business.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6117015433314304",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-03-18T22:51:16.679Z",
    "publish_date": "2019-02-27T19:52:45.118Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in an quantitative field (e.g., Engineering, Computer Science, Mathematics, Physics, Statistics, Economics, Finance) or equivalent practical experience.</li>\n<li>5 years of experience in product management, management consulting, or equivalent project management experience in technology.</li><li>Experience with SQL queries and datasets.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of experience in product management and/or 2 years of experience in management consulting.</li>\n<li>Experience effectively influencing Product/Engineering teams, leadership, and cross-functional stakeholders.</li>\n<li>Experience handling large data sets using SQL. Passion for analyzing large, complex datasets and converting them into insights to drive decisions and</li>\n<li>Ability to define problems and identify potential solutions with excellent problem solving and analytical skills.</li>\n<li>Ability to clearly articulate business needs or challenges and identify clear solutions.</li>\n<li>Excellent presence, written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work directly with Product Management (PM) and Engineering to design, develop and launch improvements to the data infrastructure for CRM tool.</li>\n<li>Partner with Service and other organizations to build a holistic tool experiences for Sales.</li>\n</ul>",
    "title": "Global Product Lead, Data Platform and Cross Product"
}