{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTqmwj6bXjl2X88jw4Re-_EPyLZBSloclXH2qZC5WQ0SOgASYQ8wFunJ1KYvx9NVJ1hrjhLkGGFVUtLl7w0BWm4QP5g_YEH3imjbtU7xt_SKKPpkwPMuHuDjo_E%3D_V2&jobTitle=Partner+Enterprise+Project+Manager%2C+Cloud+Business+Transformation+Operations&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-06T15:31:42.145Z",
    "description": "<p>The Cloud Business Transformation Organization is responsible for programs that enable Google Cloud to go-to-market and be enterprise ready at Google scale. Our team partners with Product, Sales, Engineering and other cross-functional partners to develop systems, tools, and processes. We empower our sellers and channel partners with the tools and data they need to be more productive and successful. </p><p>The Partner Enterprise Project Manager will be responsible for the execution and coordination of an enterprise program focused on re-imagining business processes and systems across the Partner and Channel Ecosystem. The program is a collaboration between the Google Cloud business and IT teams, with a strong presence from systems implementation partners.</p><p>You will work directly with program leadership, business stakeholders, and various implementation teams to manage the execution of workstreams and deliverables for the program. You will be responsible for leading the coordination of multiple lifecycle workstreams, managing stakeholders, timelines and project communication.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/98367282016592582",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:58.408Z",
    "publish_date": "2019-02-27T19:54:58.408Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>5 years of experience in management consulting, corporate strategy, product/program/portfolio manager or equivalent practical experience</li><li>Experience analyzing data using database query (e.g. SQL), spreadsheet and statistical modeling.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience working on business systems focused projects in technology companies (cloud companies).</li><li>Experience working in fast paced, high-growth, and results orientated environment.</li><li>Conflict resolution and negotiations skills to resolve disagreements quickly and effectively; problem-solving attitude.</li><li>Ability to visualize and create high-level models (rigorous information-rich diagrams) that can be used in executive and leadership presentations.</li><li>Ability to succeed in a highly collaborative team environment with multiple in-flight initiatives and stakeholders.</li></ul>",
    "responsibilities": "<ul><li>Manage program effort across workstreams including Partner Relationship Management, Partner Operations, Partner Experience, Content Management, Partner Marketing and others.</li><li>Manage project, work stream dependencies and risks while optimizing for constraints. This includes monitoring the program status at every workstream level and aggregating this into program management level dashboards and reports.</li><li>Establish and lead working group meetings; create weekly project status and executive reporting, support regular program reviews with senior stakeholders from the business, technical and cross functional teams.</li><li>Establish metrics, templates and governance for the program including KPIs; track progress and dependencies.</li><li>Ensure the program is meeting business wide timelines, governance processes and audit requirements in a documented and traceable way.</li></ul>",
    "title": "Partner Enterprise Project Manager, Cloud Business Transformation Operations"
}