{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ_0S-eMC0Jm26T1YAsooAsbUkpjzMt1OaqrEAZLYTMSOgASYQ8w8sSGuV6jL0TxsSb0xp5yfuLp7VcHrP3zViKHhGuZxgYlXna7JIhX7pNAfpS5L6-jzmrQXlw%3D_V2&jobTitle=Product+Marketing+Manager%2C+Brand+Moments%2C+YouTube+Ads+Marketing&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-13T21:01:47.818Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>As a Product Marketing Manager, you&#39;re a creative thinker who is motivated to innovate and make an impact on a growing business and drive change across the media landscape for brand advertisers and agencies. </p><p>In this role, you will create experiences that bring to life the passion of the YouTube audience for our platform and advocate these experiences among brand marketers and leaders. You will work closely with cross-functional and global teams, including Product, Sales, PR, Events, and Research, making strategic decisions that change and influence the industry as a whole. You will think big and work effectively to drive change. From uncovering new insights, to performing competitive analysis and developing external communications, you will help position YouTube’s offering for our audiences.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/80020104206525126",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-13T21:01:47.818Z",
    "publish_date": "2019-03-13T21:01:47.818Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in a similar marketing manager role.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience developing customer insights and in-depth market analyses to guide a strategic approach and build compelling, impactful programs.</li>\n<li>Track record of leading impactful, cross-functional programs and the ability to deliver excellent and creative marketing achievements.</li>\n<li>Understanding of YouTube&#39;s strategic and competitive position and of online video advertising.</li>\n<li>Ability to manage growth, measure success, and work effectively in a fast-paced and changing environment.</li>\n<li>Ability to take initiative and demonstrated attention to detail. Excellent execution, problem-solving, resourcefulness, and organizational skills.</li>\n<li>Interest in continuously learning and growing as a marketer and a leader.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the program development and production of tentpole activations and delivery of marketing programs.</li>\n<li>Use innovative storytelling, research and a range of marketing assets (e.g., videos, installations, print collateral, etc.) to create content and high-touch experiences that inspire and influence advertisers.</li>\n<li>Synthesize customer and industry insights and market research to guide strategic decisions and program development. Measure, optimize, and evolve initiatives to deliver greater impact.</li>\n<li>Utilize a broad range of internal and external marketing channels to engage brands, agencies, and stakeholders.</li>\n<li>Collaborate closely with events, sales, product, marketing and research teams. Partner with global teams to scale best practices and resources.</li>\n</ul>",
    "title": "Product Marketing Manager, Brand Moments, YouTube Ads Marketing"
}