{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbFpSjaqOBIiGQdDobPn4DBndJIJpGAZhElNryuziVwSOgCPMA3T6SyrZP3Cek18mfTd5zYiHBNTWZj3GnsIpjqjpsY1ei5CljsfYK3EKAZrznNjHldGxP2tNhE%3D_V2&jobTitle=Accounting+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:34:09.707Z",
    "description": "<p>As Google drives toward audacious goals, we rely on our SEC Reporting and Technical Accounting team to know exactly what that growth looks like. Each month, quarter and year end, the team prepares the release of Google&#39;s financial statements to the Securities and Exchange Commission (SEC) and the public. Through your relationships with various internal sources, you efficiently gather financial information and oversee the process of preparing, reviewing, submitting and distributing the financial reports. But this role calls for more than just knowing the books -- you also provide equity and treasury research and analysis and review necessary statutory reports. You give expert advice to senior management on U.S. GAAP and SEC filings, and work closely with the Investor Relations team on sales and earnings press releases and reports that reach securities analysts, investors and industry groups globally.</p>\n\n\n<p>Equity Accounting is responsible for accounting and reporting at Alphabet. Our mission is to support Alphabet&#39;s growing and complex needs in all things Equity Accounting through our collective experience by providing valuable information and advice to our business partners.\n</p>\n\n\n<p>As an Accounting Analyst, you understand accounting principles and the full accounting process. In this role, you will prepare financial reports required by the Generally Accepted Accounting Principles (GAAP) and governmental regulations analyze and interpret financial reports. You will continuously looking for ways to help our team get better at what we do, in the most efficient way possible. Working as part of a team, you will collaborate with our global team, advocate best practices, and comfortably contribute when it&#39;s all hands on deck. You will maintain excellent attention to detail in a fast-paced environment and use your problem-solving skills to support Alphabet&#39;s business objectives.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6526516353761280",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:52:41.134Z",
    "publish_date": "2019-02-27T19:52:41.134Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of experience in public accounting and/or public multinational tech companies.</li>\n<li>Experience with 10-Q/10-K filings.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA.</li>\n<li>Understanding of large ERP systems.</li>\n<li>Knowledge of Securities and Exchange Commissions (SEC) reporting regulations.</li><li>Excellent project management, analytical, and written and verbal communication skills.</li>\n<li>Excellent interpersonal, organizational skills, attention to detail, and focus on continuous improvement.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Prepare required support for internal and external equity accounting monthly and quarterly close process, including stock-based compensation journal entries and support, support work papers and analyses, and earnings per share calculations.</li>\n<li>Draft equity portions of required disclosures, such as our 10-Q and 10-K disclosures, quarterly earnings releases, and related documents.</li>\n<li>Prepare compensation forecast.</li>\n</ul>",
    "title": "Accounting Analyst"
}