{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYZ1H4Xg74DSmpT8MQK9uFENIuB2wZ6lCfiZlAHdz_MSOQASYQ8wyMDv_bhOPJKFodwNmgCDqH7mw4DF44S2HtKb4bDV1NNQSNX8cLmEzL_YzbDahaFOMmJREQ%3D%3D_V2&jobTitle=Associate+Commercial%2FProduct+Counsel%2C+Marketing&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-20T20:01:52.041Z",
    "description": "<p>As Corporate Counsel at Google, you work on the most exciting legal issues as disruptive technological innovations require creative and proactive legal guidance. You&#39;re part of a whip-smart group of in-house lawyers and the projects and cases you take on challenge you to think big and differently. You are collaborative -- ready to partner in initiatives that influence all aspects of the business and work with Googlers from all over the company. As an integrated part of the team, you proactively assess legal risks and advise on products that will not only move information into the 21st century, but move information law forward as well.</p>\n\n\n<p>The Brand Marketing Legal team supports the Google&#39;s Brand and Reputation team and provides marketing specific legal support to Google&#39;s other Product Area Legal teams. In this role, you will support agreements negotiations and advise on all areas of legal risk, from project/campaign conception through launch.</p><p>20th century laws don&#39;t always solve 21st century problems, and Google Legal crafts innovative approaches for handling some of the toughest legal challenges of the information age. Whether you&#39;re a patent attorney, an intellectual property expert or an engineer headed to law school, Google Legal lets you take on unanswered legal quandaries and create new precedents. Our innovative services raise challenging questions that demand creative and practical answers. We provide those answers by working at the crossroads of the law and new technology, helping Google build innovative and important products for users around the world.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/85748553747440326",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:56:34.269Z",
    "publish_date": "2019-02-27T19:56:34.269Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Juris Doctor degree.</li>\n<li>4 years of relevant experience working with commercial agreements within a media, marketing, or entertainment company, or within an entertainment or media-focused law firm.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of work experience with media and entertainment commercial marketing agreements in a fast-paced media, marketing, or advertising company or law firm.</li>\n<li>Experience advising clients in structuring complex commercial transactions, including new media content and advertising agreements.</li>\n<li>Experience drafting licenses and intellectual property, advertising services, and sales agreements.</li>\n<li>Understanding of media and content license language and rights, copyright law, fair use, trademark law, and personality rights for the U.S.</li>\n<li>Knowledge of advertising law, including FTC regulations. Excellent analytical skills, especially as it relates to agreement interpretation.</li>\n<li>Ability to manage several simultaneous projects under deadline pressure, demonstrating excellent organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Review, draft, and manage co-marketing, media buying, licenses, intellectual property, advertising services, sponsorship, talent, and other agreements on a daily basis.</li>\n<li>Manage agreements that comply with company policies and risk tolerance.</li>\n<li>Respond promptly to legal requests from Marketing, Business Development, and other clients, summarizing and communicating legal concepts that business people can use.</li>\n<li>Advise business clients, HR, Finance, and other company colleagues, on legal issues and risks, complex agreement structures, approval processes, company policies and procedures, IP and business strategy. Support the continuous improvement of standard form agreements and legal processes.</li>\n<li>Ensure compliance with U.S. and international laws and regulations dealing with privacy and data protection, employment, and intellectual property.</li>\n</ul>",
    "title": "Associate Commercial/Product Counsel, Marketing"
}