{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcsyQYK-Qjg5749rn-2k5_5UCyl4buGKD-MzKlMCgM8SOgASYQ8wEk8Pe3Z9G82ogjFXb2MPNz6eRl2b8YwSNjEU1ooceKEj4MTdWAWNWXReSwTHg9MpCsE4DXs%3D_V2&jobTitle=Senior+Manager%2C+Government+Affairs+and+Public+Policy%2C+Information+Integrity&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-18T20:01:48.409Z",
    "description": "<p>As a member of Google’s Government Affairs and Public Policy team, you&#39;ll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual rigor with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You&#39;re passionate about the opportunity to shape the future of how we use and build technology for everyone.</p>\n\n\n<p>As a Senior Manager for Information Integrity, you&#39;ll help shape Google&#39;s policy efforts relating to the integrity of our goal to organize and make the world’s information universally available. You will coordinate with the global Policy team, business and product organizations, and cross-functional partners in Marketing, Legal, and PR to execute our policy strategy, develop our external narrative around policy challenges, and advise Product teams through the public policy lens. You&#39;ll develop, organize, manage, and communicate critical plans, initiatives, and strategy, while tracking various regulatory proposals and analyzing their potential impact on Google’s business.</p><p>Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.<br></p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/100430823347364550",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T20:02:02.312Z",
    "publish_date": "2019-03-19T20:02:02.312Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>14 years of experience working on technology policy issues within government, think tanks, public interest groups, or relevant industry associations.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working with international teams and a variety of stakeholders, and in executing strategies to deliver exceptional solutions.</li>\n<li>Experience successfully managing a team.</li>\n<li>Track record of executing cross-functional projects.</li>\n<li>Ability to exercise good judgment in a rapidly changing and sometimes stressful environment.</li>\n<li>Ability to identify opportunities and areas for improvement. Ability to lead and evaluate issues independently.</li>\n<li>Excellent political, analytical, and communication skills with high attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage directly with policymakers, industry players, and key opinion formers to shape policy and political dialogue. Monitor and research current and relevant emerging public policy issues.</li>\n<li>Work closely with Trust and Safety, Product, Engineering, and other teams across Google to advise on responsible research and product development.</li>\n<li>Harmonize a consistent set of principles to guide the company regarding information integrity across products and platforms.</li>\n<li>Develop position papers and programs to anticipate and shape the public debate regarding information integrity on the Internet.</li>\n</ul>",
    "title": "Senior Manager, Government Affairs and Public Policy, Information Integrity"
}