{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRvJThdfbyoLkFZtbrsWo7iBXRWW0OUqjT0lnOVW3PISOgASYQ8wedvWNesbKFyNSE2CoZ3uSZOM3yae6xDKUJRI2T6y2KgNOJqoHgvKHiQOKKgrpe1-Fi-AyHU%3D_V2&jobTitle=Partner+Technology+Manager%2C+Android+Updatability%2C+Android+Partner+Engineering&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-24T16:01:41.148Z",
    "description": "<p>As a Partner Technology Manager, you are responsible for providing technical solutions and managing relationships with Google&#39;s largest and most strategic online publishers. As a liaison between clients and our technical staff, you flawlessly lead deployments, implementations and integrations of a variety of our product lines (such as Search, Mobile, Video and Commerce). From monitoring product performance to debugging and troubleshooting product code, you are the resident expert that addresses partner needs. You are a technical expert with an entrepreneurial drive and passion for client management.</p>\n\n<p>The Android Partner Engineering team works closely with a varied set of partners across the globe on all aspects, including chipsets, devices, carriers, and customer support. The team works in a fast-paced, technology driven environment to align the strategic goals of Google and its partners with the goal of making Android the platform of choice.\n</p>\n\n<p>The Partner Engineering team has the unique position of working with multiple internal and external stakeholders. You will have the opportunity to work the boundary between chipset vendors, OEMs, ODMs and Carriers and participate in highly impactful activities that solves the problem of Android fragmentation.</p><p>Whether working with next-gen chipset manufacturers or emerging market telcos, Google&#39;s Android Partner Engineering team helps solve some of the toughest mobile technology problems. We work with teams throughout Google to develop solutions for strategic partners around the globe. We maintain crucial relationships with and build technical solutions for our long-term partners who are making Android into a world-changing platform. But we&#39;re just getting started.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6206848862552064",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:54:09.782Z",
    "publish_date": "2019-02-27T19:54:09.782Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Computer Engineering, a related technical field or equivalent practical experience.</li>\n<li>Experience working with computer languages (e.g., Java, C, Python) and Linux environment.</li>\n<li>Experience in a technical program management role.</li>\n<li>Experience in partner management and troubleshooting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of experience in the mobile/CE/embedded space, specifically working with Android.</li>\n<li>2 years of experience in dealing with multiple stakeholders and workstreams.</li>\n<li>Experience with Android, Linux kernel and Linux device drivers.</li>\n<li>Knowledge of community driven software development process.</li>\n<li>Demonstrated creative problem-solving approach and exceptional analytical skills.</li>\n<li>Excellent communication and project management skills, with a track record of handling multiple customers and streams of work.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage internal and external stakeholders, match internal schedules with external schedules and develop a solid, defensible plan for release and keep the team tracking to it.</li>\n<li>Oversee the creation of new processes and tools to support additional needs and requirements of a fast changing device ecosystem.</li>\n<li>Focus on improving the velocity with which teams react to external requests and maintain appropriate service level agreements on different workstreams.</li>\n<li>Manage communication of progress/status within the core team, internal partners and external partners. Escalate issues as necessary.</li>\n<li>Improve planning, execution and release processes, and scale up to handle multiple OEM and Carrier combinations. Partner with Engineering Leads to ensure proper staffing and prioritization.</li>\n</ul>",
    "title": "Partner Technology Manager, Android Updatability, Android Partner Engineering"
}