{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfKOFKmCMZLoD4iM2YCFZ7bDuw1myvSEoHXs-g65OSQSOgASYQ8w2ubm6gPKNfqkZfNjTMaUCnilUAxay_4zZNl5i_h69z0k2QE1SxUPxqXTMvi_DlfUKXmKl7o%3D_V2&jobTitle=Shopping+Sales+Specialist&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-25T21:01:58.298Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/101147448572814022",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-02-27T19:50:18.327Z",
    "publish_date": "2019-02-27T19:50:18.327Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>4 years of experience working in digital marketing sales.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience providing thought leadership and effectively leading discussions at C-Level/Director level.</li><li>Proficiency using shopping related tools and resources to manage shopping activation.</li><li>Understanding of retail industry metrics and KPIs, and features and benefits of Google Shopping products.</li><li>Ability to deliver insights from data to create business value and drive client action.</li><li>Effective communication, business planning, and consultation skills, and sales-driven motivation.</li></ul>",
    "responsibilities": "<ul><li>Become an expert in Shopping for Google products and the shopping ecosystem. Articulate features and value proposition of Product Listing Ads, Showcase ads, Co-op, and Merchandising Analytics, to drive adoption and client performance.</li><li>Manage Shopping business growth, including development of the quarterly forecast for a book of business, maintenance of pipeline and communication of updates to sales leadership.</li><li>Lead, drive and scale product launches, and partner with various stakeholders across the Americas Shopping team.</li><li>Drive in-quarter activations against product launches, lead lists and key shopping team priorities.</li><li>Educate and provide guidance on products and shopping best practices.</li></ul>",
    "title": "Shopping Sales Specialist"
}