{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU-xEhpdPnXGuXa1xof4xvxllsfpRVksQ_r-exJ3MuoSOgCPMA3TDd8FWlomhuEBtDdkTg74VDPAj_eTeXrvQoCq4_dUy0oYQu9w0uqBHK5eQNoNTf3D5wRoLaU%3D_V2&jobTitle=Operations+Insights+and+Impact+Analyst%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:06:38.917Z",
    "description": "<p>YouTube&#39;s Technology Solutions Organization is a global organization dedicated to developing and managing the company&#39;s largest and most strategic partnerships. We work closely with the YouTube product, engineering, and content teams to address our partners&#39; most pressing and complex technology challenges. As a Partner Technology Manager, you&#39;ll lead deployments, optimize implementations, and handle integrations to build strong, successful, long-term partnerships.</p>\n\n<p>As an Analyst, you&#39;ll help to identify top operational challenges, work with diverse cross-functional teams and guide business leadership on optimizing the effectiveness and efficiency of our partner-facing operations. You&#39;ll support business leaders with insightful, actionable analysis and by creating the tracking and impact measurement behind the business.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4972795354349568",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T00:31:59.680Z",
    "publish_date": "2019-03-07T00:31:59.680Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Data Science, Economics, Statistics, Business or Finance or equivalent practical experience.</li>\n<li>4 years of experience in operations analytics or business analytics.</li>\n<li>Experience in using relational databases for SQL queries, database definition and schema design.</li>\n<li>Experience with building and presenting operational dashboards.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with running operations management processes (sales and operations planning, demand/supply planning).</li>\n<li>Experience in strategy and consulting.</li>\n<li>Experience in marketing analytics, ROI, financial modeling and statistical analysis.</li>\n<li>Developed business fundamentals acumen and knowledge of video advertising business models.</li>\n<li>Ability to work independently on project deliverables in a fast-paced, ambiguous environment while working well in cross-functional teams. Developed project management skills.</li>\n<li>Excellent oral and written communication, interpersonal and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify opportunities to improve the operational performance for the Content Operations teams through insightful analysis of business metrics.</li>\n<li>Act as a thought leader in the creation of planning, strategy and key performance indicator (KPI) development for Operations teams. Make strategic and operational recommendations to achieve targets and operational excellence.</li>\n<li>Track the progress of reaching team KPIs and success metrics.</li>\n<li>Articulate and prioritize operations-related requirements for Content Tools and Business Data teams.</li>\n<li>Understand team workflows to drive operational improvements and achieve industry-leading support. Train stakeholders on tools and own data accuracy for relationship mapping.</li>\n</ul>",
    "title": "Operations Insights and Impact Analyst, YouTube"
}