{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVxRvxbKKpIoJZmIZN68mVm_dzaNwjylSXjDpYykWKUSOgASYQ8wMmcppQZUq7RSeYo_-gLy_0Oc8Dt22kzzW1yfU0raQOxj2VlzNWIdfyn70JjMdmXHA6IzuFQ%3D_V2&jobTitle=Strategic+Partnerships+and+Business+Development+Manager%2C+Google+Cloud+Talent+Platforms&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T17:01:51.383Z",
    "description": "<p>Google&#39;s line of products and services to clients never stops growing. Strategic Partner Managers have the rare opportunity to build a long-lasting relationship with our top partners. You cultivate these existing partnerships to make sure they can take full advantage of Google&#39;s ever-growing suite of offerings. You possess strong relationship-building skills and are apt to see mutually beneficial opportunities with partners in order to best represent our users, products and programs.</p>\n\n<p>Google Cloud Talent Solution is the first vertical-centric AI solution from Google, developed for the Talent Industry. We aspire to extend the reach of Cloud Talent Solution and ultimately play a role in every single online job-related transaction.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/73709375748743878",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-13T18:31:48.743Z",
    "publish_date": "2019-03-13T18:31:48.743Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of relevant work experience across the lifecycle of forming, growing and expanding channel partnerships.</li>\n<li>Experience in channel sales role, working with reseller and/or service partners.</li>\n<li>Experience working within the cloud space and with various cloud platforms.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working in a partnerships or business development role within technology and the talent industry.</li>\n<li>Experience in driving business strategies and initiatives with senior stakeholders.</li>\n<li>Ability to formulate and articulate contractual, technical, financial and value points with partners and internal Google team</li>\n<li>Ability to identify and evaluate new business opportunities, with a track record of successfully managing relationships and consulting contracts with external partners.</li>\n<li>Excellent problem-solving and analytical skills and impeccable business judgment; professional distinction in thought leadership and innovation</li>\n<li>Self-motivated, comfortable operating in a rapidly changing industry, and modeling and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a full-cycle business development process in a fast-paced environment.</li>\n<li>Create business opportunities by evaluating a market, and develop and cultivate deep relationships with partners, resellers, and industry leaders.</li>\n<li>Identify and vet customers and prospects for early access (alpha/beta) features and services.</li>\n<li>Design and deliver powerful capabilities and proposal presentations and subsequently pitch to prospective customers, building. aches to our products and enhancing Google&#39;s reputation as a consultant and partner.</li>\n<li>Work in close collaboration with Product, Marketing and Customer Success, Legal, Google Cloud Platform and other Google Product Areas to manage and identify strategic business opportunities.</li>\n</ul>",
    "title": "Strategic Partnerships and Business Development Manager, Google Cloud Talent Platforms"
}