{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckaCL2FtBaqkudeSDDib6NxTpvG2ZbDIWlmZrPubZaX0SOgASYQ8wVqHvwtxNK1TU5vQLoGMsF7AeRNhN3dTTFKnFwYCW66ohc2vCGS-FNq8J-SW4C3XZN6LTD-g%3D_V2&jobTitle=Product+Partnerships+Manager%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-14T17:02:13.046Z",
    "description": "<p>YouTube’s Product Partnerships team accelerates the global growth and innovation of YouTube products by driving new business opportunities through partnerships. We own the business side of new features, products and initiatives that are vital to the success of YouTube. As a team member, you understand the landscape of partnerships opportunities across technology licensing/integrations, marketing, and distribution. You will also craft strategies, define and structure critical partnerships, negotiate agreements, and cultivate our relationships.</p><p>The Trust and Safety team works to help YouTube grow responsibly. As a Product Partnerships Manager, you&#39;ll lead a team to drive, execute and maintain strategic partnerships that safeguard the YouTube experience by enhancing our existing tools, technology and intelligence. You’ll work closely with Product and Engineering teams to identify platform and content abuse and use outside expertise. You’re comfortable working with Engineering, Legal and Policy partners. You&#39;re thoughtful, strategic, analytically driven, and possess a global perspective. You thrive in a fast-paced, ever-evolving, team-oriented environment.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/114059705778610886",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T23:02:01.797Z",
    "publish_date": "2019-03-06T23:02:01.797Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of partnership development experience, identifying partners, structuring and negotiating agreements, and partner management. Experience with sensitive partnerships.</li>\n<li>4 years of experience working with Product, Engineering and Legal teams in a technology environment.</li>\n<li>3 years of people management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working in Trust and Safety or policy areas.</li>\n<li>Program management or consulting experience.</li>\n<li>Experience operating within and leading cross-functional initiatives across Product, Engineering, Legal, Policy, and Operations teams. Ability to understand organizational dynamics.</li>\n<li>Passion for and understanding of YouTube products, with the ability to quickly learn new technologies.</li>\n<li>Demonstrated problem-solving and collaboration skills, entrepreneurial, and creative, with attention to detail.</li>\n<li>Excellent interpersonal and communication skills to formulate and articulate technical, financial and business points with partners and internal teams. Comfort with escalating and presenting key issues to senior management.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Be a domain expert and thought leader in the Trust and Safety space. Define the vision, set strategy, and manage objectives and deliverables for the Partnerships program, including driving analysis to evaluate ROI and optimize partnerships.</li>\n<li>Develop and maintain strategic partnerships with external Trust and Safety experts, including sourcing partners, structuring and negotiating agreements, and partner management.</li>\n<li>Set cadence and communication channels for program activities to the cross-functional organization. Present key updates to senior leadership.</li>\n<li>Lead cross-functionally to gain buy-in for the program and partnerships, including problem-solving legal, policy, business, operational and technical complexities. Secure budget, and collaborate with other Google teams.</li>\n<li>Manage and develop a team of direct reports.</li>\n</ul>",
    "title": "Product Partnerships Manager, Trust and Safety, YouTube"
}