{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYfvhhnntj-iHB4WtfntJVingmONlvQSbfE7TQUFHm8SOgCPMA3TZ3kj9R5dlSsQJ08_V7e4Gdpgvbnn8u8kHJvsyVi240u1BoP0-LFLE1ME5G-7N9hMsNch7qI%3D_V2&jobTitle=Enforcement+Detection+Analyst%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-20T14:31:26.573Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p>\n\n\n<p>As an Enforcement Detection Analyst on the YouTube Trust and Safety team, you will be directly responsible for ensuring that we effectively identify and remove disruptive content and users as quickly as possible, in an environment where hundreds of hours of new content is uploaded every minute, globally.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6600955384758272",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:00.260Z",
    "publish_date": "2019-03-07T01:32:00.260Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Masters of Science degree in Engineering, Computer Science, Mathematics, Statistics, related technical field or equivalent practical experience.</li>\n<li>Experience with machine learning, programming (Python, Java), database querying (SQL) and statistics.</li>\n<li>Experience with creating metrics to measure performance of models, building dashboards, and reporting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience or demonstrated interest in content policy and/or anti-abuse operations at scale.</li>\n<li>Ability to work with a variety of stakeholders to gather requirements, explain models and iterate to make improvements.</li>\n<li>Developed problem-solving and analytical abilities with a proven history of going above and beyond to make operational improvements and solve tough problems.</li>\n<li>Demonstrated written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and implement strategies and solutions to enforce YouTube content policies at scale. Leverage Machine Learning, as appropriate.</li>\n<li>Deliver improvements to our performance metrics based on deep understanding of drivers of operations. Leverage deep programming skills to ensure that solutions fit within the current complex Product and backend infrastructures.</li>\n<li>Work closely with the Policy and Operations teams to understand the ever-changing policy enforcement landscape, and with Engineering teams to develop and test new features that address operational needs.</li>\n<li>Provide rapid incident response for abuse problems, operating independently. Analyze and draw conclusions on root-causes and define and implement mitigation steps.</li>\n</ul>",
    "title": "Enforcement Detection Analyst, Trust and Safety, YouTube"
}