{
    "application_instruction": "<b>Note: This role requires regular work attendance on a consistent basis to ensure coverage as well as to be available to build relationships with children and families, to work on developing and implementing a curriculum, to assess children&#39;s growth, etc. Attendance must not only be daily, but on-time each day and covering the full school day.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQDzMUsK-XPps77RaQ1REwuzJdZTzG-pCdwryNpCvQsSOQCPMA3T61yERcJQGfbFFijJOKi3Z59tHvgmE7w82X9i7ZRZXYmZVxQwRdgAGzSesgTwSoNL6hi5Rg%3D%3D_V2&jobTitle=Google+Childrens+Center+Teacher&loc=US",
    "categories": [
        "PEOPLEOPS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-09T04:01:40.861Z",
    "description": "<p>The Benefits Child Care team is a pioneer in the world of childhood development. As a member of this team, you&#39;ll strive to instill the same love of learning and creativity in the minds of Googlers&#39; children as can be found among the Googlers we hire. In the unique educational environment of Google&#39;s children&#39;s centers, you&#39;ll work with both your team and Google parents to continually develop and improve our Employee Child Development program to meet the physical, cognitive, social and emotional needs of children ages 3 months through 5 years. You&#39;re passionate about each child&#39;s personal growth and open to new and innovative methods of teaching, and are familiar with family-focused education that integrates play-based philosophies into the curriculum.</p><p>The value Google places on our employees knows no bounds. We revolutionized search, and now we&#39;re redefining human resources to make sure we have the healthiest, happiest and most productive employees in the world. We believe it&#39;s important to provide benefits to our employees&#39; children as well.<br>We&#39;ve developed our Employee Child Development program by building high-quality children&#39;s centers located near our corporate headquarters. These family-focused centers integrate play-based philosophies into the curriculum. This program includes small group size and staff continuity, and is designed to meet the physical, cognitive, social, and emotional needs of children ages 3 months through 5 years.</p>",
    "education_levels": [
        "ASSOCIATES_OR_EQUIVALENT",
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5597801066463232",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:28:06.158Z",
    "publish_date": "2019-02-27T19:38:42.402Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>12 early childhood education units California Associate Teacher Child Development Permit or eligibility for permit.</li>\n<li>1-year of teaching experience with children ages 3 months to 3 years for Infant/Toddler Teachers and with children ages 3 years to 5 years for Preschool Teachers. Experience working with children ranging from 4 months through 6 years of age.</li>\n<li>Experience with play based curriculum.</li>\n<li>Physical ability to interact with children, including not limited to: picking up children weighing 40 lbs, for example to change diapers or pick up a hurt child, standing for long periods, as well as being able to supervise children, climbing or moving around on the playground equipment to help a child or children squatting, kneeling and sitting (to be at the child&#39;s level) for short and long periods to allow communication with the children in an effective manner, intervening as needed if children are in a dangerous situation or having a difficult interaction with another child.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>AA/AS/BA/BS degree in early childhood education or related field</li>\n<li>California Master Teacher Child Development Permit or California Teacher Child Development Permit</li>\n<li>2 years of teaching experience with children ages 3 months to 3 years for Infant/Toddler Teachers and with children ages 3 years to 5 years for Preschool.</li>\n<li>3 Infant/Toddler Child Development units</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide responsive, relationship-based care and create a stimulating environment for children. Develop creative and age appropriate activities based on child&#39;s interests.</li>\n<li>Build and nurture partnerships with parents, including parent communication and involvement. Create a nurturing environment for play and exploration for children.</li>\n<li>Work in a collaborative relationship with other staff in classroom and with management team.</li>\n<li>Perform regular maintenance/cleaning tasks e.g. arranging the classroom and the yard each evening and each morning, moving light weight furniture, picking up toys, picking up boxes, emptying the contents, breaking down boxes.</li>\n<li>Adhere to procedures related to supervision, boundaries and safety of children at all times. Follow mandated reporting requirements as stated by CA licensing and best practices.</li>\n</ul>",
    "title": "Google Childrens Center Teacher"
}