{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfiPMrxhJk9nc8R51ywQFD_r3e1oXRNsSC3aMsq_EtUSOgASYQ8wn-HxCpiokGPzfnxG0vWYQIJLEnu76UHR1hzCIChc3kX5iM_yBY9g9srJ_QmP3gCI8h7d4JM%3D_V2&jobTitle=Policy+Specialist%2C+Ads%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-04T21:02:16.292Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n<p>Our team works cross-functionally and globally. We are driven by our focus on the user and passion for using our technical, legal, business, and policy experience to improve Google&#39;s policies and user experience. We advise Google on core principles and drive and manage complex projects.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/142732926237188806",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:43:39.850Z",
    "publish_date": "2019-02-27T19:43:39.850Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in broad policy within the technology, handling policy issues affecting the internet, such as the intellectual property, free expression, and online safety.</li>\n<li>Experience working with cross-functional stakeholders.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree.</li>\n<li>Experience using data and technology to solve complex business challenges and the ability to use judgment even in a crisis.</li>\n<li>Ability to translate complex issues into simple, clear language.</li>\n<li>Excellent problem-solving, analytical, leadership, organization, interpersonal, and teamwork skills.</li>\n<li>Excellent verbal and written, editorial, communication, and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Serve as a member of the policy team responsible for developing, implementing, and enforcing scalable Google Ads advertising and content policies. Innovate process and best practices for implementing policies across operation centers in multiple geographies.</li>\n<li>Manage and resolve escalations from internal and external parties (e.g., Sales, Legal, PR) and identify escalation patterns and trends to provide feedback on systems/tools process in and increase automation. Drive awareness and understanding of content and advertising policies across the company.</li>\n<li>Identify gaps or conflicts in existing policy framework, develop scalable solutions, and work towards consensus across the organization.</li>\n<li>Collaborate with Product Managers, Trust and Safety (T&amp;S) teams, and Engineering to influence product decisions and prioritization, and to improve user experience for policy-related issues.</li>\n</ul>",
    "title": "Policy Specialist, Ads, Trust and Safety"
}