{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckclMU06JyNKOgwoE5uupjc46sJTQWTALqpGJcTLY-pwSOgCPMA3TgdKzoIILAX8ksh-BMv_XohYS8YOyUK9XspTjk7KBatWGQlnXQ-zpMoSqatND2y4W8CFD9Go%3D_V2&jobTitle=Global+Content+Policy+Lead%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-11-26T22:02:02.480Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>As the Trust and Safety Global Content Policy Lead, you’re a natural at context switching, wearing multiple hats, taking initiative, and aligning colleagues around shared goals. You will seamlessly switch between developing global policies for YouTube content, briefing regional leaders and partners on the latest policy reform efforts facing YouTube today, and driving cross-functional projects impacting the global ecosystem. You&#39;ll act as a bridge by helping in-region leaders and stakeholders better navigate our global policies and priorities.</p><p>The Trust and Safety team helps YouTube grow responsibly. We&#39;re dedicated to supporting the growing base of users and partners around the globe, and providing them with the highest levels of service. Our team members are proactive, motivated, thoughtful, organized, possess a global perspective and are able to work well in a fast-paced, team-oriented environment.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5936361366552576",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-05T18:01:53.762Z",
    "publish_date": "2019-03-05T18:01:53.762Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of experience in drafting or enforcing policy for an online platform or engagement with online public policy issues.</li>\n<li>Experience working with global teams and communicating with stakeholders cross-functionally.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience working internationally in the online platform space.</li>\n<li>Ability to identify trends from user data.</li>\n<li>Advanced negotiation, collaboration, and presentation skills.</li>\n<li>Ability to speak and write in more than one language fluently and idiomatically.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop, maintain, and update our global policies in various areas of online content.</li>\n<li>Influence cross-functional stakeholders and company executives regarding proposed content policy efforts.</li>\n<li>Lead research for developing new policies and understanding emerging risks as well as trainings.</li>\n<li>Work closely with global teams to ensure effective operationalization of global policies.</li>\n<li>Build and develop partnerships with partners across cross-functional groups including Public Policy, PR, Legal, Product, Engineering, and Sales. Understand and clearly communicate the challenges and needs presented by the latest trends globally.</li>\n</ul>",
    "title": "Global Content Policy Lead, Trust and Safety, YouTube"
}