{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTicMwxJr3x73LONj8_Y8cIyxWnsSaV_OOjb3dKVvkISOgASYQ8wXhfnguNoK0HrDqvmKOxBOl-6r0NdoFzuE5gjICU-CN0A3P5VTTEzb5Fy7t0bIZol42JyEbc%3D_V2&jobTitle=Strategic+Technology+Partner+Marketing+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-08T14:01:57.172Z",
    "description": "<p>Google is developing groundbreaking cloud solutions for companies, leveraging years of experience in building secure, reliable, and scalable cloud technology. With excellent Google differentiation in data analytics and machine learning, security, application development and collaboration software, we’re well on our way -- but we need more people who can help us write and tell that story. If you’re as excited about building what’s next as we are, Google Cloud is the place for you.</p>\n\n\n<p>As a Partner Marketing Manager, you’ll craft integrated marketing campaigns with our technology partners. You will manage multiple projects simultaneously and drive them to completion. You&#39;ll develop working relationships and interactions with partners, customers, C-level leaders, business growth leads and Product and Marketing groups.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/139774968704443078",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-08T14:01:57.172Z",
    "publish_date": "2019-03-08T14:01:57.172Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Marketing, related field or equivalent practical experience.</li>\n<li>7 years of experience working in technology or software marketing.</li>\n<li>Experience in building creative assets and marketing content.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in marketing with a focus on any of the following areas; cloud computing enterprise software, virtualization, application development, containers, developer-oriented products, analytics, artificial intelligence, machine learning, security or infrastructure.</li>\n<li>Experience in planning and executing multiple, complex marketing programs including marketing campaigns.</li>\n<li>Demonstrated ability as a product or technology advocate, with the ability to collaborate with Engineering and Marketing teams.</li>\n<li>Excellent analytical and organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Operationalize the Go-to-Market and joint marketing strategies with a focus on technology partners.</li>\n<li>Create content (e.g. customer stories and videos), solution datasheets and whitepapers. Manage communications and announcements with PR teams for in-person events.</li>\n<li>Work with Product Marketing, Product and Engineering teams and partners to drive awareness of our joint solutions and further business growth.</li>\n<li>Set key performance indicators (KPIs), pipeline and measure ROI to ensure the success of ongoing campaigns and marketing activities.</li>\n<li>Monitor and evolve strategic partner co-marketing plans and requests. Develop overall positioning, messaging, storytelling and strategic plans for joint marketing campaigns.</li>\n</ul>",
    "title": "Strategic Technology Partner Marketing Manager, Google Cloud"
}