{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbOfEODFA8lVMMxXnUMCKmOQ0k_RZUI56Dh94PFA82QSOgCPMA3TFDTJlCDyrfpDGICHc1bYD01cIfnUa4YLBiiuuxzP1GLmqTuki6TgbhUHtLPXaQ_Bb45aVEA%3D_V2&jobTitle=Business+Analyst%2C+Sales+Strategy+and+Operations%2C+Google+Cloud&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-11T16:31:35.205Z",
    "description": "<p>As part of Google Cloud Sales Operations, you will partner with sales leadership to provide actionable insights and use a data-driven approach to sharpen decision making and drive deep understanding of our fast growing business.</p><p>In this role, you&#39;ll combine your analytical skills and business sense to help drive and develop the performance and strategy of our Google Cloud business and ensure rapid and long-term sustainable growth of our Google Cloud offering. </p><p>You&#39;ll focus on shaping short-term and long-term vision and trajectory for the business, through business planning and setting targets and key results. You&#39;ll partner with leadership to run a regular business review cadence and other processes to keep the business on track with goals. You&#39;ll deliver insights and targeted action plans, address specific areas of risk and opportunity, work cross-functionally and leverage the support of global teams for analysis and data. Lastly, you&#39;ll enable the regional teams with at-scale insights, analysis, and processes and tools providing thought leadership and input into global projects.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5739682184232960",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:19.806Z",
    "publish_date": "2019-02-27T19:54:19.806Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>3 years of experience in strategic planning, consulting, investment banking, or similar data-driven business roles.</li><li>Experience with SQL and other database, scripting, or business intelligence tools.</li><li>Ability to speak and write in English fluently and idiomatically.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA or Master&#39;s degree in relevant field.</li><li>Ability to create and foster cross-functional networks and manage without authority.</li><li>Self-starter who can work in an unstructured environment. Ability to navigate ambiguity and bring clarity and structure.</li><li>Demonstrated analytical skills, combined with business judgment and ability to influence business leadership.</li><li>Excellent leadership and influencing skills.</li><li>Excellent communication skills, with the ability to construct simple and impactful messages from complex analysis.</li></ul>",
    "responsibilities": "<ul>\n<li>Provide thoughtful leadership and influence executive-level decision making through deep analytical insight into core business decisions such as prioritization of growth opportunities.</li>\n<li>Structure and communicate complex, ambiguous, and challenging business issues to advise for the Google Cloud Sales leadership team.</li>\n<li>Build a network across Sales, Operations, Business Intelligence, and Finance, both in partnership and across teams, to resolve a range of analytical and operational questions.</li>\n<li>Leverage Google’s big data to drive scalable analysis of business growth drivers and trends.</li>\n<li>Craft and present quantitative analyses to translate complex data into actionable insights.</li>\n</ul>",
    "title": "Business Analyst, Sales Strategy and Operations, Google Cloud"
}