{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYg4vdsGCaHzkiufyVZjyq5gSUuSI2wNLpm0xnmd9C4SOgCPMA3TrEC1HwnXp2rZuwdWS27o7XUteqaiNvRCjEHkhOvLU3vpAWVtbX54MGtCOv2fNKEsLSelc4s%3D_V2&jobTitle=Payments+Partner+Manager&loc=US",
    "categories": [
        "FINANCE",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:27.365Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.</p>\n\n<p>Join us as we prioritize, create and execute programs to drive growth platform improvements supporting Google&#39;s ambitious global innovation agenda - like the Play store, Google Fiber, Google for Work, and Hardware - just to name a few.\n</p>\n\n<p>As a Payments Partner Manager on our Vendor Strategy team, you will be working with Finance, Legal, Product, and Engineering teams to locate, develop relationships, and manage performance of our third party solutions supporting fraud mitigation and customer vetting compliance processes. \n</p>\n\n<p>You&#39;ll manage these partnerships, and work with appropriate cross-functional teams on developing a third-party solution strategy to augment our existing customer vetting and fraud mitigation processes maximizing our customer experience whilst ensuring we minimize fraud losses and maintain legal and industry-standard levels of compliance.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5273955642572800",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:11:56.717Z",
    "publish_date": "2019-03-06T09:01:42.503Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of work experience in the electronic payments industry with focus on compliance, fraud management and/or payments.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Demonstrated ability to autonomously drive and prioritize multiple initiatives alongside Product and Engineering teams.</li>\n<li>Demonstrated ability to manage complex escalations in a timely and efficient manner, effectively balancing business and technical risks.</li>\n<li>Detail-oriented, with effective analytical skills to manage the large volumes of data to help produce management, operations and financial insights.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with Google’s Payments Compliance, Product Management, and Engineering teams to develop a third-party solution strategy to enhance our global customer vetting and fraud mitigation processes and systems and locate the best vendors to implement the strategy.</li>\n<li>Become the centra contact for vendor discussions and contracting between various Product, Engineering and Compliance teams.</li>\n<li>Lead market research, RFI, RFP, consultation and reverse auctions for selecting appropriate vendors and partner with appropriate cross functional teams to onboard vendors for optimal performance.</li>\n<li>Be the ultimate point of contact and leader for resolving complex vendor escalations; Organize and manage vendor audits and third-party compliance requirements.</li>\n<li>Drive vendor performance and system improvements based on scorecards, metrics/assessments, manage contractual and licensing compliance requirements with vendors and manage timely and organized cross functional vendor audits.</li>\n</ul>",
    "title": "Payments Partner Manager"
}