{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUxNpgWd0e8ZNugr3LrNce_7zoJxt7FmRaNzuEqWydESOgASYQ8w-IGjuz4zn8hY9tydi44ab0DCow4Bvstp0PoVsJpvyIhxTkDb8U1hvYfHbW4JRtoCAd6oe-k%3D_V2&jobTitle=Manager%2C+Global+Business+Organization%2C+Go-to-Market+Policy&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-12T14:01:38.154Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Go-to-Market (GtM) Operations organization is a global team that serves as the strategy, operations and product commercialization partner to the Sales, Service and Partnerships leadership.This role is part of the broader GtM Global Strategy and Operations team. The team typically engages on projects and work streams that impact multiple areas of Google’s business. We are integral partners to both our counterparts embedded within business lines, and to executives across Google’s business organization. We are focused on delivering insights and impact throughout our work.\n</p>\n\n<p>As a Manager, you will lead strategic projects across GBO which lead GBO’s thinking across policy decisions and implementation, and work closely with Product Management, Engineering, Trust and Safety and gPTO. As part of this role, you&#39;ll manage a team within GtM, collaborate with your counterparts in the various business lines and present to executives within Google more broadly.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/88248925867123398",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:56:08.232Z",
    "publish_date": "2019-02-27T19:56:08.232Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>8 years of relevant work experience in consulting.</li>\n<li>Experience working in software, internet and/or media industries.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience leading complex operational and strategic initiatives.</li>\n<li>Experience with Policy, Risk and/or Legal issues within Ads or Tech industries.</li>\n<li>Distinctive problem-solving and analysis skills, combined with strong business judgment.</li>\n<li>Excellent communication skills, both written and oral; ability to present to executives and communicate with a highly technical management team.</li>\n<li>Excellent relationship building, collaboration, project and product management, and analytical skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with cross-functional leadership to define, launch, and drive policy initiatives.</li>\n<li>Structure and execute operational and strategic initiatives by developing work plans, gathering and synthesizing relevant data, leading analyses and developing final recommendations.</li>\n<li>Lead cross-functional, global teams to get work done.</li>\n<li>Communicate findings to management and to the broader organization.</li>\n<li>Drive recommendations through to implementation and results.</li>\n</ul>",
    "title": "Manager, Global Business Organization, Go-to-Market Policy"
}