{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckb4vZYPWR_FhONwCzEhA7UY2v1Ggpzsv8XvXg-syXegSOgCPMA3TP6zEYFj4ALpP7-lZ9RVi211sOZaRIAt2fCztVzhCQpLU-3M7jJ9KUjuuaSfVxBIHuxF6t4o%3D_V2&jobTitle=Architectural+Modelling+Engineer%2C+Hardware&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T23:02:16.484Z",
    "description": "<p>Our computational challenges are so big, complex and unique we can&#39;t just purchase off-the-shelf hardware, we&#39;ve got to make it ourselves. Your team designs and builds the hardware, software and networking technologies that power all of Google&#39;s services. As a Hardware Engineer, you design and build the systems that are the heart of the world&#39;s largest and most powerful computing infrastructure. You develop from the lowest levels of circuit design to large system design and see those systems all the way through to high volume manufacturing. Your work has the potential to shape the machinery that goes into our cutting-edge data centers affecting millions of Google users.</p>\n\n<p>Developing an Accelerator ASIC is a complex task that requires an understanding of Software workloads, pain points in execution, and effective partitioning of the workload between a general purpose machine and a hardware accelerator. To estimate the benefits of hardware acceleration, an abstracted model of the accelerator, expressed in a higher level programming language is essential. \n</p>\n\n<p>As a Architectural Modelling Engineer, you will work with Software and Chip architects to establish the parameters and features which need to be modelled to provide a high level view of the behaviour of the Accelerator. You will work with the team to build this model, and use the model for architectural exploration to help define the Accelerator.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6744981404581888",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T23:11:37.493Z",
    "publish_date": "2019-02-27T19:45:56.404Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>MS degree in Computer Architecture, or equivalent practical experience.</li>\n<li>Experience applying computer architecture principles.</li>\n<li>Experience in a programming language (e.g. C++, Python).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with design of digital logic at the Register Transfer Level (RTL) using Verilog.</li>\n<li>Experience in Hardware/Software Codesign.</li>\n<li>Experience in architectural modelling of memory subsystems.</li>\n<li>Knowledge of processor design and/or accelerator designs.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with Software and ASIC architects to develop an architectural model for a Hardware Accelerator.</li>\n<li>Contribute to infrastructure development to run relevant workloads on the architectural model.</li>\n<li>Interpret results, explore architectural space and make recommendations to Chip/Software Architects.</li>\n<li>Correlate observed results from Silicon with Architectural model and refine/calibrate model.</li>\n<li>Work closely with Software and Hardware teams on functionality, interfaces, and documentation.</li>\n</ul>",
    "title": "Architectural Modelling Engineer, Hardware"
}