{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXBB1NGcrCY6DV_cPLAWBggz9gPLtph4563GKhIQac4SOgASYQ8wsw22oMaWi_FzzsqUESDTFtlXoPySxuHiNth03nSN8hMb654NG7QfnBhFZysn0LpE85Hgijw%3D_V2&jobTitle=Retail+Producer%2C+Marketing%2C+Pixel&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T03:31:51.185Z",
    "description": "<p>Our marketing campaign projects, like our users, span the globe and require managers to keep the big picture in focus. As part of the Global Marketing team, you plan requirements with internal customers and/or external agencies and usher projects through the entire project lifecycle. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Retail Producer, you will provide strategic program management and executional leadership for Google&#39;s Retail Marketing team. Your key responsibilities will include execution of global retail creative initiatives, product launches and campaign refreshes. You’ll work collaboratively with cross-functional, regional and country teams on strategy alignment, go-to-market planning and execution across the various programs. Our team brings the Google brand and hardware devices to life in retail around the globe. We’re a dynamic team of go-to-market specialists, retail advocates, partner marketers, experience designers, demo experience experts, production managers and producers whose mission is to fundamentally change how people discover and explore Google products.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87948838112764614",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-12T14:31:53.312Z",
    "publish_date": "2019-03-12T14:31:53.312Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>6 years of experience in managing retail creative development and execution.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience developing product campaigns and experiences for third party retail environments.</li>\n<li>Proven ability to navigate ambiguity and thrive in a fast-paced, deadline-driven, technical work environment.</li>\n<li>Team and relationship focused, with a proven ability to proactively establish rapport, credibility and influence.</li>\n<li>Ability to balance creative, product, retail and brand considerations with an analytical and disciplined approach to marketing.</li>\n<li>Demonstrated creative thinking skills, with the ability to identify solutions that work for multiple stakeholders.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead retail project processes, including timeline management, budget management, agency/vendor management, cross-functional partnerships, regional partnerships, stakeholder reviews and production hand-off.</li>\n<li>Lead internal creative teams and/or agency partners to deliver excellent creative experiences, across design, product, visual merchandising, graphics and signage. Ensure that teams consider customer experience, retail presence and brand integrity in every decision, and continue to push for innovative designs.</li>\n<li>Anticipate and manage project complexities and set up the Retail Creative team for success.</li>\n<li>Establish and manage cross-functional business relationships with multiple teams, including Marketing, Creative, Production, Training, Analytics, Legal, Finance and Operations teams.</li>\n</ul>",
    "title": "Retail Producer, Marketing, Pixel"
}