{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSzkvpqYnpwJvgv4J2UwV-UVyJjshBr3uZ5iT9msMPoSOgCPMA3TYe4lHRNd0P8VXvSUTrpbWRO72OdQx64DGlF29JGjfI6C9CABrlXQ_rXbnqbTcK2WdBJRR_0%3D_V2&jobTitle=Engineering+Manager%2C+Site+Reliability+Engineering&loc=US",
    "categories": [
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T23:01:39.714Z",
    "description": "<p>As an Engineering Manager, you will lead a <a href=\"https://careers.google.com/stories/site-reliability-engineering-profile-google/\">team of talented individuals</a> and will be responsible for some of the largest products in the world. SRE Managers not only have the technical chops to roll up their sleeves and provide technical leadership to major projects, but also empower and develop their teams to do the same. You will advocate and act as a subject matter expert for Google’s infrastructure within your product area using communication to manage a variety of global initiatives.\n</p>\n\n<p>SRE&#39;s culture of diversity, intellectual curiosity, problem solving, and openness is key to its success. Our organization brings together people with a wide variety of backgrounds, experiences, and perspectives. We encourage them to collaborate, think big, and take risks in a blame-free environment. We promote self-direction to work on meaningful projects, while we also strive to provide the support and mentorship needed to learn and grow. We&#39;re proud to be our engineers&#39; engineers and love taking things apart so we can rebuild them.</p><p><a href=\"https://landing.google.com/sre/book.html\">Site Reliability Engineering</a> (SRE) is an engineering discipline that combines software and systems engineering to build and run large-scale, massively distributed, fault-tolerant systems. SRE ensures that Google&#39;s internally critical and externally visible systems have reliability and uptime appropriate to users&#39; needs and a fast rate of improvement while keeping an ever-watchful eye on capacity and performance. SRE is a mindset and a set of engineering approaches focused on optimizing existing systems, building infrastructure, and eliminating work through automation.\n</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5576082399100928",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:26:56.675Z",
    "publish_date": "2019-02-27T19:39:17.374Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree in Computer Science or related technical field, or equivalent practical experience.</li><li>Experience in software development in one or more of the following: C, C++, Java, Go and/or Perl, Python, Ruby.</li><li>Experience managing an engineering team on large-scale projects with technical deep-dives into code, networking, operating systems and/or storage.</li></ul><br><p>Preferred qualifications:</p><ul><li>Proficiency working with algorithms, data structures and production troubleshooting.</li><li>Expertise in problem solving and analyzing global scale distributed systems.</li></ul>",
    "responsibilities": "<ul><li>Lead a team of Software/Systems Engineers on projects used and enjoyed by billions of users worldwide and be directly responsible for Google&#39;s stellar uptime record.</li><li>Own end-to-end availability and performance of mission critical services and build automation to prevent problem recurrence; automate response to all non-exceptional service conditions.</li><li>Lead by example, care for your team and establish credibility with the quality of your and your team&#39;s technical execution.</li><li>Manage on-call rotations across continents, using a follow-the-sun model.</li><li>Design, write and deliver software to improve the availability, scalability, latency and efficiency of Google&#39;s services.</li></ul>",
    "title": "Engineering Manager, Site Reliability Engineering"
}