{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfNHTP8MOtAj2YUOGBUydQxJPUMK1zzSj3SUxSdKPhYSOgCPMA3TsWXQvliY8mp5VlVrzIn-N0fVru3KXZSBN4015L3JDYqSyeHfSumttY0cvCOfepJGiOpfxRw%3D_V2&jobTitle=Program+Manager%2C+Event+Production+Engineering+Integration&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T23:01:56.535Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Using your Audio Visual and Project Management experience, you will manage and lead technically complex and custom AV project installation and integration involving the installation of broadcast quality AV systems in a corporate theatrical environment. You will be integrating complex sound systems, video production packages, theatrical lighting packages and state of the art display technologies supporting Googlers’ AV and VC (Audio Visual and Video Conferencing) and web streaming experience. You must demonstrate the ability to provide matrixed leadership across functional teams, lead complex projects to successful completion, and understand complex, technical topics. You have strong Audio Visual technical competency and the ability to lead and influence across functional groups.</p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6682908121300992",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:39:40.883Z",
    "publish_date": "2019-02-27T19:39:40.883Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience managing cross-functional teams (i.e. AV/VC Engineers, Networking, Technical Support, Facilities, external vendors, architects, general contractors, and users to drive all aspects of project delivery).</li>\n<li>5 years of experience with custom broadcast and pro-AV installation and integration in the Audio Visual industry.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Creative problem-solving, analytical skills, agile under pressure, and impeccable business judgment.</li>\n<li>Ability to establish priorities, work independently, successfully execute multiple projects, and proceed with objectives with minimal supervision.</li>\n<li>Detail oriented and ability to produce and deliver executive presentations, produce project status reports, and communicate deliverables to all stakeholders and senior management.</li>\n<li>Proven vision, leadership, and strategic skills in prioritizing evolving initiatives in a fast-paced, high-tech environment; ability to translate ideas and capabilities into effective initiatives.</li>\n<li>Excellent interpersonal and relationship building skills across several diverse technical and non-technical groups.</li>\n<li>Ability to travel 50%.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage broadcast quality of Audio Visual and theatrical installation projects globally. Manage and track all aspects/details of the design, schedule, budget, and construction.</li>\n<li>Collaborate with cross-functional teams: AV/VC Engineers, Networking, Technical Support, Facilities, external vendors, architects, general contractors, and users to drive all aspects of project delivery.</li>\n<li>Use technical judgment and previous operations experience to execute entire project life-cycle: proposal, requirements, project and resource planning, expectation setting, communication, budgets, pilot, build, and closeout.</li>\n<li>Develop and execute plans under a set of implementation and delivery time constraints. Troubleshoot technical challenges and physical site related issues.</li>\n<li>Negotiate proper design/consulting engineer and contractor fees on each project. Develop and maintain optimal relationships with external consultants and vendors through rigorous Request for Proposal processes.</li>\n</ul>",
    "title": "Program Manager, Event Production Engineering Integration"
}