{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcIoO0KeM8Ur6oGxGzIlPa5-yVaSrQ2h_xhm-hX9-w8SOgASYQ8wKpl-PE3dgRo8GKCVVMnIzE8owCjtH0yJKGkXoexY9ddyQdqSaE8nBpDOGgQS5d4bEMZrWGU%3D_V2&jobTitle=Program+Manager%2C+Go+Developer+Relations+Engagement&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-02T01:02:06.301Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Join Google’s Go Open Source Strategy Team to build a stronger bridge between Google and the Go community through meaningful and highly relevant communication and event engagement. As the Go DevRel Engagement Manager, you will create content and event programs that will foster discussion between Google and the community about Google’s technical and community Go updates, amplify the Go community’s successes, and highlight how Go is best on Google Cloud.\n</p>\n\n<p>In this role, you will excel at understanding Google’s and the community’s information needs and the communication style that resonates best. You are metrics-oriented and have great success driving authentic engagement through social, blogs, and events. Plus, you are adept at curating high volume of relevant content from a wide range of internal and community sources, providing editing and production support. Additionally, you are a strong writer with experience writing case studies and whitepapers.\n</p>\n\n<p><a href=\"https://github.com/golang\">Go</a> is an open-source language that is the language of cloud infrastructure and built by a passionate, inclusive and highly engaged global community that is growing quickly. Modern innovations are built in Go including Docker, Kubernetes, Cloud Foundry, OpenShift, Istio and Consul. Join a team committed to supporting this amazing community through meaningful engagement.</p><p>We strive to organize the world&#39;s information to make it universally accessible and useful, but we know that relevance means something different to each person. The Social team recognizes that great information is more than pages -- it&#39;s also about relationships. We want all of Google&#39;s products to reflect something personal, and we&#39;re dedicated to making your Google experience centered around you.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/140110920912118470",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:55:30.933Z",
    "publish_date": "2019-02-27T19:55:30.933Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of relevant experience.</li>\n<li>Experience working with communities and technical organizations</li>\n<li>Experience driving engagement through communication channels and events</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with content strategy, content curation, and content production</li>\n<li>Demonstrate experience managing volunteer programs with people of varying needs and communication styles through multiple channels (email, conferences, meetups)</li>\n<li>Excellent written and verbal communication skills; straightforward and clear, even when the message is complicated</li>\n<li>Strong analytical and problem solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create a content production process and schedule that supports high volume content curation. Create Google’s Go event strategy and work across teams to ensure a strong engagement plan from sponsorships, speaking opportunities, diversity initiatives, contributor summits, and community events.</li>\n<li>Curate content across teams and from the community that improves communication, discussion, and engagement.</li>\n<li>Build content such as case studies and whitepapers to highlight the best of Go</li>\n<li>Be analytics driven, tracking and reporting on engagement generated in all channels</li>\n<li>Work across outreach and communication teams to create an engagement strategy. Work closely with the community of contributors to enable close relationships between external and internal developers</li>\n</ul>",
    "title": "Program Manager, Go Developer Relations Engagement"
}