{
    "application_instruction": "<p>Join us for a unique 12-14 week internship during Summer 2019 with start dates in May and June. <b>Applications are due by April 21, 2019 at 11:59pm PT.</b> </p> <p><b>To apply:</b> You must submit all of the following materials: </p><ul> <li>Resume: relevant coding language(s) along with any technical experience or projects.</li> <li>Transcript: unofficial or official; must be in English.</li></ul>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbEymOXMzAHEbC5j2x2HjVV_hpnK5E_PmnCtPRWSDmoSOgASYQ8wtGWVG3G8jLp9yiQ635BUStg8Tp7nvzLTKBXezqoV5Dls6JELd3n20ETU64yDgvdA6OuXIFQ%3D_V2&jobTitle=UX+Data+Visualization+Intern%2C+People+Analytics%2C+Summer+2019&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-27T16:01:52.387Z",
    "description": "<p>At Google, data drives all of our decision-making, and our HR organization is no exception. The People Analytics team acts as an internal innovation lab, using analytical approaches to make sure we hire the right people and continue to be a great place to work. </p> <p>You will join our People Analytics Product Lab, which is responsible for prototyping products that use people science and technology to drive quantifiable behavior change at scale in Google employees to improve productivity, well-being and happiness. </p> <p>You have have exceptional design, UX and research skills to use in building the team’s understanding of employee collaboration and the behaviors and patterns that in</p><p>The idea for Gmail began with 1 Googler. Today it has more than 425 million users and counting.<br><br>One Googler can make a huge impact, and it’s no different with our interns--they are key players in our daily innovation. As an intern, you’ll have the opportunity to work on projects core to Google’s business, whether it be Sales, Enterprise, Finance, People Operations (HR), Legal, Trust and Safety, or Marketing. Our intern recruitment team will determine where you fit best based on your CV and the preferences you indicate on the application form.<br><br>Our internships expose you to the technology industry, as well as provide opportunities for personal and professional development. From being challenged, to collaborating with a team, join our team to make an impact.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/112083546631217862",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:50:37.410Z",
    "publish_date": "2019-02-27T19:50:37.410Z",
    "qualifications": "<p>Minimum qualifications:</p><ul> <li>Currently pursuing a MS or PhD in Design (e.g., Interaction, Graphic, Visual Communications, Product, Industrial), Human Computer Interaction, Computer Science, or a related field.</li> <li>Experience with communicating interaction and design ideas through storyboards, wireframes and prototypes.</li> <li>Experience with user-centered, usability and aesthetic design principles.</li> <li>Experience with data visualization principles, best practices, and with one or more data visualization tools (e.g., D3, Google Charts, Tableau, Google Data Studio, JavaScript charting libraries, R charting libraries, etc.).</li> </ul><br><p>Preferred qualifications:</p><ul> <li>Pursuing pursuing a PhD in Design (e.g., interaction, graphic, visual communications, product, industrial), Human Computer Interaction, Computer Science, or a related field and returning to the degree program upon completion of the internship.</li> <li>3 years of relevant graduate work.</li>\n<li>Interaction design skills; confident, clean visual design.</li> <li>Demonstrated ability to leverage user insight to influence product decisions.</li> <li>Excellent communication and teamwork skills.</li> <li>Authorization to work in the United States.</li> </ul>",
    "responsibilities": "<ul> <li>Visualize complex employee collaboration data and make an impact on business decisions and develop high-level and detailed user flows, mockups, wireframes and prototypes to effectively communicate interaction and design ideas.</li>\n<li>Assess current product usability, making constructive suggestions for improvement and become a subject matter expert on employee collaboration behaviors based on user studies.</li> <li>Influence critical product and marketing decisions by providing target product recommendations.</li> <li>Develop and execute analysis plans for ongoing projects and communicate findings and recommendations to influence teammates to take action.</li> </ul>",
    "title": "UX Data Visualization Intern, People Analytics, Summer 2019"
}