{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ1XV8HKnKsZD4cw7HTpxFv9Za1b2zBTSU0x-wncYVUSOgCPMA3Tz0CepDJdTxdYQhH8eSyXet1AU8t73JC2vRWrq8TGEk6iD_Q-92YzRpHk4OAmhT12hQzfkFg%3D_V2&jobTitle=Sampling+Statistician%2C+Customer+Experience+Lab&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-13T21:31:46.843Z",
    "description": "<p>gTech’s Product and Tools Operations team (gPTO) leverages deep user, operational, and technical insights to innovate Google&#39;s Ads products into customer experiences that are so intuitive (or automated) that they require no support at all. gPTO partners closely with gTech’s Support, Professional Services, Product Management, and Engineering teams to innovate and simplify our Ads products and build the productivity tools ecosystem for gTech users.</p>\n\n<p>The Customer Experience Lab (CX Lab) conducts customer experience research on advertisers who are using Google’s Marketing Solutions. The CX Lab is responsible for generating insights for Product and Engineering to improve the customer experience for advertisers. We collect and analyze qualitative and survey-sourced quantitative advertiser sentiment and satisfaction data. Many of these questions involve detailed, data-driven research, but are also applied directly to product launches and product development. </p>\n\n<p>As a Sampling Statistician, you will construct complex sample designs and carry out related sampling tasks for multiple global advertiser surveys and construct the necessary sampling weights based on each survey’s design and response pattern. </p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6499446798090240",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-13T09:31:39.923Z",
    "publish_date": "2019-03-13T09:31:39.923Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Master&#39;s degree in survey methods, sampling statistics, statistics, other quantitative field, or equivalent advanced practical experience.</li>\n<li>3 years of professional experience working in public and private sector directly with survey statistics, complex samples, and calibration weighting.</li>\n<li>Experience in statistical software, such as, R, SAS, or similar.</li>\n<li>Experience with databases, SQL, and scripting languages (e.g., Python).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or PhD in survey sampling.</li>\n<li>5 years of experience as a sampling statistician with weighting responsibility.</li>\n<li>Experience in the commercial online advertising industry</li>\n<li>Track record of leadership, self-direction, and willingness to teach others.</li>\n<li>Ability to present data with excellent writing and verbal communication skills.</li>\n<li>Interest in learning learn and creative problem-solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop efficient survey sample designs to optimize data for analytical purposes.</li>\n<li>Coordinate multiple concurrent samples, deduplicating cases across different product surveys. Manage access permissions to data tables that are the email frames for advertiser surveys.</li>\n<li>Extract appropriate signals (i.e., descriptor variables) to accurately describe frame profile and eligible sample profile as weighting benchmarks. Calculate relevant selection probabilities for sample base weights.</li>\n<li>Calibrate respondent data to eligible frame benchmarks by developing weights using post-stratification raking procedures as necessary. Propose sample and weighting plans that advance the accuracy and precision of survey findings.</li>\n<li>Construct the necessary weights to apply to prior unweighted survey data to allow for accurate trend analyses across multiple data collection periods. Prepare documentation on sampling and weighting used for each product survey including summary slides for stakeholder presentations.</li>\n</ul>",
    "title": "Sampling Statistician, Customer Experience Lab"
}