{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfwhDn8qSgPxNHPt-7HU3Dq4VQ4jTQVoP2PbxoL4ET4SOgCPMA3TMllJ1DVbGZQK1sczQ8pu-eXDRkpFwJe3pjCbuIP1Uu5f4gots_vctfmujbeHUTT62JI3XKM%3D_V2&jobTitle=Technical+Program+Manager%2C+Hardware+Engineering&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:06:19.791Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>In this role, you’ll keep an innovative engineering team firing on all cylinders. You will work closely with software engineers, product managers, and ODMs/OEMs to get high-quality products built, tested and released on time. You’ll coordinate many fast-changing, moving parts and still get them to come together as a product. You’ll need excellent communication skills in order to act as the central point-of-contact for all questions about schedules, quality and progress updates. You&#39;ll also be responsible for identifying and managing risks, making sound judgments about quality, and stopping (or speeding up) production at the right time.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Only one thing consistently stands in the way between our users and the world&#39;s information - hardware. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5177503494897664",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:06:02.213Z",
    "publish_date": "2019-02-27T19:39:03.738Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>3 years of experience in Electrical Engineering, Computer Engineering, Computer Science, or a related field.</li>\n<li>Experience in consumer electronics.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Industry experience, with a demonstrated record of hands-on product development, program management, project management, professional services and/or engineering management.</li>\n<li>Excellent knowledge of product life cycle, tools, processes and operations planning.</li>\n<li>Team player and creative thinker who is able to lead technical teams, cross-functional groups and vendors in accordance with plans.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and manage hardware development project schedules with engineering teams and communicate project status to stakeholders.</li>\n<li>Work closely with ODMs and vendors on product development schedules, dependencies and budgets.</li>\n<li>Identify risks, develop mitigation strategies and facilitate conflict resolution.</li>\n<li>Interface between vendors and product engineering teams, setting and managing schedules and milestones.</li>\n<li>Synthesize large amounts of data into a clear story and communicate to stakeholders and organizations at all levels.</li>\n</ul>",
    "title": "Technical Program Manager, Hardware Engineering"
}