{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ1ffQqB1J35HCfQUoaP8ZJFGN3QGyBkLncOeGvpJcYSOgASYQ8wqnP_OERxHqyVA_Skx0NibKo7DMScNex0kWNHxCn56axv24tBbuyd9o6r_VZY1kJKESy9_QU%3D_V2&jobTitle=Program+Manager%2C+Logistics&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T10:01:39.647Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n\n<p>As a Logistics Program Manager, you will drive innovation and large scale platform efforts in order to support the Hardware team, and the Retail business more generally. You will evaluate all aspects of Retail supply chain across channels and make data/driven, analytical decisions to drive customer-facing innovation.\n</p>\n\n\n<p>You will consult with both internal and external stakeholders, helping to improve service and to lower cost across multiple geographies. In addition, you will design, implement, and oversee supply chain training programs in order to help Google’s clients shape their strategy globally.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/73156548899021510",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-14T10:01:39.647Z",
    "publish_date": "2019-03-14T10:01:39.647Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS Degree in Engineering or Supply Chain and Logistics Management, or equivalent practical experience.</li>\n<li>Experience in supply chain consulting and with international supply chain management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience managing partnerships for a multinational corporation with complex legal entity structure.</li>\n<li>Experience in traditional management consulting, strategy and/or business development.</li>\n<li>Supply chain operations consulting experience.</li>\n<li>Ability to autonomously drive and prioritize multiple initiatives, and to present to leadership. Demonstrated global transportation background across all modes, with a specific focus on parcel.</li>\n<li>Effective data-mining and analytical skills, with the ability to thoroughly examine and analyze supply chain cost and performance information.</li>\n<li>Excellent consulting and client facing skills, interpersonal and organizational skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Understand the challenges companies face in their international expansion in relation to Logistics, and determine where Google can play a role.</li>\n<li>Drive client consultations for Google&#39;s advertising partners/retailers, identifying strategic opportunities to improve customer experience and to drive logistics performance.</li>\n<li>Analyze clients&#39; logistic operations and compile recommendations according to customer needs, partnering with suitable vendors/suppliers to implement the recommendations.</li>\n<li>Utilize analytics and identify opportunities to compare and reduce logistics and carrier freight costs for customers. Conduct market studies and industry analysis. Research supply chain trends and technology advancements in order to drive improvement and to present opportunities for innovation.</li>\n<li>Support the development of internal platforms with logistics content. Develop avenues to externalize, scale and socialize this content.</li>\n</ul>",
    "title": "Program Manager, Logistics"
}