{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Boulder, CO, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcke92bLouQZlujdm9hnHEyoPiPOxXwuxL9fAdY6bhVoASOgASYQ8wUj7y4hsdKVWdgRym-XjP0b1rnuR59PMxPNA5QuW-8Pm66Vmp52d7SDt7pnDu-ny-wq4WEmU%3D_V2&jobTitle=Analytics+and+Insights+Manager%2C+Strategy+and+Operations&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T16:01:54.746Z",
    "description": "<p>gTech’s Strategy and Operations team (gSO) is made up of strategic partners and trusted advisors that drive success and transformative changes for gTech. We create value through deep functional and business expertise combined with analytical rigor to formulate and deliver strategies. Using core capabilities ― strategy, analytics, and communications ― we empower gTech to do amazing things to land the present, and build for the future.</p>\n\n<p>Within gSO, the Analytics and Insights (A&amp;I) team leverages big data sets, analytical tools and business partnering to help the Ads business to provide exceptional customer experience and drive smart business decisions. You will manage a global team of Analysts providing analytical support and data-driven insights for the Global Customer Care (GCC) organization. You will provide strategic thinking and leadership to drive the capabilities of the team and scale the team’s impact. You will stay focused on aligning the highest-level company priorities with day-to-day operations, and help evolve early stage ideas into future growth, efficiency and customer satisfaction initiatives.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87668672295772870",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-02-27T19:54:10.067Z",
    "publish_date": "2019-02-27T19:54:10.067Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree with a quantitative focus in Economics, Computer Science, Mathematics, Physics, Statistics, Accounting or equivalent practical experience.</li>\n<li>8 years of work experience in a sales and marketing environment.</li>\n<li>2 years of experience managing a team.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in applying data driven insights to have a tangible impact on business performance.</li>\n<li>Knowledge of SQL, databases, experimental design, predictive modeling and Google advertising products.</li>\n<li>Ability to leverage exceptional executive presence to partner with and influence senior business executives on a global, cross-functional basis.</li>\n<li>Ability to apply business judgment to prioritize business requests and allocate analytical resources.</li>\n<li>Excellent project management skills, with ability to handle multiple projects simultaneously in a high-paced and dynamic environment.</li>\n<li>Excellent problem solving skills, with ability to synthesize data into useful formats and bring actionable insights through effective communication.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage and develop a team of Business Analysts to align with, and optimize impact on, organizational level strategy and goals.</li>\n<li>Partner closely with the GCC Leadership team to develop a deep understanding of their business, from data and metrics to strategic challenges and opportunities.</li>\n<li>Provide thought leadership to business stakeholders, translating data into actionable insights to drive performance.</li>\n<li>Lead business performance deep dives to identify and size opportunities for growth and efficiency, contributing to the strategic direction of the business.</li>\n<li>Lead repeatable and ad-hoc analyses to measure and interpret business trends and inform business partner decisions.</li>\n</ul>",
    "title": "Analytics and Insights Manager, Strategy and Operations"
}