{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXpz7inRkDFtNcRTrK7uypH68r-_3NHzMFhobEdKLAUSOgCPMA3TK0saqp7JwwWD0yAv-fJOlNaNnlMlveVCLTMrSW2Txu2LRlNjv4JuambTio0tJnoRqFLsX7E%3D_V2&jobTitle=Security+Engineer%2C+Threat+Analysis&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:32:19.961Z",
    "description": "<p>There&#39;s no such thing as a &quot;safe system&quot;\u009d - only safer systems. Our Security team works to create and maintain the safest operating environment for Google&#39;s users and developers. As a Security Engineer, you help protect network boundaries, keep computer systems and network devices hardened against attacks and provide security services to protect highly sensitive data like passwords and customer information. Security Engineers work hands-on with network equipment and actively monitor our systems for attacks and intrusions. You also work with software engineers to proactively identify and fix security flaws and vulnerabilities.</p>\n\n<p>The Threat Analysis Group uses traditional research methods, creative engineering and vast computing resources to keep Google, but more importantly our users, safe from sophisticated adversaries. We provide Google’s operational and product teams with the necessary intelligence to ensure our users are protected, informed and aware of relevant security and privacy issues. You will work within a small team to make significant advancements in security research.</p><p>At Google, our users come first, and the Systems Infrastructure team is at the heart of that promise. We build the technologies that transform the way we think about doing business. Whether working on our cloud systems, researching the latest in computer technology or keeping Google&#39;s internal systems humming, Googlers and users alike rely on us to keep things running. We&#39;re back-end experts: protecting your privacy and ensuring your security.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6472133691768832",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T22:31:59.479Z",
    "publish_date": "2019-02-27T22:31:59.479Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or related discipline, or equivalent practical experience.</li>\n<li>3 years of experience in a threat intelligence, reverse engineering or related role.</li>\n<li>Programming experience in Python, C/C++ or Go.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience identifying and understanding modern cyber operations.</li>\n<li>Experience in logs and intrusion detection systems.</li>\n<li>Excellent communication and documentation skills.</li>\n<li>Demonstrated understanding of network and web browser fundamentals, techniques for lateral machine movement, malware persistence mechanisms, covert channels and command and control techniques.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify, analyze and document network signals, malware behaviors and threat reports related to trends and developments in adversary tactics, techniques and procedures (TTPs).</li>\n<li>Build/improve tools for analyzing malware, identifying threats and tracking adversaries.</li>\n<li>Provide clear, actionable and structured intelligence to product and security teams. Assist in ensuring corporate and production systems are safeguarded.</li>\n<li>Own the analysis efforts of one or more threat actors, and serve as a subject matter expert on how those actors might affect Google and our users.</li>\n<li>Identify personal and team priorities, and work on assignments with minimal supervision while maintaining quality and deadlines.</li>\n</ul>",
    "title": "Security Engineer, Threat Analysis"
}