{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeMihjirIcaw6gbDTUPR9oHwmTwAL9iNiupjK12hp1kSOgCPMA3Tnp6b25GGkTPUqxcBS6tNCqKxU8Yb7JCbMYEpLTRyLKEU_oFZugCC-bWHJiVKyy8z-TVOjUM%3D_V2&jobTitle=Technical+Program+Manager%2C+Network+Engineering+%28Vendor+Management%29&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:05:26.749Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>Our objective is to ensure accessibility to Google products and services, including Google Search, Cloud and YouTube, by working in close collaboration with suppliers and network operators worldwide. You like the idea of implementing networking solutions that deliver front-end serving content to users around the world. You will manage cross-functional projects that require working with all organizational levels and groups specific to growth and development of the Google backbone, data center, peering and content distribution networks. A strong background in network engineering, network content distribution, network operations, technology deployment or computing sciences is essential for your success in this role.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5818133233467392",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T22:32:00.190Z",
    "publish_date": "2019-02-27T22:32:00.190Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical/engineering field or equivalent practical experience.</li>\n<li>5 years of experience in a related field managing and working with third party vendors; experience in risk/issue analysis.</li>\n<li>Experience with managing migration-style projects; projects that involve technology qualification, upgrades and changes during maintenance windows.</li>\n<li>Experience supporting or driving technical programs in network deployment/engineering, product design, network content delivery or data center networking within telecommunications or Internet industries.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree in a technical field or equivalent practical experience.</li>\n<li>Demonstrated experience defining system and/or process requirements; building, integrating, and/or delivering large-scale layer 2 and layer 3 network systems.</li>\n<li>Demonstrated ability to manage multiple priorities in an ambiguous and busy operations environment, and deliver outstanding results in a timely manner.</li>\n<li>Knowledge or demonstrated experience with software/cloud applications</li>\n<li>Outstanding organizational, multi-tasking, and prioritization abilities; an excellent attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage and host regular sync-up meetings covering new technology introduction, strategy, ongoing operations, tech talks, central priority list and ongoing high priority cases. Understand vendor’s product set and determine how the vendor fits strategically within the Google network.</li>\n<li>Manage various programs of work, engage teams and engineers; set the pace for development, deployment and delivery of networking systems and infrastructure. Develop and prepare project documentation, process maps, presentations and tracking reports to provide detailed current status of each project.</li>\n<li>Work with core teams to develop and articulate tactical plans and long term strategy for Google’s backbone and content distribution requirements. Initiate new programs in response to need and be the catalyst for winning support and driving them through the execution phase.</li>\n<li>Analyze numerical network performance and system performance data and translate into recommendations and actionable plans. Provide strong quantitative analysis focus, requiring interpretation of technical and commercial information from structured and unstructured sources.</li>\n<li>Use technical judgment to drive project delivery, technology reviews, challenge proposals and build consensus. Present your team&#39;s analyses and recommendations to internal stakeholders, including executive management.</li>\n</ul>",
    "title": "Technical Program Manager, Network Engineering (Vendor Management)"
}