{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Council Bluffs, IA, USA; The Dalles, OR 97058, USA; Lenoir, NC, USA; New York, NY, USA; Moncks Corner, SC 29461, USA; Pryor, OK 74361, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfyXhfkE4gMw9AO1Mzc9i-tWhIzS0Wj9PYHBahSGbyYSOgASYQ8w8pPSMvKt_5K43vTt8Qgtns95i89FfeDgoyeXFF2fmvgsV9MzL4l-ei1tmF0Dt_-eJj_ZoNE%3D_V2&jobTitle=Security+Technology+Manager%2C+Global+Data+Centers&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-07T16:31:34.655Z",
    "description": "<p>Security is at the core of Google&#39;s design and development process: it is built into the DNA of our products. The same is true of our offices. You&#39;re an expert who shares our seriousness about security and our commitment to confidentiality. You&#39;ll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn&#39;t come at the expense of customer service - you will be our bodyguard (and our long lost pal).</p>\n\n<p>Google&#39;s Data Center Security team is tasked with physically protecting the people and assets that operate and supporting Google&#39;s global infrastructure. Data Center Security follows a model of leveraging resources such as security technology, manned guarding services, and safety awareness to operate as a value adding, efficient business unit that partners with and supports Google Data Center Operations.\n</p>\n\n<p>As a Security Technology Manager, you will be a part of the team responsible for the overall upkeep and improvements for a variety of different applications that keep Googlers safe and secure. Our team uses data to drive business decisions and to affect change. You&#39;re a self-starter ,with a passion for analyzing, organizing, and visualizing large amounts of data.</p><p> </p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/141413273913172678",
    "location": {
        "address_lines": [
            "The Dalles, OR 97058, USA"
        ],
        "city": "The Dalles",
        "country": "OR",
        "country_code": "US",
        "display": "The Dalles, OR 97058, USA",
        "lat": 45.5945645,
        "lon": -121.1786823,
        "post_code": "97058"
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=The+Dalles%2C+OR+97058%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=The+Dalles%2C+OR+97058%2C+USA&size=1168x324&zoom=12&signature=CRfgydpTS47A30OUEysU9ydvtjM=",
        "large_2x": "/maps/api/staticmap?center=The+Dalles%2C+OR+97058%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=The+Dalles%2C+OR+97058%2C+USA&scale=2&size=1024x324&zoom=12&signature=x1uawb9azgSfD2n3tAi-WMQGq1M=",
        "small_1x": "/maps/api/staticmap?center=The+Dalles%2C+OR+97058%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=The+Dalles%2C+OR+97058%2C+USA&size=600x400&zoom=12&signature=OdZjB1LLhImobT2HdlYrCrR7GxM=",
        "small_2x": "/maps/api/staticmap?center=The+Dalles%2C+OR+97058%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=The+Dalles%2C+OR+97058%2C+USA&scale=2&size=600x400&zoom=12&signature=FZ7pYKF9iGmoyryiMlxyHix3TR8="
    },
    "modified": "2019-02-27T19:55:41.491Z",
    "publish_date": "2019-02-27T19:55:41.491Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Criminal Justice, a related field or equivalent practical experience.</li>\n<li>5 years of experience managing physical security technology projects from evaluation to design and execution.</li>\n<li>3 years of experience in designing and/or administering programs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Credentials from Board of Certified Safety Professionals or equivalent agency.</li>\n<li>People management experience.</li>\n<li>Ability to conduct business analyses with complex data sets to identify key issues to the firm&#39;s strategic, organizational, and operational needs. Ability to support hypotheses and develop actionable recommendations.</li>\n<li>Applied project management skills, with the ability to create workable project plans, define the project scope, and execute on plans.</li>\n<li>Ability to support requests for information and requests for proposals to identify qualified technology suppliers, and negotiate best pricing and business terms.</li>\n<li>Data-driven, with excellent problem solving skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and track changing business conditions for Google and relevant industries, and evolve security technology strategies and related products based on research, data and market trends. Monitor and assess technology-related risks and help prioritize technology projects/requests.</li>\n<li>Support the build of technology solutions through execution cycle from strategic planning to tactical activities such as gathering requirements, developing user stories, and creating project, rollout and communications plans.</li>\n<li>Support evaluation, integration, and implementation of third party technology solutions. Manage communication of progress/status within the team and with our partners, while continuing to foster improvement for the global physical security program.</li>\n<li>Lead cross-functional teams and multiple simultaneous projects with competing priorities and varying dependencies. Provide clear requirements for external groups.</li>\n<li>Develop product and project management for internally developed security products. Define, evaluate and improve processes within the team, and consult with operations teams to ensure that they comply with global policies.</li>\n</ul>",
    "title": "Security Technology Manager, Global Data Centers"
}