{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYw0TS75hMH3GHwHk0sSFwJ9vag3DpBuNM_fDFG5CtcSOgCPMA3Tg13lVSSNGjDx1dymnbSh6sTZj4cCcpzzCdOi2LBekIH5Fk2ptVkq7GuFdiETUVnn2UquZuI%3D_V2&jobTitle=Data+Analyst%2C+Revenue+Reporting%2C+Accounting+Operations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-18T22:04:31.565Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s business objectives.</p>\n\n<p>You are a well-rounded who can be a key contributor in an enthusiastic growth environment. You have a proven track record working with global, high tech companies, and the desire to excel in everything you do. You will also leverage your technical skills and passion for understanding data to participate in cross-functional initiatives to streamline and automate existing reporting processes; scope and design new reporting processes; educate users on Google’s data sets; and drive efficiency improvements in partnership experiences. Analysts on the Global Revenue Systems team collaborate with multiple teams to ensure that we have robust, scalable accounting and reporting processes to support our business partners to deliver on internal and external data requests.\n</p>\n\n<p>The Data Analyst for Revenue Reporting will be focused on executing on internal and external reporting requests, as well as implementing opportunities to optimize our accounting operations through programmatic automations. You have a strong attention to detail with a proven ability to work well with other teams, provide outstanding customer service, deliver on deadlines, and produce flawless work. You will partner with our Accounting Operations, Tax, External Reporting and Legal teams to provide timely data to manage financial risk, ensuring that partners can adhere to regulatory requirements. Additionally, you will also work closely with these teams to develop scalable automations for accounting and reporting processes.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5870549177663488",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:47:58.354Z",
    "publish_date": "2019-02-27T19:47:58.354Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Accounting, Finance, or Business or equivalent practical experience.</li>\n<li>Database experience including experience in SQL coding across standard commercial databases or equivalent experience in other programming languages.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>4 years relevant work experience.</li>\n<li>Experience working in teams committing code and working with version control.</li>\n<li>Demonstrated experience in driving operational process improvement</li>\n<li>Knowledge of standard finance systems (e.g. Oracle, Hyperion, OBIEE) together with knowledge of core finance processes.</li>\n<li>Distinctive problem-solving and analytical skills combined with strong business acumen. Demonstrated ability to multi-task and apply initiative and creativity on challenging projects.</li>\n<li>Passion for developing and analyzing large, complex data sets and converting them into the information/insights that drive business decisions at all levels of the organization.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with cross-functional departments including Accounting, Tax, Legal, External Reporting, on reporting related activities and system initiatives.</li>\n<li>Utilize SQL coding to provide financial data for internal and external financial reporting.</li>\n<li>Critically evaluates data gathered from multiple sources, identifies gaps, reconciles conflicts and decomposes high-level information into details to drive decision-making.</li>\n<li>Partner with internal teams to define and implement solutions that improve accounting and reporting processes.</li>\n<li>Maintain highest levels of development practices including: technical design, solution development, systems configuration, test documentation/execution, issue identification and resolution, writing clean, modular and self-sustaining code.</li>\n</ul>",
    "title": "Data Analyst, Revenue Reporting, Accounting Operations"
}