{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfS6PrZyNpn2_p9sV3my1vZXiSfm_DUZHyOl4nBJWPESOgASYQ8wXB5Ij4mZALpr9Nq9TNYryofWeWuBEIENTytTWQgzVujYEikDgRCbDEPOe0FaKRrVNqsP-MM%3D_V2&jobTitle=Transportation+Program+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T20:01:45.803Z",
    "description": "<p>As a member of Google’s global transportation team, you will be part of the team overseeing one of the largest global corporate transportation programs, ensuring excellence in service delivery, and playing a key role in Google&#39;s growth.</p><p>You will be responsible for a number of programs that provide sustainable, innovative, and user-focused mobility options and seamless connectivity throughout our campuses that enable future company growth. In addition to supporting our corporate shuttle operations, you will directly oversee our vanpool programs, charter transportation services, carshare programs, emergency ride home program, public transit partnership and incentives and non-shuttle fleet vehicle maintenance operations. You will also oversee strategy and administrative oversight of vendor onboarding as well as budget and contract administration. </p><p>This role requires frequent interaction with multiple internal and external stakeholders in a fast-paced and highly collaborative environment, working well with teammates, senior leaders, and other cross functional colleagues. You must be willing to pitch in on projects outside of your core role to help advance the team’s goals.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/137659764017373894",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-02-27T22:32:06.044Z",
    "publish_date": "2019-02-27T22:32:06.044Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in city planning, business administration or other relevant field or equivalent practical experience.</li><li>5 years of experience in commuter transportation services.</li><li>Vendor management and program management experience.</li></ul><br><p>Preferred qualifications:</p><ul><li>Master&#39;s degree or an equivalent combination of education and experience</li><li>Experience developing strategic program management for a growing organization.</li><li>Ability to work calmly and collaboratively in a dynamic setting with high ambiguity and often shifting set of priorities in a high-pressure, results-oriented environment, maintaining good judgment and the ability to escalate appropriately.</li><li>Demonstrated ability to provide excellent customer service</li><li>Detail-oriented and well-organized with excellent written and verbal presentation skills.</li></ul>",
    "responsibilities": "<ul><li>Manage global vanpool program, global charters services, ADA service operations, global emergency ride home program, internal carshare program, and non-shuttle fleet vehicle operations.</li><li>Partner with the local public transit agencies and manage the contracts and relationships for transit passes and incentives.</li><li>Oversee budget and contract administration; transportation program lost and found; and strategy and administrative oversight of vendor onboarding, serving as the main point of contact for vendor security audits, privacy reviews, etc. for all new initiatives.</li><li>Support shuttle operations as necessary.</li></ul>",
    "title": "Transportation Program Manager"
}