{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbqgXU4TotrmUb4NWUzbfOlvSvVKgYTisdvc2HwKDpkSOgASYQ8wbLZwnvHfhM_Si4eDGu-A9T-g1dRFIqXRvQTXRID4Gz-j24oT5rclPcxZbIYiFRRRNue-FnY%3D_V2&jobTitle=Policy+Enforcement+Manager%2C+Trust+and+Safety%2C+YouTube&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-21T11:01:55.124Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p><p>As part of YouTube Trust and Safety, you will be directly responsible for making the internet safer, protecting free speech and defending our brand. As a Policy Enforcement Manager, you&#39;ll be responsible for working with a global team from Policy, Enforcement, Product, Engineering, Tools, and Legal to prevent violative content from appearing on the site. You&#39;ll evaluate abuse trends and quality within vendor operations, and you&#39;ll develop creative solutions to address quality, workflows and processes. You&#39;ll also review decisions about the appropriateness of different content, including considerations of cultural and political sensitivities.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/109431110791766726",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T02:02:12.577Z",
    "publish_date": "2019-03-07T02:02:12.577Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, related field or equivalent practical experience.</li>\n<li>3 years of experience working in an operations capacity such as; scaled or sales operations, vendor management, or process or organizational optimization.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of experience identifying abuse trends or working in news or policy.</li>\n<li>Experience in content policy, anti-abuse, and reviewing online content.</li>\n<li>Experience with SQL and spreadsheet software.</li>\n<li>Ability to build relationships with cross-functional partners across geographies.</li>\n<li>Demonstrated analytical skills, including using data to drive strategy and business action.</li>\n<li>Demonstrated business judgment and developed influencing and communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Research and stay up-to-date on key trends and suspicious patterns across policy areas.</li>\n<li>Oversee enforcement quality across policy areas, including calibrations with vendor teams.</li>\n<li>Work cross-functionally, think strategically, and keep our users safe while protecting free speech.</li>\n<li>Review controversial and offensive video content in-line with YouTube’s Community Guidelines.</li>\n</ul>",
    "title": "Policy Enforcement Manager, Trust and Safety, YouTube"
}