{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXerQ6scA0OxL7czruIPxeHD_Nt2xYUv-zocvfQ9kokSOgASYQ8w7lwgYV3l08Aa71-qx_4F-MPYiNTDtXCvjK7N9oVLbPuVd-ZaKevd6_8mbFhQPVr7sXTcQxY%3D_V2&jobTitle=Head+of+Business+Risk+Programs%2C+gTech+Business+and+Outsourcing+Strategy+and+Services+-+Boulder&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T18:31:31.752Z",
    "description": "<p>gTech’s Business and Outsourcing Strategy and Services team (gBOSS) provides consultative services to gTech, the Global Business Organization (GBO), and Google at large, enabling each part of our business by developing innovative, scalable, and compliant solutions that allow gTech to run efficient operations with the best vendor partners at optimal cost while minimizing risk.</p>\n\n<p>The gTech Services Business and Outsourcing Strategy and Services (gBOSS) team develops practical and innovative ways to address complex business challenges. We anticipate how decisions are made, continuously explore and uncover the business needs of our key clients, and understand how our range of product and service offerings can enable their business success. We also lead the global vendor strategy across all organizations, manage business risks, ensure we have excellent agreements, and deliver amazing client experiences for Google’s customers and partners. We provide Google-caliber client service, legal guidance, research, and market analysis.\n</p>\n\n<p>As Head of Business Risk Programs, you will lead the global Business Risk Program Management team, developing strategic risk roadmaps and programs for the outsourced Temps, vendors, and contractors (TVCs) in gTech, Google Customer Solutions (GCS) and the Google Operations Center. You will work across a varied sales and support operations portfolio, including Ads, Users, and Partners. Through thoughtful risk programs, you will enable performance, agility and growth in gTech’s and GCS’s outsourced businesses, while keeping them safe, secure, and compliant.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/86471117302047430",
    "location": {
        "address_lines": [
            "Boulder, CO, USA"
        ],
        "city": "Boulder",
        "country": "CO",
        "country_code": "US",
        "display": "Boulder, CO, USA",
        "lat": 40.0149856,
        "lon": -105.2705456
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=1168x324&zoom=12&signature=RWg9rdP4s-zj7r2ELoisZdFQ7jU=",
        "large_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=1024x324&zoom=12&signature=lRnrHzcQtw0pgrtaHpD_4j8u63g=",
        "small_1x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&size=600x400&zoom=12&signature=Kkn4WpW4jfSb41zSVJO_wPfUn5Y=",
        "small_2x": "/maps/api/staticmap?center=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2600+Pearl+Street%2C+Boulder%2C+CO+80302%2C+USA&scale=2&size=600x400&zoom=12&signature=aZnnbjI8phY0WeCAZPgUPofC1jo="
    },
    "modified": "2019-03-11T17:03:03.483Z",
    "publish_date": "2019-03-11T17:03:03.483Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>12 years of experience in risk management or compliance.</li>\n<li>5 year of experience in people management.</li>\n<li>Experience in IT auditing/consulting and directly performing security, privacy, and/or risk assessments.</li>\n<li>Experience managing program specialists and/or program managers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in consulting and/or project management with a track record of meeting or exceeding goals.</li>\n<li>Excellent organizational skills and attention to detail. Excellent business partnering, communications skills, and interpersonal skills.</li>\n<li>Ability to work collaboratively, independently, strategically, and with sound judgment while managing and delivering on complex projects.</li>\n<li>Ability to develop and motivate team members.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a global program management team developing strategic risk roadmaps, programs, and solutions for a varied and complex gTech service portfolio.</li>\n<li>Conduct quarterly risk assessments to identify and quantify existing, emerging and future risks and recommend how to mitigate risks across gTech verticals to the Management Group.</li>\n<li>Design and implement critical new risk management capabilities (e.g., risk reports, workflow assessments, or incident response) for gTech operations.</li>\n<li>Provide risk consultations for new outsourcing engagements or re-organizations, develop standards and guidelines, and provide risk education to the organization.</li><li>Build relationships and partner with cross-functional stakeholders across gTech verticals and Security, Privacy, Legal, Compliance, Extended Workforce Solutions (xWS), and Product/Engineering.</li>\n</ul>",
    "title": "Head of Business Risk Programs, gTech Business and Outsourcing Strategy and Services - Boulder"
}