{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfT3dE70QSZ5ntD4dCa2T_NMnl1mTfdRJzBQWzjVTesSOgASYQ8w1b8tf0vCe_9r2vEiku-iM2WYe5WSZdX_MMiOe8rSD9M5xXnUqCsMky_hft5qkfp-mNsrI9I%3D_V2&jobTitle=Director%2C+Global+Product+Policy%2C+Developer+Policies&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-05T18:31:40.774Z",
    "description": "<p>The Global Product Policy, part of Google&#39;s Trust and Safety team, develops policies that help improve user experiences across a wide variety of Google&#39;s products including Google Ads, AdX, Search, Maps, Geo, Cloud, Blogger, and more. We&#39;re driven by our focus on the user and passion for using our technical, legal, business, and policy experience to improve Google&#39;s policies and user experience. </p>\n\n\n<p>As a Director of Policy for Trust and Safety, you will be responsible for our partnerships and policies across the Developer suite of policies and products. This includes hosted platforms, such as Blogger, infrastructure products such as Cloud, and partnerships with other teams as such Play. You will lead a team of policy specialists to improve our products and to set policies to protect and respect users. \n</p>\n\n\n<p>Our job is relentlessly cross-functional and global. Launching a policy requires us to work closely with Product, Engineering, Legal, Public Policy, PR, Enforcement, and other teams within Trust and Safety, across Google, and around the world. You are a leader who can exercise sound judgment in newly evolving areas, can negotiate across opposed positions, and lead the team to craft policies that can work at scale.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/94770878266385094",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:49:00.193Z",
    "publish_date": "2019-02-27T19:49:00.193Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or 4 years of equivalent practical experience.</li>\n<li>10 years of experience with the technologies underlying the Internet and web, including networking architecture, web markup and scripting languages, online advertising technology, database systems, and machine learning.</li>\n<li>Experience leading, teams globally and cross-functionally.</li>\n<li>Experience in drafting online policy for an online platform or engagement with online public policy issues.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master’s degree, JD, or equivalent practical experience.</li>\n<li>Experience working internationally, especially in the online platform space.</li>\n<li>Experience with advanced product and/or program management.</li>\n<li>Broad policy experience with robust knowledge of the technology sector and the key policy issues affecting the internet like intellectual property, free expression, and online safety.</li>\n<li>Excellent communication skills with the ability to translate complex issues into simple, clear language.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of policy specialists to develop and implement content and developer policies for a wide variety of Google products, including but not limited to Blogger, Chrome Webstore, and Cloud.</li>\n<li>Lead a team of policy specialists to collaborate with Product Managers, T&amp;S teams, and Engineering leadership to influence product decisions and prioritization and improve user experience for policy-related issues.</li>\n<li>Drive research and collaboration to set industry standards.</li>\n<li>Drive awareness and understanding of our product policies within Google and across our user base.</li>\n<li>Advance education around the first principles that define our positions on topics such as hate speech, bullying, minor protection, safety, security, developer guidelines, and privacy.</li>\n</ul>",
    "title": "Director, Global Product Policy, Developer Policies"
}