{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Bruno, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXqPzGM_RH9rYHKNEj-5xZs6OjhGvDiOnj_n0TqcnsESOgCPMA3TO1p7KhvseDqllHoWjqVYex1gsOGlh7_kivWpr8MaeJmD-JjfApB1_44kPBIoJfchpOlEHvE%3D_V2&jobTitle=Customer+Relationship+Management+Tech+Lead%2C+YouTube&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-21T23:35:08.741Z",
    "description": "<p>The YouTube Insights, Impact &amp; Tools team supports the YouTube business and operations teams with data infrastructure, tools, and analytical support. Our charter is to help our internal partners run their businesses by providing rigorous, insightful data and by building solutions and services which transform how the YouTube business teams work.</p><p>As a YouTube Customer Relationship Management (CRM) Tech Lead, you will drive the development of Salesforce (SFDC) platform used by YouTube operations teams, who are tasked with the objective of achieving greater creator happiness and success.</p><p>Working closely with the platform team and SFDC user teams, you will help deliver great CRM value to our user group by using Salesforce and provide long-term solutions by leveraging the great features, functions and best-practices with Salesforce.</p><p>You have excellent communication skills (written and oral) with demonstrated interpersonal and organizational abilities. You will be working in a constantly changing, fast-paced environment, so your flexibility is a necessity.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6112299787157504",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-05T21:01:47.651Z",
    "publish_date": "2019-03-05T21:01:47.651Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>5 years of experience in hands-on design and software development using an object-oriented programming language (e.g., C++ or Java).</li><li>Experience with Salesforce, SQL and enterprise integrations.</li><li>Experience with front-end languages and backend tools for web engineering such as Lightning Experience, JavaScript, HTML5, CSS, APEX, or Visualforce.</li></ul><br><p>Preferred qualifications:</p><ul><li>Master&#39;s degree in Computer Science or Electrical Engineering.</li><li>5 years of experience in hands-on design and development, using Salesforce API, APEX and Visualforce.</li><li>Experience with Software Development and REST/SOAP API Integration knowledge.</li><li>Ability to use critical thinking and logic skills to isolate and resolve technical issues in a timely manner.</li><li>Superior time management and prioritization skills. Strong ownership of quality in code, client/server communication, user experience/user interface.</li><li>Exceptional verbal and written communication skills with the ability to effectively influence and communicate cross-functionally with all levels of management.</li></ul>",
    "responsibilities": "<ul><li>Collaborate with Business and Operations teams to define, evaluate, prioritize, and improve CRM features and functionality.</li><li>Articulate design considerations, trade-offs, benefits, and recommendations for system design.</li><li>Deliver key new features using Salesforce technology, including workflow, process builder, Lightning Experience, APEX and Visualforce, etc.</li><li>Work closely with Engineering and Business Analytics teams to improve data flow.</li><li>Collaborate with internal teams to improve Salesforce integrations with internal systems.</li></ul>",
    "title": "Customer Relationship Management Tech Lead, YouTube"
}