{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXl6MK_4cthulPMV8S2_GbHuRzsAgyHJFIraKZ_9C8cSOgASYQ8wUdaypvbmIMwVF-7VxIOpJNopVGEf4SoG97JOHxkqqDI7JZiPnu8Y3Eb1L4mQcOqFUQgekmU%3D_V2&jobTitle=Technical+Specialist%2C+Mobile+Apps&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-07T22:01:40.104Z",
    "description": "<p>gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities.</p>\n\n\n<p>The gTech Professional Services MPS (Mobile App Performance Specialist) team provides deep and specialized in-region technical implementation support for emerging App Promotion Ads products. Our team consists of sharp, analytical minds who enjoy solving complex strategic, operational and technical challenges for the world&#39;s largest mobile players. As a Specialist for our App Promotion products, you will be responsible for building a deep understanding of the most nascent Google Ads products and leveraging them to achieve customer goals. You will also be building robust processes, systems, tools and documentation to ensure such cutting-edge products can eventually be serviced by generalists.\n</p>\n\n\n<p>Technical Specialists for Mobile Apps are mobile gurus who serve as trusted advisors for our top partners and as the bridge for Google&#39;s Engineering and Sales teams. MPS members are just as comfortable producing code as they are having strategic technical conversations with a Client CTO. You are a mobile product expert who can nurture and deepen partner relationships through successful engagements, multi-product integrations and providing day-to-day support with your extensive expertise in mobile products such as Universal App Campaigns, Firebase and other Google App Promotion products. You flawlessly architect mobile solutions for your clients based on their business goals, lead implementations and integrations for a variety of our product lines during the pre-sales and post-sales process. As a technical expert, you work closely with the partner sales teams to monitor our products&#39; performance for top clients, develop tools that address their technological and business needs and identify opportunities to grow Google&#39;s partner mobile business. Additionally, you also constantly look for opportunities and build products to improve processes through workflow optimization and automation to increase efficiency and productivity.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/111937844294886086",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-04T21:02:03.545Z",
    "publish_date": "2019-03-04T21:02:03.545Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience managing external partners and/or customers.</li>\n<li>Experience with SQL, XML, or HTTP protocols.</li>\n<li>Experience with object-oriented programming.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>3 years of experience with client side web technologies, including HTML, CSS, and JavaScript.</li>\n<li>Knowledge of mobile app development on iOS and/or Android.</li>\n<li>Ability to adapt your message to the technical level of the audience and comfort presenting technical materials to groups of any size and background.</li>\n<li>Excellent analytical and project management skills with precise attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Optimize business growth by ensuring high adoption of Google Mobile App Promo products. Be the primary day-to-day technical contact for your client set.</li>\n<li>Advocate new product features and assist clients in the adoption of new products via upgrades and migrations. Provide documentation, perform implementation reviews, and analyze/optimize client product mix.</li>\n<li>Support product launches, including training for cross-functional teams. Partner with Sales and client-facing teams to scope and collect client requirements, provide guidance on best practices, and apply technology and product knowledge to address customer&#39;s needs.</li>\n<li>Collaborate to drive communication, prioritization, analysis, and resolution of customer challenges and issues. Participate in the analysis and research for technical issues.</li>\n<li>Maintain industry, Google product, and customer knowledge to provide successful ad management consultation. Lead or contribute to projects that increase efficiency by developing tools.</li>\n</ul>",
    "title": "Technical Specialist, Mobile Apps"
}