{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUje5i1ve-BIgPvLdrVoSI56XZ0gZZrt0VtzaqGZffcSOgCPMA3Tfptd8hTgBhoACq33M000m8ezSt-B9VI-LgYs74hkhBf0dg0UvLj2tsn_Cf0NyZZTDk1m2xc%3D_V2&jobTitle=Project+and+Process+Manager+%28Procurement+Operations%29&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T23:01:58.683Z",
    "description": "<p>The Finance Operations team manages Google&#39;s cash transactions on a global basis and ensures that Google&#39;s incoming and outgoing cash processes are controlled, effective and efficient. As a member of this team, you&#39;ll find innovative ways to manage our complex set of transactions. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across the five areas of the Financial Operations team: Global Revenue Operations, Procure to Pay, Electronic Payment Services, Business Process Outsourcing, and Payroll.<br><br>As a Finance Operations Manager you are directly responsible for either a global process (Global Process Manager) or a set of processes in a region (Regional Process Manager). You lead your team with a clear, strategic vision, always keeping the quality and scalability of your processes in mind, and know how to build trusting relationships with your team and your peer group.</p>\n\n<p>At Google we buy hardware, software, professional services, manage facilities around the world, use various technology services, marketing that provides benefits for our staff. The Procurement Operations team strives to have the best internal purchasing tools, systems and processes available anywhere. As a member of this team, you will find innovative ways to improve the buying process for Googlers. \n</p>\n\n<p>As a member of this team, you will find innovative ways to design and implement scalable operations that support the end to end buying process. You thrive on making processes more efficient and scalable, you work to ensure the highest level of quality of our operations and you proactively minimize operational risk. Externally, you collaborate with our outsourcing partners and internally, you collaborate across Finance, Legal, IT, and business stakeholders across all parts of Google. You take on new leadership opportunities every day and have the autonomy to identify and execute projects that will benefit Google for years to come.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6470266035306496",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:51:18.419Z",
    "publish_date": "2019-02-27T19:51:18.419Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>8 years of relevant experience.</li>\n<li>Experience with Finance/Procurement ERP Systems.</li>\n<li>Experience working with outsourced service providers and launching and scaling new processes at service providers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or other advanced degree.</li>\n<li>Experience with Lean, Six Sigma process improvement methodologies or PMI</li>\n<li>Procurement experience.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design processes to support Google’s future buying needs. Identify opportunities to centralize and standardize processes.</li>\n<li>Define requirements for systems to support the procurement process and operations. Collaborate with IT teams to test and launch solutions.</li>\n<li>Manage outsourced vendors and processes, define service levels and ensure process compliance. Plan for scale effectively through productivity and automation efforts.</li>\n<li>Design reporting and perform analyses to drive effective process improvement, eliminate mistakes and provide quick fixes.</li>\n<li>Work across Finance and business stakeholders to gather requirements to optimize compliance, efficiencies, and user experience. Design, implement, and measure operational solutions.</li>\n</ul>",
    "title": "Project and Process Manager (Procurement Operations)"
}