{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckapKcbA7a3XrWguCb6APfd9K3FgYxFfj8QGSMwjt1iUSOgASYQ8wblXv3rUV-5CrYbObZZsILO6u_LZ3NMmFyqPY5xEcf3_oh6Jyqejb0L_hpdPIiXeqrg9PEtU%3D_V2&jobTitle=Production+Manager-+Talent%2FMusic+Rights%2C+Marketing+Operations&loc=US",
    "categories": [
        "LEGAL",
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-04T12:01:47.443Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p><p>The Marketing Operations team is responsible for identifying, building, and streamlining process optimization within Google’s Marketing Organization. As the Talent/Music Rights Operations Manager, you&#39;ll work closely with all Marketing Product Areas and associated agency partners to instill and create a process where talent rights are visible, secure, and easily accessible. Establishing new global processes you will also work closely with regional contacts and global/local Marketing teams.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103041793827709638",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-04T12:01:47.443Z",
    "publish_date": "2019-03-04T12:01:47.443Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree, or equivalent practical experience.</li>\n<li>6 years of experience working in business affairs or talent rights management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Law.</li>\n<li>Experience working in business affairs and/or contract management at the agency and/or client-side.</li>\n<li>Understanding of intellectual property rights gained from experience working in a marketing, advertising and/or agency environment.</li>\n<li>Knowledge of all aspects of SAG/AFTRA, ACTRA and AFM Union and contracts.</li>\n<li>Knowledge of talent payment guidelines of both foreign and domestic talent.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and oversee our centralized global talent/music rights processes and model.</li>\n<li>Manage and execute on launch plan while seeking further points of optimization and improvement.</li>\n<li>Outline and seek the adoption of new technologies Working closely on the incorporation and adoption of talent rights management into functionality.</li>\n<li>Manage relationships with marketers, agencies and talent payment vendors and develop a cohesive workflow that outlines roles and responsibilities for all partners.</li>\n<li>Serve as Industry expert for talent/music rights management in Marketing, staying abreast of relevant industry trends and best practices. Identify opportunities and leverages insight to solve challenges that scale globally.</li>\n</ul>",
    "title": "Production Manager- Talent/Music Rights, Marketing Operations"
}