{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYvdtTSOqlQHLcnriNCshRpDfpDMefZp8rz2VgSek0gSOgCPMA3Tqo-3qXsuQV5N1612AkOBO7hi77DZuEBLbv32W7PmdNyhoqwvaQkJ4IGH-AYTE5h4IyWgJCA%3D_V2&jobTitle=Associate+Product+Counsel&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:49:50.636Z",
    "description": "<p>As Product Counsel at Google, you work on the most exciting legal issues as disruptive technological innovations require creative and proactive legal guidance. You&#39;re part of a whip-smart group of in-house lawyers and the projects and cases you take on challenge you to think big and differently. You are collaborative -- ready to partner in initiatives that influence all aspects of the business and work with Googlers from all over the company. As an integrated part of the team, you proactively assess legal risks and advise on products that will not only move information into the 21st century, but move information law forward as well.</p><p>20th century laws don&#39;t always solve 21st century problems, and Google Legal crafts innovative approaches for handling some of the toughest legal challenges of the information age. Whether you&#39;re a patent attorney, an intellectual property expert or an engineer headed to law school, Google Legal lets you take on unanswered legal quandaries and create new precedents. Our innovative services raise challenging questions that demand creative and practical answers. We provide those answers by working at the crossroads of the law and new technology, helping Google build innovative and important products for users around the world.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5894091503894528",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:39:15.651Z",
    "publish_date": "2019-02-27T19:39:15.651Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>JD degree or equivalent degree.</li><li>3 years of attorney work experience in a law firm or in house legal department.</li>\n<li>Must be admitted to the bar in which position is located and in good standing or otherwise authorized to practice law (e.g., have registered in-house status) in the state in which the position is located.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of relevant work experience in a law firm or in-house legal department.</li>\n<li>Background in media, communications, intellectual property and contract law, as well as demonstrated litigation experience.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Ensure compliance with U.S. and international laws and regulations dealing with intellectual property, privacy, content regulation, consumer protection and advertising.</li>\n<li>Provide legal advice to teams from Engineering, Product Management, Advertising Sales, Marketing and Communications from the initial stages of product development to launch.</li>\n<li>Develop and maintain a repository of legal resources that are required for products, such as terms of service, privacy notices and other disclosures.</li>\n<li>Respond promptly to a wide range of legal requests from Engineering, Product Management, Advertising Sales, Marketing, Client Services and other business groups.</li>\n</ul>",
    "title": "Associate Product Counsel"
}