{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX9v6ohjZX3MtmNo_WiNKIiECXgAOrcnJCJQRWjZ0PgSOgASYQ8w0hUSSR6YnxMcJmjCpK00AgKTiJQ9XZkVvPqA7-SPTjjLAGiOLinskRU4v7BtEX4xj3x9bsw%3D_V2&jobTitle=Senior+Accountant%2C+Consolidations+and+Reporting&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-23T00:01:43.011Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s business objectives.</p>\n\n<p>As a Senior Accountant, you will support the Google Corporate Accounting organization. You will assist with Accounting Close and Consolidations process, system implementations, improvements, and maintenance as needed. Your experience in Accounting and Systems will be called for to work with cross-functional teams to define, build, and rollout innovative technology and business process solutions to increase efficiencies, reduce cost, improve customer satisfaction, and drive consistent processes. You will play a vital role in the Accounting team as we redefine our processes and systems. You will interface with business teams to assist in gathering and understanding their requirements, flow out the ‘as is’ and &#39;desired state&#39; business and process flows, dig into the details to understand the problem, coordinate requirements discussions, document requirements, and act as the liaison between the various business and technical teams.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5029620709621760",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:55:08.154Z",
    "publish_date": "2019-02-27T19:54:42.612Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Finance, Accounting, Management Information Systems, or equivalent practical experience.</li><li>5 years of experience in audit, general accounting, and/or accounting close processes.</li><li>5 years of experience with financial management systems, specifically in general ledger and FICO.</li><li>5 years of experience in consolidation and reporting.</li></ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA, CA or MBA and 6 years of experience in high-tech or consumer service industries and/or consulting firms with exposure to enterprise resource planning and accounting systems.</li>\n<li>Experience in accounting close processes and accounting systems. Track record of leading strategic projects.</li>\n<li>Experience working through finance management systems implementations, upgrades, regression testing processes, and end-use testing.</li>\n<li>Experience with business process definition, systems analysis, and systems design. Experience with consolidation and elimination.</li>\n<li>Ability to execute tactical project-level activities.</li>\n<li>Excellent analytical and business process re-engineering skills and attention to detail.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive business requirements and change management, implementing and maintaining new processes and changes in finance management systems.</li>\n<li>Lead cross-functional accounting projects. Define, implement, and maintain processes and procedures to support Google governance requirements.</li>\n<li>Execute on financial close processes on finance management systems.</li>\n<li>Influence executives and stakeholders to close gaps and initiate change.</li>\n<li>Identify, create, and improve processes that scale with Google’s growth.</li>\n</ul>",
    "title": "Senior Accountant, Consolidations and Reporting"
}