{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcvTHgDB_eVaB5JwjiW9tfYV07gmWeHPosQmtQvQM4USOgASYQ8wxU7XpDM7JsToMYQpHnbB0gxdEvRFWQZhS3DWG4c2VsC_ROLihvVuxrq4ulIuV0MHd9m6WKA%3D_V2&jobTitle=Partner+Engineer%2C+Machine+Learning%2C+Cloud+Global+Technology+Partners&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T18:31:40.899Z",
    "description": "<p>Google Cloud is building the next compute platform with a global reach and massive compute power for a new generation of enterprise computing and machine learning. As a member of the Cloud Partner Engineering team, you will support our partner ecosystem with your engineering expertise. You will engage with a wide range of machine learning technology providers to build AI solutions on our platform. You will be a technology enabler for our partners with product and engineering teams inside Google accelerating integration projects. Join the Global Technology Partner organization as we scale the partner ecosystem for Google Cloud and accelerate the global adoption of cloud technology! </p><p>Google&#39;s technology partners, like our users, span the globe and require Technical Solutions Consultants to keep the big picture in focus while being able to dive into the unique engineering challenges. As a Partner Engineer, you are responsible for working closely with Independent Software Vendors (ISVs) to architect and integrate solutions comprising of their products and services on Google Cloud Platform. You will liaise between ISV partners and our internal engineering teams to implement best practices and ensure the maintenance of these solutions which comprise of popular open source and commercial products. You are the resident technical expert to address partner needs with entrepreneurial drive and passion.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/109128364989522630",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:14.433Z",
    "publish_date": "2019-02-27T19:50:14.433Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Computer Science, Mathematics, related technical field or equivalent practical experience.</li><li>Experience with TensorFlow (Estimators, Keras, TFX). Experience fine tuning data/feature engineering, training models, and serving models in production.</li><li>Experience working with external partners and driving cross-functional technical projects.</li><li>Experience writing software in a language such as Java, Go or Python.</li></ul><br><p>Preferred qualifications:</p><ul><li>MS/PhD degree in Computer Science, Math or Engineering, or 5 years relevant experience in related field</li><li>Hands on experience with GCP or public cloud technologies like VMs, K8s, Data Warehouses, (e.g., Big Query) and Hadoop</li><li>Experience with CMLE, TPUs, Dataproc</li><li>Experience with MLFlow or AirFlow</li><li>Possess market awareness on ML players and understand their business strategy</li><li>Strong presentation skills and partner/customer focus mindset</li></ul>",
    "responsibilities": "<ul><li>Work closely with technology partners, to enable them to offer their technology and services on Google Cloud Platform</li><li>Develop partner solutions for Google Cloud Platform that use the best in architectural design, tooling and product best practices and contribute to partner engagements on strategy and design</li><li>Support Strategic Partner Managers with subject matter and technical expertise in partner and customer conversations and support Technical Program Managers by building solutions, demos and proof of concepts</li><li>Identify technical dependencies and roadblocks for the customer proactively and work with cross functional teams to remove them</li><li>Learn new technologies very quickly and apply them in real-world situations</li></ul>",
    "title": "Partner Engineer, Machine Learning, Cloud Global Technology Partners"
}