{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckc7ULwmmQ0hoBldi8tyuznCG0Att5Wisgjh_BUdDMhESOgASYQ8wJsA0gAKSzxKBdmlDGMW2v5V_nH8VwiX9-H4OcXiC6DU7dLYWFA7DCuldqhstUkVGkT3NDcs%3D_V2&jobTitle=Hardware+Test+Engineer%2C+Platforms&loc=US",
    "categories": [
        "HARDWARE_ENGINEERING",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T16:31:39.293Z",
    "description": "<p>Google&#39;s custom-designed machines make up one of the largest and most powerful computing infrastructures in the world. The Hardware Testing Engineering team ensures that this cutting-edge equipment is reliable. In the R&amp;D lab, you design test equipment for prototypes of our machinery and develop the protocols used to scale these tests for the entire global team. Working closely with design engineers, you give input on designs to improve our hardware until you&#39;re sure it meets Google&#39;s standards of quality and reliability.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/120853123062211270",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-06T16:31:39.293Z",
    "publish_date": "2019-03-06T16:31:39.293Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Electrical Engineering, Computer Science or equivalent practical experience.</li>\n<li>8 years of experience in an engineering lab environment.</li>\n<li>Experience with operating bench test equipment such as oscilloscopes, power supplies, network analyzers, etc. for electrical validation or troubleshooting.</li>\n<li>Experience with various hardware interfaces, such as PCIE, I2C, SPI, JTAG, MDIO.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Expert-level experience working with one or more technologies: DRAM, Flash, Optical Transceivers, high speed serdes.</li>\n<li>Experience developing and writing scripts in shell or Python for HW validation and test.</li>\n<li>Expertise in bench level HW validation using complex test equipment.</li>\n<li>Proficiency working in a Unix/Linux environment.</li>\n<li>Highly organized and very detail oriented.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Perform electrical characterization and validation of low and high speed circuits. Execute hardware qualification tests of complex server, network, and optical hardware.</li>\n<li>Write test plans to validate HW product performance in accordance to product requirements and specifications. Ensure coverage of all low level HW circuits, interfaces, and functionality.</li>\n<li>Launch and monitor scripts to control custom hardware with automated testing. Drive solutions for efficiency and efficacy in test execution. Perform data acquisition and data gathering reduction and reporting.</li>\n<li>Collect and analyze aggregated data to enable engineering decisions during HW R&amp;D, report on findings, reduce test data, and investigate test outcomes down to a hardware interface or component level.</li>\n<li>Work with hardware designers and SW/FW/diagnostics development teams to understand new project architectures and system components and to implement support required for test and debug efforts.</li>\n</ul>",
    "title": "Hardware Test Engineer, Platforms"
}