{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Raleigh, NC, USA; Durham, NC, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUD8fLYn_lPgIq0cYIBS1D1UB34aqcwjm5qJVpbisZwSOgCPMA3TwZqUbmeu1ouN390KNLFy1OIE8BTLGZn5vPSueHMlQVAhJW7GCRfwlG8y0l9AgIUZACqBzaY%3D_V2&jobTitle=Customer+Experience+Manager&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-14T11:01:45.119Z",
    "description": "<p>At Fiber, our mission is to create abundant internet on networks that are always fast and always open. Google Fiber provides superfast Internet to homes across the U.S. We want to bring Google Fiber to customers even faster, so we’re focused on making deployment more efficient and less intrusive.</p><p>Google Fiber is a service driven organization whose mission is to reinvent service in this industry. We are a group of passionate, hands on team members who aim to show our customers that they matter at every step of their journey with us. As a Customer Experience Manager, you will be responsible for managing our service levels, support channel strategy, vendor contracts and related performance.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5029339641872384",
    "location": {
        "address_lines": [
            "Raleigh, NC, USA"
        ],
        "city": "Raleigh",
        "country": "NC",
        "country_code": "US",
        "display": "Raleigh, NC, USA",
        "lat": 35.7795897,
        "lon": -78.6381787
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=518+West+Jones+St.&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=518+West+Jones+St.&size=1168x324&zoom=12&signature=0UtgfjxgWAmq8_aocUUjcnujfEw=",
        "large_2x": "/maps/api/staticmap?center=518+West+Jones+St.&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=518+West+Jones+St.&scale=2&size=1024x324&zoom=12&signature=Uu37reVpMfYDLVjYWO2OcB5WsI4=",
        "small_1x": "/maps/api/staticmap?center=518+West+Jones+St.&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=518+West+Jones+St.&size=600x400&zoom=12&signature=sU9Mgrqaiy9f1gCQhHA1HzyoDoQ=",
        "small_2x": "/maps/api/staticmap?center=518+West+Jones+St.&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=518+West+Jones+St.&scale=2&size=600x400&zoom=12&signature=f2wYrvS8CDKr_z74sb9TJBklq5o="
    },
    "modified": "2019-03-18T20:55:07.672Z",
    "publish_date": "2019-02-27T19:54:10.578Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree or equivalent practical experience.</li><li>7 years of work experience in direct management of contact centers, vendor management and service delivery.</li><li>Experience within the telco, ISP, cable or credit card industry.</li><li>Experience building/managing teams.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience with contact center tools (IVR, CRM, etc).</li><li>Experience in agreement negotiation/management.</li><li>Understanding and track record of delivering high-quality of service through third-party vendors.</li><li>Demonstrated analytical skills (writing queries, working with large data sets).</li><li>Self-starter with ability to work independently and on multiple initiatives simultaneously.</li><li>Demonstrated communication skills (written and verbal).</li></ul>",
    "responsibilities": "<ul><li>Manage Customer Experiences across all support channels (phone, email, social, chat).</li><li>Lead vision for channel strategy, vendor footprint and next generation service experience.</li><li>Manage the Vendor Managers who are responsible for all contact center KPIs including service level, CSAT, FCR, AHT, forecast adherence, etc.</li><li>Manage customer escalations and processes associated with timely and effective customer issue remediation.</li><li>Lead relationships and feedback from Metro/Market leadership to ensure desired market level experience is being delivered.</li></ul>",
    "title": "Customer Experience Manager"
}