{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckS5WYy9Ue4hd1hn_3ovXtu3_Sp74nQLJJxkfxNajRoQSOgCPMA3TkuUh2AWv79WC1dVyB6RWzKxGnQu-g9iz9Om0A7oQsbgseoDtICvbyaAyxduyMXlypnFSoz0%3D_V2&jobTitle=Technical+Program+Manager%2C+Experience+Design&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:03.143Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>As the Technical Program Manager for Experience Design, you will own the development of technical solutions and the execution of projects spanning various teams and products across Google for event centers and customer-facing spaces. You will also manage coordination and engagement between Experience Design (in-house and outsourced) and all Google teams. To be successful in this role, you will have the ability to lead deep technical discussions across multiple domain areas and to manage multiple projects internationally.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6444092134457344",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-02-27T19:50:41.591Z",
    "publish_date": "2019-02-27T19:50:41.591Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in driving project delivery while managing teams (i.e., AV/VC Engineers, Networking, Technical Support, Facilities, external vendors, architects, or general contractors) and users.</li>\n<li>5 years of experience with custom broadcast and pro-AV installation and integration in the Audio Visual industry.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years experience with custom broadcast, or media infrastructure installation and integration in the Audio Visual industry or similar technology space.</li>\n<li>Ability to travel up to 40%</li>\n<li>Creative problem-solving, analytical skills, agile under pressure, and impeccable business judgment.</li>\n<li>Proven vision, leadership, and strategic skills in prioritizing evolving initiatives in a fast-paced, high-tech environment; ability to translate ideas and capabilities into effective initiatives.</li><li>Detail-oriented and ability to produce and deliver executive presentations, produce project status reports, and communicate deliverables to all stakeholders and senior management.</li>\n<li>Excellent interpersonal and relationship-building skills across several diverse technical and non-technical groups.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Gather and translate business and functional requirements to establish technology options. Develop solutions based on demonstrated business needs.</li><li>Manage project planning and end-to-end project scope, including design, prototyping, delivery, and service model development.</li>\n<li>Develop budget estimates, project plans, schedules and comprehensive RACI charts.</li>\n<li>Be the translation point for all Experience Design engagements to all partner Google teams, such as Audio Video Engineering, Corporate Engineering, Network Operations, and Security Operations.</li>\n<li>Develop SVP-level presentations, providing project overviews, project plan, business justifications, and etc.</li>\n</ul>",
    "title": "Technical Program Manager, Experience Design"
}