{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUALIEM-9HY7uoeIC_MWCW9dMCvOCUzuSIjNa-Ud_l0SOgASYQ8wsxTk_wE2CwlN18oFtXwbQxppcA6JzR7LfkwaW3R3eoF-5wik-aRWSgSR1sLf3dcxIYruV3Y%3D_V2&jobTitle=Ads+and+Content+Manager%2C+Trust+and+Safety&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-22T18:01:41.292Z",
    "description": "<p>Trust &amp; Safety is tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. We use technical know-how, excellent problem-solving skills, and a deep empathy for our users to protect them from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team player with a passion for doing what’s right. You work globally and cross-functionally with Google developers and product managers to identify and fight abuse and fraud cases at Google speed (read: fast!). And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p><p>Our Trust and Safety team is responsible for protecting and respecting Google&#39;s users by ensuring online safety in both core and emerging areas. This includes fighting abuse and fraud across Google products. We are also tasked with raising the bar on content, including coherent policies across platforms focusing on brand safety, controversial content, violent extremism, and political interference all with the goal of advancing the ways we protect our users</p><p>As an Ads and Content Manager, you’ll lead a team, be a thought leader, and collaborate with many teams both within and outside of Trust and Safety. You will partner with Engineering, Product Area, Legal, Policy and Vendor Operations to drive operational performance and lower abuse rates. You will enable effectiveness and efficiency by providing thought leadership, execution excellence and people management guidance to deliver cross-functional initiatives at scale.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5877374474289152",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:43:43.092Z",
    "publish_date": "2019-02-27T19:43:43.092Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in Technology or equivalent practical experience.</li>\n<li>8 years of experience working in an Operations, Program Management or Management Consulting capacity.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Leadership and people management experience with a focus on hiring, mentoring and retaining talent.</li>\n<li>Experience in managing strategic programs that span multiple organizations and have a direct measurable business impact.</li>\n<li>Effective analytical and problem solving skills, with the ability to think logically and work effectively in a fast paced and constantly evolving environment.</li>\n<li>Excellent communication skills, with the ability to effectively influence and communicate cross-functionally and cross geographically with all levels of management.</li>\n<li>Demonstrated ability to synthesize information and see the big picture.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the Trust and Safety Ads team in Sunnyvale, overseeing hiring and retention, performance management, coaching and mentoring, and team deliverables, and serve as a thought leader for the broader Trust and Safety Ads global management team.</li>\n<li>Direct strategies for Ads by identifying and researching opportunities, setting strategic goals, and building teams to deliver on them.</li>\n<li>Manage multiple cross-functional projects simultaneously by developing plans, gathering and synthesizing relevant data, leading analyses and developing final recommendations, engaging stakeholders to ensure alignment on objectives and key results.</li>\n<li>Measure impact and establish metrics for programs that often focus on harder-to-measure intangibles — and use this data to make informed decisions about what steps to take next.</li>\n</ul>",
    "title": "Ads and Content Manager, Trust and Safety"
}