{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTAmrdxJXvk2wlDWCo09iUT70Q6qv3Om01PwpOE8JIQSOQASYQ8w7vwkfezyJF_CLM0ruHnD7-k9Hk6YbSGGL5OKq5AWtWejwlOqTq4HQg1Q-cb_nUdFULS5TQ%3D%3D_V2&jobTitle=Program+Manager%2C+Data+Center+Finance&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T15:31:39.045Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Google&#39;s infrastructure needs go far beyond server computers. As Google&#39;s products and services scale the globe, the Energy and Location Strategy team works behind the scenes to secure infrastructure for Google&#39;s future -- space and power for data centers globally. As a Data Center Finance Program Manager, you will be responsible for building and maintaining our cost models, running comparative analytics, tracking and analyzing spend, identifying opportunities for cost reductions and modeling new infrastructure financing approaches. This role helps enable cost-effective solutions that support Google&#39;s infrastructure growth. You will focus on creating new frameworks and providing the analytical support for Google’s global data center acquisition and site selection work.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/87436263025451718",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:48:52.054Z",
    "publish_date": "2019-02-27T19:48:52.054Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Finance, Economics, Business, Real Estate, Engineering or equivalent practical experience.</li>\n<li>4 years of analytical, quantitative and technical/computer experience developing and building finance model scenarios.</li>\n<li>Ability to travel 25% of the time as required.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with industrial or data center REITs (acquisition, development, acquisition, or divestiture), wholesale colocation, site selection for high-technology and industrial-scale projects.</li>\n<li>Experience with alternative real estate transaction structures, approaches, and best practices, and related development processes.</li>\n<li>Experience with data center and colocation industry, industrial class electrical and cooling technology, power transmission/distribution, telecommunications infrastructure and/or other related areas.</li>\n<li>Experience working internationally.</li>\n<li>Track record of developing innovative transaction structures.</li>\n<li>Excellent time management and organizational skills, with ability to handle multiple priorities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead financial analysis and project management activities for key projects and initiatives.</li>\n<li>Interact with diverse technical and non-technical groups spanning all organizational levels.</li>\n<li>Develop strategic financing structures, project management from start to finish and handle multiple priorities and complex projects simultaneously.</li>\n<li>Devise and model complex analytical and quantitative scenarios, build out pro-formas and develop compelling executive presentations.</li>\n<li>Identify, develop and implement process/system improvements and drive optimization. Come up with commercially and technically creative solutions, working independently and thinking dynamically in an ambiguous environment.</li>\n</ul>",
    "title": "Program Manager, Data Center Finance"
}