{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZU3-3KN7Cxfr1Q7cWLjOanx-YR1rUHp60fqmCr_0xISOQASYQ8wEJ3w10AQ-sw4Pp-7CZ5kaPXEiaNx5eH08KwVeeVAqt17l5fR_8fhuywi-uc9vlbN-feIaA%3D%3D_V2&jobTitle=Strategic+Operations+Analyst%2C+Vendor+Operations%2C+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-05T16:01:50.807Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n\n<p>In this role, you&#39;ll lead complex, multi-disciplinary projects, identify and implement process improvements, and exercise business and technical understanding to drive long-term objectives. You&#39;re a big picture thinker and strategic leader, you&#39;ll plan requirements with stakeholders, and usher projects through the entire project lifecycle. \n</p>\n\n\n<p>You&#39;ll understand the user&#39;s point of view and are passionate about using your combined technical, sales and customer service acumen to protect our users. You&#39;ll work on a global cross-functional team to help build new solutions to make our platforms safer. \n</p>\n\n\n<p>You have a keen eye for providing thought leadership by using problem-solving skills and excellent business judgment. You&#39;ll define and develop ideas by running experiments and track output quality. \n</p>\n\n\n<p>You thrive in ambiguity, are able to articulate clear quantifiable goals and break down large projects/processes into sub-projects/processes to develop an analytical roadmap for Google products.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/81979130326721222",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-05T16:01:50.807Z",
    "publish_date": "2019-03-05T16:01:50.807Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Mathematics, Economics, Statistics, Operations Research, or related fields involving quantitative analysis and research, or equivalent practical experience.</li><li>4 years of experience in business analytics and operations modeling.</li><li>4 years of experience working with SQL and database querying and analysis.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience in research and data modeling.</li><li>Experience developing and managing projects and collaborating with teams across geographies and functions. Ability to work in a fast-paced, constantly evolving team environment.</li><li>Knowledge of commercial and emerging reporting tools and technologies for better data visualization.</li><li>Demonstrated understanding of BI technologies and their application, including SQL-based database warehousing and dashboarding experience.</li><li>Capable of translating analysis results into business recommendations.</li><li>Excellent written and verbal communication skills.</li></ul>",
    "responsibilities": "<ul><li>Gather and analyze large datasets to track metrics (e.g., quality, productivity, efficiency), identify risks and highlight opportunities for improvement. Maintain and improve existing dashboards.</li><li>Develop insightful solutions to address complex strategic and operational challenges. Evaluate the impact of proposed changes, pay attention to scalability and sustainability over time.</li><li>Communicate findings and recommendations to a diverse set of stakeholders, leveraging data to tell a clear and compelling story.</li><li>Perform actionable quantitative analyses and develop new quantitative methods and metrics for tracking resilience and bias that can be replicated across the organization.</li><li>Design, build and maintain quantitative business models to measure and support better operations management, and develop timely trainings to reduce bias for ML and workforce initiatives.</li></ul>",
    "title": "Strategic Operations Analyst, Vendor Operations, Trust and Safety"
}