{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckcJlZ55M_3ec_9RfqJEVhn9agQQ2WY4mlGP_B7lAaIYSOgCPMA3Tp7zHktNTh-i69Gf2BMbaaBrTXR-lwqin7JPBmGwFzr5sZPbLJy61kOdWCdKJXs-mXRUjlNM%3D_V2&jobTitle=Lead+Retail+Brand+Manager%2C+Retail+Marketing&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-06T21:31:45.803Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a loyal consumer base. This means you work with a cross-functional team across sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>As the Lead Brand Marketing Manager, you&#39;ll lead a team of Retail Brand Managers to deliver the best possible consumer experience of the Google hardware brand in third-party retail. Overseeing the brand, you will ensure global consistency across in-store and digital marketing executions. You will guide both retail partners and internal cross-functional teams to deliver marketing at scale.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5714554595901440",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:31.659Z",
    "publish_date": "2019-02-27T19:52:31.659Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>8 years of experience in brand marketing.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in retail marketing and/or an understanding of the retail landscape.</li>\n<li>Familiarity working within a creative department.</li>\n<li>Demonstrated ability to deliver, own and lead work with minimum guidance. Self-motivated, with communication and leadership skills.</li>\n<li>Ability to balance working in a creatively-driven organization, with an analytical and disciplined approach to marketing. Proven ability to navigate ambiguity and work in a fast-paced, deadline-driven, technical work environment.</li>\n<li>Ability to work effectively on a global team and across geographies, proactively establishing credibility, collaboration and influence.</li>\n<li>Excellent creative problem-solving and execution skills, with high attention to detail. Ability to identify solutions that work for multiple stakeholders.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead a team of global and regional Retail Brand Managers for the Google Hardware brand, with the goal of driving global consistency in retail.</li>\n<li>Manage the Retail Toolkit (an online hub for retail and carrier partners) to obtain templates, assets and brand guidelines for retail executions globally. Oversee all aspects of the Retail Toolkit web experience, including website development and content updates.</li>\n<li>Oversee studio production of Retail Toolkit assets for Google Hardware. Deliver localized marketing materials for new product launches and creative refreshes, working with cross-functional teams including Creative, Go-To-Market, Product Marketing, Legal and regional teams.</li>\n<li>Identify gaps in brand guidelines and marketing assets to support retail executions at scale. Advise cross-functional partners with thoughtful, data-driven solutions that continue to deliver positive consumer perceptions of Google Hardware, while meeting the objectives of retail and carrier partners.</li>\n<li>Own day-to-day management of agency relationships and budgets.</li>\n</ul>",
    "title": "Lead Retail Brand Manager, Retail Marketing"
}