{
    "application_instruction": "<b>This role may also be located in our Playa Vista, CA campus.</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbbTeSxRVkmarjtvFjjOMn6jvAP5cWNV6a4_4A3EeysSOgCPMA3TyAdfCKevfrK2jZ0wJmbsXyqQ5i6hflov3Pz_Dz_-paJs8RBc7YoV_MiJmzQ0ckzlOiDcT2k%3D_V2&jobTitle=Strategic+Partner+Manager%2C+Film%2C+TV+Distribution%2C+Licensing%2C+YouTube%2C+Google+Play&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "PARTNERSHIPS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-01-24T17:02:03.021Z",
    "description": "<p>As the Strategic Partner Manager for Film/TV Distribution and Licensing, you will build and maintain relationships with some of our most strategic film studio and TV network partners, and lead content licensing agreements across various distribution windows including transactional (TVOD), subscription (SVOD), and ad-supported (AVOD). </p>\n\n<p>In this high-visibility role, you will manage agreements and strategic relationships with film studios, television broadcast/cable networks, and other prominent content providers relating to content distribution and licensing within the entertainment vertical for Google Play and YouTube.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5296236116606976",
    "location": {
        "address_lines": [
            "Los Angeles, CA, USA"
        ],
        "city": "Los Angeles",
        "country": "CA",
        "country_code": "US",
        "display": "Los Angeles, CA, USA",
        "lat": 34.0522342,
        "lon": -118.2436849
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=1168x324&zoom=12&signature=fXRbaDAJUcl_n404VGXhz3cu-ag=",
        "large_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=1024x324&zoom=12&signature=B8IUulSshv-3RzKj_Nyk8FPOXUs=",
        "small_1x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&size=600x400&zoom=12&signature=QGgFwn7c6rmdqNJ6DzYmX6KMU2g=",
        "small_2x": "/maps/api/staticmap?center=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=340+Main+St%2C+Venice%2C+CA+90291%2C+USA&scale=2&size=600x400&zoom=12&signature=TH_gDtTJHy22kPuDOsdMJxqBUM4="
    },
    "modified": "2019-03-14T20:31:53.368Z",
    "publish_date": "2019-03-14T20:31:53.368Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of work experience in relevant field.</li>\n<li>Experience in business development, strategy, and agreement negotiation at a studio, network, or scaled digital entertainment service.</li>\n<li>Experience in Film/TV.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, Master&#39;s degree, Juris Doctor, or PhD.</li>\n<li>Understanding of TVOD, AVOD and TV distribution content licensing models as well product and legal complexities related to agreement negotiations.</li>\n<li>Ability to thrive in a matrixed organizational and to collaborate with and influence cross-functional teams.</li>\n<li>Ability to quickly grasp complex legal agreements and work with attorneys and other colleagues to negotiate agreements on tight timelines.</li>\n<li>Ability to quickly grasp complex legal agreements and work with attorneys and other colleagues to negotiate agreements on tight timelines.</li>\n<li>Excellent analytical, data modeling, and formal corporate presentation building skills.\nPassion for film and TV content.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead and create agreements for content distribution as we expand our footprint across territories.</li>\n<li>Develop effective, high-level relationships with key partners. Manage partner relationships with a focus on growth activities.</li>\n<li>Be a thought leader on the evolving content distribution space and advocate and influence internally across the organization on behalf of partners and opportunities.</li>\n<li>Develop and execute business strategy, working closely with Product, Operations, Marketing, Promotional, and Publicity leads as well as strategic managers in other markets.</li>\n<li>Define, model, execute against, and analyze key business metrics.</li>\n</ul>",
    "title": "Strategic Partner Manager, Film, TV Distribution, Licensing, YouTube, Google Play"
}