{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSrcE4Gvhc3K1M95fS2VCwNfVayQk4o8yiEQV69DVGkSOgASYQ8whSWfvfdydpc7C_Xg3z_qTu2l36THNJUPW7K2Gk5HGMLvu_P7O08I5EWV6HBNe0dW-aQQo0Q%3D_V2&jobTitle=Program+Manager%2C+Strategy+and+Operations%2C+Hardware+Partnerships&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-21T21:31:52.630Z",
    "description": "<p>Google&#39;s line of products and services to clients never stops growing. Strategic Partner Managers have the rare opportunity to build a long-lasting relationship with our top partners. You cultivate these existing partnerships to make sure they can take full advantage of Google&#39;s ever-growing suite of offerings. You possess strong relationship-building skills and are apt to see mutually beneficial opportunities with partners in order to best represent our users, products and programs.</p>\n\n\n<p>The Strategy and Operations team supports the Hardware Partnerships organization by providing strategic guidance and scaled support needed to enable the growth of our business. As a Program Manager, you will play a critical role in developing, driving, and delivering employee engagement programs from ideation through to launch, always looking for feedback and ways to improve. In this role, you will manage a wide range of projects from ensuring our team site is up to date to new program implementation. You enjoy hoping others and working across teams, demonstrating excellent attention to detail and written communication skills.</p><p>The Hardware Partnerships team was formed with the purpose of bringing the best of Google’s software and hardware to our users by bringing to market and distributing a Google-branded hardware portfolio. The team is responsible for managing all partnerships with carriers, retailers and resellers worldwide. This includes the partnerships for products such as <a href=\"https://www.blog.google/products/pixel/introducing-pixel-our-new-phone-made-google/\">Pixel</a>, <a href=\"https://vr.google.com/daydream/smartphonevr/\">Daydream View</a>, <a href=\"https://www.blog.google/products/google-wifi/introducing-new-kind-wi-fi-system/\">Google Wifi</a>, <a href=\"https://nest.com/thermostats\">Google Nest Thermostat</a>, <a href=\"https://www.blog.google/products/chromecast/fastest-chromecast-yet-4k-and-hdr-support/\">Chromecast Ultra</a> and <a href=\"https://madeby.google.com/home/\">Google Home</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/79646285688120006",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:56:42.935Z",
    "publish_date": "2019-02-27T19:56:42.935Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in tech or media, with a focus on writing and program management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Ability to effectively lead and work with cross-functional groups.</li>\n<li>Ability to simultaneously manage multiple tasks and meet goals, demonstrating a positive attitude and work ethic.</li>\n<li>Ability to adapt and travel as needed.</li>\n<li>Ability to work calmly and maintain good judgment in fast-paced, high-stress environment.</li>\n<li>Excellent attention to detail and organizational skills. Excellent communication and interpersonal skills.</li>\n<li>Excellent writing, problem-solving, and project management skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage internal and external communication channels for the Global Hardware Partnerships, including but not limited to All Hands, executive presentations, roundtables, etc.</li>\n<li>Distill complex subjects into coherent and easy-to-understand language and presentations.</li>\n<li>Partner closely with leadership and cross-functional teams to develop new employee communication programs, channels, and content.</li>\n<li>Partner closely with the Administrative team to coordinate and execute logistics around events on hot topics and ensure global email aliases are up to date.</li>\n</ul>",
    "title": "Program Manager, Strategy and Operations, Hardware Partnerships"
}