{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWZcOMasPMvkQVOfas61AM6E88We50-EzSS4OKiaRH0SOgCPMA3T8VPJH9q_OhAeSGriK1UjFV47J8IdiiZiKJt9s2gAKLqSjxOxcWGQTYIno3Mp-BbJehri4IE%3D_V2&jobTitle=Employee+Relations+and+Investigations+Partner&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:04.309Z",
    "description": "<p>People Operations strives to revolutionize human resources the same way that Google has revolutionized search. We are helping to find, grow and keep the remarkable assemblage of talent who are our Googlers. You&#39;ll be an advocate of Google&#39;s culture and values, partnering with our business leaders to help them build their organizations and make sure all people decisions are based on data. Whether coaching your clients on how to lead their teams, navigating and resolving employee relations issues or managing programs that help develop our Googlers, you are exceptionally focused on putting them first, and being as clear and transparent as possible to help Googlers understand how people decisions get made.</p>\n\n<p>As an Employee Relations Partner, you will be part of a central team that works in conjunction with our partner groups: People Partners and Consultants, Integrity, Ethics &amp; Compliance, Security, Internal Audit and Employment Legal.  You will advise on and conduct investigations. In addition, you will advise on a variety of employee relations issues, including advising HR and managers on Google’s policies, practices, how to address workplace issues, organizational development, reorgs, performance management, coaching/development, and compensation. Using your knowledge of applicable employment laws as well as our policies and practices. You will devise, follow and advise on appropriate protocol for employee relations issues and investigations and develop appropriate investigation documentation and recommendations for management. This is an individual contributor role.</p><p>Great just isn&#39;t good enough for our People Operations team (you probably know us better as &quot;\u0098Human Resources&quot;). Made up of equal parts HR professionals, former consultants and analysts, we&#39;re the advocates of Google&#39;s colorful culture. In People Ops, we &quot;find them, grow them, and keep them&quot;\u009d - we bring the world&#39;s most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5893019922530304",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-12T17:31:42.843Z",
    "publish_date": "2019-03-12T17:31:42.843Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>4 years of Employee Relations/Investigations experience gained in either an HRBP role, Employee Relations Advisory role, or equivalent experience as an employment attorney practicing employment law.</li><li>Experience dealing with employment law principles and conducting and advising on investigations.</li></ul><br><p>Preferred qualifications:</p><ul><li>JD with employment law focus and/or experience.</li><li>Experience advising on a wide range of employee relations issues, including reorganizations and performance issues.</li><li>Proven project management skills with demonstrated ability to manage global projects.</li><li>Ability to establish strong cross-functional relationships at all levels and geographies.</li><li>Strong analytical and problem solving skills with ability to organize and analyze data.</li><li>Ability to listen, but also to persuasively convey opinions and recommendations both in speaking and writing.</li></ul>",
    "responsibilities": "<ul>\n<li>Provide advice and counsel on general employee relations issues.</li>\n<li>Partner with People Partners and Consultants and other Investigations teams to ensure that investigations/disciplinary processes are handled in a fair, timely manner consistent with local requirements; assess and document local best practices for investigations, reorgs and performance management; maintain storage and access of this information for internal users; and ensure that U.S. based investigations are thorough and include: understanding of the allegations; appropriate interviews, analysis and documentation; and recommendations for conclusion and course of action</li>\n<li>Provide project management coordination and guidance for People Partners, Consultants and managers on reorgs</li>\n<li>Prepare, track and maintain appropriate investigation and reorganization data and documentation</li>\n<li>Develop and provide training and guidance to People Partners, Consultants and managers regarding employee relations issues, investigations, reorgs and managing performance, localizing existing training materials where applicable.</li>\n</ul>",
    "title": "Employee Relations and Investigations Partner"
}