{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckT94lgbwWyqc_CbzQwQ4oBtiCeShu_LI-D---5sfHsASOgCPMA3Tie0uVjUnhMY_3mDKwegJaQB7sMYB4Q1KDI5Vku7uxIq0d5-XoPmODT6WWbAUAVVHLu05SkI%3D_V2&jobTitle=Internal+Communications+Manager%2C+People+and+Culture&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-19T17:32:28.317Z",
    "description": "<p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns; engage in face-to-face meetings with commentators and other opinion formers; and develop print and web-based material supporting these campaigns. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.</p>\n\n<p>As a member of the Internal Communications team, you&#39;ll be part of a small team that produces employee communications and events for Googlers and executives. You&#39;ll work closely with internal communications teams, leaders and partner with teams in our People Operations organization to - lead on internal people and culture, strategic communications campaigns, come up with innovative ways to engage employees that are in tune with Google&#39;s culture, and write communications, business update presentations, and talking points.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be a creative self-starter who is willing to try new things and can manage numerous projects with tight deadlines. Things happen quickly at Google, and to do great work you need to be an enthusiastic team player who can work cross-functionally with partners across PR, comms, marketing, product and beyond.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6616065702166528",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:52:46.278Z",
    "publish_date": "2019-02-27T19:52:46.278Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of experience in a tech, media, government or non-profit environment; with a focus on writing and strategic communications.</li>\n<li>Experience with writing and executive/principal support on people and culture issues.</li>\n<li>Must have work authorization in United States.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience in, or familiarity with the field of human resources.</li><li>Demonstrated ability to work calmly and maintain good judgment in fast-paced environments.</li><li>Effective team player, with the ability to lead strategic cross-cutting communication narratives for multiple audiences.</li></ul>",
    "responsibilities": "<ul><li>Develop creative strategies for communicating to employees by planning the frequency of, and vehicles for, communications and coordinate across different areas of the business and the company.</li><li>Coordinate and execute logistics around events on hot topics, email aliases and internal reorganizations.</li><li>Project manage internal communications, strategic plans, and initiatives from beginning to end.</li><li>Interact with and influence executives, and provide advice that reflects an understanding of their business and leadership style.</li><li>Develop, write, and edit communications for our company-wide channels, including organizational and product narratives, speeches, emails, articles and slide presentations. Distill complex subjects into coherent and easy-to-understand language.</li></ul>",
    "title": "Internal Communications Manager, People and Culture"
}