{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Cambridge, MA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckS3tUdAH6pFgC6AM-JQ76sM-VcHJvooDQfFN56TgNMUSOgASYQ8woMYWkmmGMjRFoSJil3JAYT_751qsZ-qI6xthzcfTHEzBD-1Fkl6MRFAmTxLOJZdXpHbQtz4%3D_V2&jobTitle=Instructional+Designer%2C+Mastery+Team&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-11T22:31:46.339Z",
    "description": "<p>The Business Strategy and Operations organization provides business critical insights using analytics, ensures cross-functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>As a member of the Mastery team, you will be critical to helping Google&#39;s Sales teams succeed. You will work as part of this team to deliver excellent product training in a creative and exciting way. You will develop innovative and engaging training programs at scale and customize where appropriate (e.g., for role, location, situation, etc). In addition to this, you&#39;ll also partner with content and skills experts to bring a cohesive development experience to our Global Business Organization (GBO) Googlers.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/74471983430935238",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-02-27T19:56:03.467Z",
    "publish_date": "2019-02-27T19:56:03.467Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree with a Certificate in Instructional Design or equivalent practical experience.</li>\n<li>Experience with e-learning frameworks such as Adaptive Learning, ADDIE, CCAF, or other learning development approaches.</li>\n<li>Experience in designing, developing and testing eLearning content. Experience with multiple authoring tools (e.g., Adobe Captivate, Lectora, Articulate Storyline, Adapt, Camtasia, etc.).</li>\n<li>Ability to travel in order to conduct and oversee programs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Hands-on experience developing original learning products in HTML5 or other development languages/environments.</li>\n<li>Experience writing and designing sales training materials (either product or soft skills training) for either in-person or online delivery.</li>\n<li>Experience designing learning programs (or online media) in the digital marketing industry. Experience making e-learning exciting, fun and social. Indepth knowledge of current and emerging adult learning theory and how it is put into practice in corporate learning.</li>\n<li>Experience in project management, with the ability to multi-task and advance activities across multiple concurrent workstreams.</li>\n<li>Ability to build relationships and to collaborate with effectively across functions and levels. Clear understanding of business needs and sensitivity to differences across various groups.</li>\n<li>Ability to communicate complex concepts concisely and clearly. Excellent editing, writing, and critical reasoning skills; demonstrated interpersonal and communication skills and presence.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with stakeholders and subject matter experts (SMEs) in order to understand business needs and translate them into learning and performance objectives.</li>\n<li>Serve as the central point of contact and provide feedback, support and direction to external vendors who are building learning assets or products for our team.</li>\n<li>Update and maintain existing content on an ongoing basis. Curate existing content to create new learning designs and paths. Upload learning solutions into the learning management system (LMS) and test complete solutions in target environments when required.</li>\n<li>Lead content collaboration with stakeholders, problem-solving initiatives to achieve performance objectives, and resolve issues, risks and quality challenges.</li>\n<li>Work with SMEs and stakeholders to facilitate approvals and gain alignment on content direction, design and details.</li>\n</ul>",
    "title": "Instructional Designer, Mastery Team"
}