{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Cambridge, MA, USA; New York, NY, USA; Boulder, CO, USA; Chicago, IL, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdz5i-jNcb3HYQFqLiQhktMMobaTGpxUXrzd4XstqagSOgASYQ8wJ5sDEYgKCWpVzHN5yehRAiOtyE7yuaVlL8u1nSLKmXOoO5hpDqtaHF_jB88eyhuZ_RP559o%3D_V2&jobTitle=Strategic+Real+Estate+Planner&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-07T10:31:53.102Z",
    "description": "<p>As a Strategic Real Estate Planner, you&#39;ll enable business decisions across the entire Americas region. You will support Google&#39;s physical expansion as you forecast and plan scenarios to help develop and drive real estate decisions. You will leverage your data, insights and problem solving skills to develop and present scenarios to stakeholders that optimize our real estate portfolio and meet the needs of our internal clients. \n</p>\n\n\n<p>You will work closely with cross-functional partners including Transactions and Construction teams, Facilities Managers, and Business Partner (BP) teams to anticipate and understand the requests coming from different client groups, assess the space options available and suggest solutions that take into account competing priorities and requests.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/86458331318624966",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-03-07T10:31:53.102Z",
    "publish_date": "2019-03-07T10:31:53.102Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a quantitative field, or equivalent practical experience.</li>\n<li>7 years of experience working in real estate strategy and consulting or data analysis and visualization.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in presenting complex data to regional leads, customers and business partners, and creating compelling narratives through data.</li>\n<li>Experience with forecasting methodologies and basic statistical analyses, including correlations, linear and logistic regression, etc.</li>\n<li>Experience in manipulating and curating large, complex data from a variety of systems and creating visualizations that surface business insights. Familiarity with data analysis and visualization, including SQL or other query languages.</li>\n<li>Ability to gather and synthesize data from various systems in HR, Finance and other departments and build ad-hoc data models.</li>\n<li>Ability to convey complex concepts and solutions to all levels of an organization. Demonstrated problem-solving and analytical skills combined with excellent communication skills.</li>\n<li>Excellent planning skills, including attention to detail, data/information organization and comprehensive communication across many teams.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Apply analytical skills to plan and forecast real estate space requirements based on growth projections from the business, People Operations, local input and historical trends.</li>\n<li>Analyze various growth scenarios and supply solutions and advise on best outcomes.</li>\n<li>Develop relationships with regional real estate teams, finance and other teams. Act as a trusted source for real estate information in the Americas region, working with planners to enable cross-functional and cross-geographical knowledge sharing.</li>\n<li>Maintain trustworthy and impeccably reliable forward-looking portfolio data. Commit to accuracy and thoroughness in all aspects of data collection and curation.</li>\n<li>Build an understanding of budget, financial analysis and financial governance.</li>\n</ul>",
    "title": "Strategic Real Estate Planner"
}