{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdwc2h-tF9-k3fgAdK5Hk0XFJM64TIRaETBZd51BQT4SOgCPMA3T-Ho18zzMv-rWh-XA1zeG7mY4ooHi3Zqigd9wLx5hQxgFbAVxS7Gw0cuEHKLdgehDmaOlqOc%3D_V2&jobTitle=Program+Manager+Forecasting+Lead%2C+Google+Express&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:04:28.576Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>The primary objective of the Google Express Forecasting Team is to efficiently convert inputs and insights from qualitative and quantitative sources into relevant, accurate forecasts. As a Program Manager Forecasting Lead, you will lead team members in designing and implementing technical solutions that support forecasting accuracy, speed and insight.</p><p>Users come first at Google. Nowhere is this more important than on our Advertising &amp; Commerce team: we believe that ads and commercial information can be highly useful to our users if, and only if, that information is relevant to what our users wish to find or do. Advertisers worldwide use Google Ads to promote their products; publishers use AdSense to serve relevant ads on their website; and business around the world use our products (like Google Shopping, and Google Wallet) to support their online businesses and bring users into their offline stores. We build and maintain the platforms that have made Google what it is today, and are constantly innovating to deliver the most effective advertising and commerce opportunities of tomorrow.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5069628281913344",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:57:33.688Z",
    "publish_date": "2019-02-27T19:43:37.135Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s in Mathematics, Statistics, Computer Science, Operations Research or other relevant quantitative field, or equivalent practical experience.</li>\n<li>5 years of work experience in an analytical and business leadership role in a fast-paced/startup environment.</li>\n<li>2 years of work experience in SQL and large scale data analysis.</li>\n<li>2 years of work experience in an analytical and analytics management role, in forecasting, business analytics, Sales and Operations Planning (S&amp;OP) and/or management consulting.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree.</li>\n<li>Ability to self-start and self-direct work in an unstructured and fast-paced environment; comfort dealing with ambiguity.</li>\n<li>Demonstrated analytical and problem solving skills. Attention to detail and operational mindset.</li>\n<li>Developed communication skills (written and verbal).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead Google Express’ weekly S&amp;OP process. Collaborate with Growth, Marketing and Operations teams to establish long-term volume targets, and provide thought leadership in coordinating operational capacity planning. Build awareness and gain buy-in over volume planning processes and create transparency cross-functionally.</li>\n<li>Work with leadership and external teams to understand forecasting user requirements and business changes that affect the forecasting team. Work with analyst teams to understand the feasibility and complexity of these requests and prioritize according to level of effort and impact.</li>\n<li>Lead forecasting analysts to generate, analyze, modify and publish weekly forecasts of Google Express market demand over time. Lead continuous improvement effort to improve publishing speed by designing and developing automation to replace repeated manual work. Identify, propose and drive implementation of forecasting system changes to address changes in business and technical requirements.</li>\n<li>Work with cross-functional partners to collect and synthesize quantitative and qualitative data, propose and implement improvements to existing processes, and create scalable solutions to address forecasting problems. Lead forecasting analysos to build technical solutions that apply learnings from prior forecast errors to improve future-looking forecasts.</li>\n<li>Work with data scientists to develop and improve our automated forecasting systems, including applying statistical and other analytical techniques to improving system performance (i.e. efficiency and forecast accuracy).</li>\n</ul>",
    "title": "Program Manager Forecasting Lead, Google Express"
}