{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckbyIZDFrndELFEctzIIiasYi2t0Uoo07Q0vXF68xcccSOgASYQ8wjg9Xq1u0TitiAjoHw0hJlOjN8Eam3XPcFC4DuRn7hZWVREFoKDyuZeMwtrfsoGclik6FPSk%3D_V2&jobTitle=Executive+Sponsor+Program+Manager%2C+Customer+Programs%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-11T17:32:00.324Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n<p>As the Executive Sponsor Program Manager at Google Cloud, you will build and drive an engagement model for impactful relationships at the executive level across the business. The development and execution of this program in collaboration with the Enterprise Sales and Account Management are critical to the long-term success of Google Cloud. For stronger relationships and partnerships with our most important customers at the executive level, you will build programs that establish the expected trust and transparency for our partners and that ensure engagement with customers at the most optimal time in their journey with Google Cloud. Your ability to collaborate across multiple stakeholders (Sales, Account Management, and executives), determine strategies for optimal results, identify best methods of engagement, and build lasting partner relationships are key to success in this role.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/104497802505003718",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-11T17:32:00.324Z",
    "publish_date": "2019-03-11T17:32:00.324Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience working in a program/project management role.</li>\n<li>Experience in building programs, including cross-collaborating with multiple departments and teams and driving operational efficiency to optimize for the customer experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>7 years of experience in a project/program management role for a cloud area.</li>\n<li>Experience in working collaboratively across Product, Marketing, Engineering, Customer Success and Sales teams.</li>\n<li>Experience in generating customer and business insights.</li>\n<li>Knowledge of cloud computing solutions.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build the framework and playbook to execute the global Executive Sponsor Program. Create processes to help create, scale, and measure customer offerings for trusted executive relationships with our top strategic customers.</li>\n<li>Develop strong strategic relationships and rapport with senior leadership in Sales, Customer Experience, and cross-functional leadership teams.</li>\n<li>Develop a cross-functional strategic customer CEO board to advise executives across Alphabet on business strategy.</li>\n<li>Work with cross-functional teams to provide insight to strategic customers about the value assessment and investment of their engagement with Google.</li>\n<li>Drive operational efficiency to ensure success of the engagement model and scale the model to drive broader reach within our strategic account list.</li>\n</ul>",
    "title": "Executive Sponsor Program Manager, Customer Programs, Google Cloud"
}