{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Austin, TX, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZGkRLwvsdqMOnISS51O7gZp21kIPAayjKXY1Idhy8YSOQASYQ8wnFiw3Ed0e7X6FmltfHkg8cUoFceHx2PQTtNFDGLDCZ64LvAAD51M9JMsENBpbu1ZPNMq-w%3D%3D_V2&jobTitle=Strategy+and+Operations+Lead%2C+Google+Cloud+Support&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-12T19:01:54.340Z",
    "description": "<p>As a Strategy and Operations Lead, you&#39;ll manage strategic, operational and analytical initiatives for, and in direct partnership with, the Cloud Support business. You&#39;ll use a consultative mindset and quantitative analyses to develop strategic insights and operational mechanisms to keep the business running effectively, and to improve it.</p>\n\n\n<p>You&#39;ll take on challenging, ambiguous problems, and apply sound business judgment. You&#39;ll immerse yourself in data collection, draw insight from analysis and develop compelling, synthesized recommendations. You&#39;ll create presentations to share findings, communicating complex ideas to senior-level audiences. \n</p>\n\n\n<p>You&#39;re comfortable operating under uncertainty, structuring complicated issues, and finding creative solutions to business challenges. You&#39;ll work in a rapidly-changing industry and will demonstrate problem-solving leadership with limited oversight.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/122699852430615238",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-03-12T19:01:54.340Z",
    "publish_date": "2019-03-12T19:01:54.340Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>6 years of experience in management consulting, corporate strategy, business operations, finance, or a quantitative analysis field.</li>\n<li>Experience in using SQL to extract and manipulate data. Experience in analytical and spreadsheet modeling.</li>\n<li>Experience in developing and presenting data-driven insights. Experience executing projects and operational processes.</li>\n<li>Experience working in or partnering with a support organization.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Business understanding of Cloud technologies.</li>\n<li>Comfort with working in a fast-growing, changing and ambiguous environment.</li>\n<li>Ability to communicate effectively and to influence multiple stakeholders, cross-functionally, at all levels of management.</li>\n</ul>",
    "responsibilities": "<ul><li>Identify and solve strategic and operational challenges.</li><li>Manage end-to-end projects by quickly understanding context and developing a plan.</li><li>Support meetings, off-sites, quarterly business reviews, and forecasting processes.</li><li>Help identify, develop, run and maintain operational performance metrics for the business.</li><li>Identify and complete analyses and generate executive-level insights and recommendations.</li></ul>",
    "title": "Strategy and Operations Lead, Google Cloud Support"
}