{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRjkKUlpCz7sg7z6ZkwiHdxP7I9BGH_hPUkebF0cVccSOgASYQ8wg5o2JTcAttlUoq2oJZebmQKST8JyzO0thyRxPGTwBjRQLx67YFkx_qPJIeukaikR1WLd3bo%3D_V2&jobTitle=Product+Marketing+Manager%2C+Core+Search&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-18T16:31:52.098Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>Search continues to drive the core of Google’s business and our mission to organize the world&#39;s information and make it universally accessible and useful. From sports scores to entertainment news to critical information about life choices, Search serves a wide range of information needs and carries the potential to make the lives of users everywhere better.\n</p>\n\n\n<p>As a Product Marketing Manager for Core Search, you will work closely with product teams to bring engaging and helpful Search features to life on a global scale. You will drive alignment with project managers, engineers, international marketing counterparts, designers, and communications partners on product enhancement prioritization, go-to-market strategy, external messaging, and an excellent product experience reflecting international user insights and pain points. You will also guide international marketers in defining their local narrative, drawing upon relevant product features and new launches. Forming effective cross-functional relationships and influencing product direction and development will be essential in this role.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103860303193612998",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T16:31:52.098Z",
    "publish_date": "2019-03-18T16:31:52.098Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience</li>\n<li>5 years of experience in B2C product marketing and product launches.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in growth marketing.</li>\n<li>Experience in markets outside the US/localizing products to international markets.</li>\n<li>Experience leading cross-functional work with Product Management and Engineering partners.</li>\n<li>Ability to take initiate and demonstrate resourcefulness.</li>\n<li>Excellent core product marketing skills (e.g., opportunity sizing, naming, positioning, messaging, launches).</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead user insights and international market trends that influence product direction.</li>\n<li>Develop and implement go-to-market strategies for new user experiences.</li>\n<li>Craft global narrative, positioning, messaging, naming for new features and products.</li>\n<li>Coordinate with International Marketing, PR, and other cross-functional teams to form and articulate country narratives.</li>\n</ul>",
    "title": "Product Marketing Manager, Core Search"
}