{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Lithia Springs, GA, USA; Reston, VA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU_F8aMetG0hV70zalvaNErJm0eYEJ9FV1o2h5HYoU4SOgCPMA3Tl4Rq7RUpC0NiORHpjAP78HVBTyHp-_6FVDZU2tXt1X4OZ3LAhb5blOLCaBzWwEdEjsERc1A%3D_V2&jobTitle=Regional+Schedule+Lead%2C+Project+Controls+Group%2C+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:31.550Z",
    "description": "<p>In this role, you will ensure that Google&#39;s services can be deployed in a time, place and configuration ideal for serving Google&#39;s users, arranging for capacity to be ready where and when it is needed. You will collaborate with all organizational levels to define project requirements for new processes and software systems, coordinate with cross-functional teams to drive implementation, and mitigate risks to efficiently prioritize projects - all while understanding and creating the future state and technologies of our infrastructure. Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. </p><p>As a Regional Schedule Lead, you&#39;ll be part of Google’s Data Center Engineering and Operations team. You will serve in a key role to develop and implement best practice schedule control processes by applying continuous improvement concepts, including lean principles, to gradually improve through collaboration with many stakeholders. Your key function will be to drive the efficient delivery of Google’s Data Center Portfolio by the organization of data, implementation of scalable processes and the use of professional tools. In this role, you will lead, collaborate, manage and communicate to identify areas for improvement, development of plans, processes and execute changes. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6233601063714816",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-03-18T22:53:07.100Z",
    "publish_date": "2019-02-27T19:44:36.272Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>BA/BS degree in Construction Management, Quantity Surveying, Engineering or other technical field, or equivalent practical experience.</li><li>5 years of experience managing multinational technical programs/projects in a mission critical environment</li><li>Experience working with owners or general contractors in scheduling/planning positions with various regional construction methods, practices and standards.</li><li>Experience in applying lean manufacturing practices in construction projects.</li></ul><br><p>Preferred qualifications:</p><ul><li>MBA or Master&#39;s degree with a technical emphasis.</li><li>Experience with capital and capacity planning, launching internet software/services, planning data center infrastructure, and/or managing large scale distributed systems.</li><li>Experience in implementing lean and project production management methods.</li><li>Ability to collaborate and influence across multiple levels of an organization, with experience leading cross-functional process improvements and holding project leads accountable to the greater project goals.</li><li>Demonstrated analytical skills with high attention to detail and tenacious problem solver with effective verbal/written communication and facilitation skills.</li><li>Comfortability shifting between hands-on detailed analysis and big picture thinking and customizing communication based on the audience.</li></ul>",
    "responsibilities": "<ul><li>Engage with Google’s Data centers partner teams and Engineering groups to understand resource needs and create plans related to delivery and management; includes compute infrastructure, networking and data center infrastructure.</li><li>Implement standard procedures for schedule management including baselining, statusing, progress measurement, schedule quality analysis, change management, monte carlo simulation, contingency management, etc.</li><li>Manage a variety of scheduling and planning functions encompassing conceptual schedules, options analysis, baselines, progress measurement, schedule analysis at the project level and across the portfolio to identify trends, opportunities and risks using Primavera P6, and reporting with limited supervision.</li><li>Support Data Center Project Managers with their projects work package planning, change order review, stakeholder coordination, end to end schedules, review and approval of proposals, pay applications, risk management and value management.</li><li>Plan next generation planning processes and platforms/tools to scale with Google’s growth.</li></ul>",
    "title": "Regional Schedule Lead, Project Controls Group, Data Centers"
}