{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckfrw1YvNeWjiDMN7vZ6RQw7GGKBnkQwp_jjxMUw4N14SOgCPMA3TpQQuF3F94ndQP84Tq7dYT6JiWBnGEi3hV7OT2TZfr3zoAcizZ4hmL3877Z_FE1A7TG09P98%3D_V2&jobTitle=Programs+and+Strategy+Lead%2C+Alliances&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:03:21.866Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>As the Programs and Strategy Lead, Alliances, you will build and scale the business alongside the product and help execute products optimally. You will bring solid business sense and sound judgment to help teams focus on the things that matter the most. You will support Engineers, Program Managers, UX, Business Development, and all of our other functions in building amazing products that delight our users, commercialize these products in a sustainable way, and then get those products into users’ hands as efficiently and effectively as possible.\n</p>\n\n<p>This role includes components of strategy, operations and communications.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6146447017967616",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:39:50.050Z",
    "publish_date": "2019-02-27T19:39:50.050Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Engineering, Business or equivalent practical experience.</li>\n<li>8 years of relevant professional experience at a management consulting firm.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or MS degree in Computer Science.</li>\n<li>Experience leading complex operational and strategic initiatives.</li>\n<li>Experience with data analysis and data modeling.</li>\n<li>Ability to create effective relationships, influence and collaborate internally and externally at all organizational levels.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop insightful recommendations on strategic direction and specific project opportunities that can move the needle. Perform the related analysis and research of technical and business issues.</li>\n<li>Build models and perform analysis to support the business, including financial models, market/industry models and operational analytics.</li>\n<li>Ensure projects are well organized and delivering on desired goals;. Build consensus among cross-functional teams and influence decision making within senior-level audiences.</li>\n<li>Create operational processes and practices that drive efficiencies for the leader, leadership team and organization. Lead execution against recommendations quickly and with flawless accuracy.</li>\n<li>Enable and foster a culture of high organizational performance through internal and cross-group initiatives and leading cross-team projects.</li>\n</ul>",
    "title": "Programs and Strategy Lead, Alliances"
}