{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWc3pOtiZ-Ky2Uk-WOAh4TDYjLJOyau8hIUVoq3CNx8SOgCPMA3TKeMCAdd-pHIolRXPPmqR1jM2Bp5HvCPLC_G3rB2a9tkoqcDi5ggPXh9NzfT2uAiD3vBQTWM%3D_V2&jobTitle=Solutions+Consultant%2C+Flights%2C+gTech+Professional+Services&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-21T13:31:51.875Z",
    "description": "<p>gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities.</p>\n\n<p>As a Flights Solution Consultant on the Flights team you will be responsible for the end-to-end relationship between our Travel Flights products and our partners - overseeing the technical relationship and serving as the primary point of contact between the partners and the various organizations within Google. From on-boarding to ongoing optimization and enhancements, you will be the &quot;voice of the partner&quot;, and will be working directly with technical and business staff at our partners, as well as Business Development/Sales, Product, Engineering and Operations teams internally.\n</p>\n\n<p>You will provide project management and ongoing issue and consultative support; you will be influencing product strategy, and the development of scalable product tools; and you will be providing technical implementation services to some of our most strategic partners. You will also work closely with internal teams to create and streamline business and operational processes, develop detailed documentation and process diagrams, assist partners with their questions and concerns, and increase the overall efficiency of how we implement and support our products.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5075294922539008",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-03-18T20:57:44.921Z",
    "publish_date": "2019-02-27T19:46:28.752Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science or a related technical field, or equivalent practical experience.</li>\n<li>3 years of project/program management experience working across cross-functional teams and experience communicating with technical and business stakeholders.</li>\n<li>Experience with technical support, troubleshooting, XML, HTML, and/or UNIX/Linux.</li>\n<li>Consulting and/or support experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or advanced technical degree.</li>\n<li>5 years of related experience with a background in technology, data-analysis and project management.</li>\n<li>Experience of successfully providing high touch support to large customers or partners.</li>\n<li>Ability to manage multiple assignments simultaneously, work independently and drive projects to completion with minimum guidance and high attention to detail.</li>\n<li>Developed organizational, project management, and written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with customer Project Managers and gTech (Travel Services) Flights Solutions Engineers to define project deliverables and develop detailed project plans. Track progress against the project plan, identify dependencies and potential roadblocks and mitigate risk to ensure successful deliveries.</li>\n<li>Analyze customer requirements and objectives. Be responsible for the gathering and documentation of requirements, and participate in the authoring of these documents.</li>\n<li>Manage troubleshooting and resolution of integration-related issues, work closely with technical teams to resolve issues, and provide high touch support for strategic partners of Google.</li>\n<li>Coordinate closely with internal teams to define and manage responsibilities for overall partner base. Provide feedback to Product, Sales and related teams on opportunities to improve product design. Escalate trends and file bugs and feature requests.</li>\n<li>Optimize partners’ relationship with Google to aid in partner on-boarding, new feature/product notification and work to drive increase in adoption rates and overall partner quality.</li>\n</ul>",
    "title": "Solutions Consultant, Flights, gTech Professional Services"
}