{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdv6qkncYZuqxh2yGwGh8q1kt0S9v6V-xM9Tc9CV3IoSOgCPMA3TGjTIcCag_bXXHDG1Mz7S_YBzfIHJoZH4FfGNAqNHgNDMavO9I0G-WTlY5CTm-7r-qiVSHYY%3D_V2&jobTitle=Lead+Brand+Designer%2C+Brand+Studio&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-06T20:31:48.295Z",
    "description": "<p>Brand Studio is a passionate team of creative thinkers and marketers. We protect and promote Google’s brand and reputation through programs, products and narrative experiences that express Google’s values in action across the world. As part of our team, you’ll define and create the visual and strategic elements that comprise Google’s brand and product identities. You’ll articulate standards that harmonize and bring a uniquely Google point of view to all of our products and communications. By embracing user insights, strategic thinking, beautiful design and provocative execution, you will create delightfully intuitive (and inventive!) experiences that will define the future of Google’s brand.</p>\n\n<p>Our goal is to create intuitive and inventive experiences that will define the future of our brand, using insights, strategic thinking, and excellent design. In order to bring this vision to life, Google leadership has formed the Brand Studio, which defines the foundational brand voice and expression of Google and creates amazing experiences through interactive storytelling, film making, brand identities, and product experiences. We strive to blur the lines between product, code, strategy and art.\n</p>\n\n<p>As the Lead Brand Designer, you will develop strategically and conceptually effective brand experiences in collaborate with a team of visual and interactive designers, crafting experiences and stories that will stretch across the Google brand. You will also create campaign and brand experiences that span film, websites, and products, and have the opportunity to explore Google’s growing technologies, including machine learning, AR/VR, and immersive environments.\n</p>\n\n<p>In this role, you will meet deadlines and communicant effectively with Brand Studio leadership to bring experiences to life. You will be responsible for executing projects independently and working with key partners across Google, including marketers, product owners, and executive leadership. Additionally, you will collaborate daily with a diverse set of specialists (e.g., strategists, information architects, marketers, project managers, writers, and engineers) to deliver rich digital interactive moments. These moments will help increase engagement and solve challenging communication and business goals we face. You will come up with solutions to ambiguous challenges and be accountable for all related activities beyond creative (i.e., scheduling, mentoring, brand and project advocacy, team building, etc.).</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5747427076407296",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-02-27T19:53:14.818Z",
    "publish_date": "2019-02-27T19:53:14.818Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Experience in narrative, conceptual (i.e., crafting stories and building brands), and graphic design (i.e., typography, layout and how it extends across digital).</li>\n<li>Experience managing stakeholders.</li>\n<li>Experience communicating user experience through the design process.</li>\n<li>Experience creating and using wireframes, user journeys, storyboards, mockups, and/or high fidelity prototypes.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in motion-based storytelling. Knowledge of web development (i.e., HTML, CSS, JS).</li>\n<li>Experience designing and leading the development of design systems. Understanding of research techniques and how they can be applied to problem-solving.</li>\n<li>Experience designing and delivering large and small-scale experiences and an understanding of the user-centered design process.</li>\n<li>Experience creating aesthetically excellent work. Ability to independently guide external experience, design, and production agencies.</li>\n<li>Knowledge of design and technology trends and an understanding of consumer insights and how to apply these to Google projects.</li>\n<li>Ability to work in a fast-paced, ambiguous environment and manage projects with minimal supervision.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create aesthetically excellent work that is true to the Google brand. Guide external experience, design, and production agencies.</li>\n<li>Manage a large amount of work and various stakeholders in a fast-paced, ambiguous environment. Manage projects with minimal support.</li>\n<li>Drive projects from start to finish, collaborating with Marketing partners. Distill complex information, strategies, and experiences.</li>\n<li>Communicate the user experience at various stages of the design process by using wireframes, user journeys, storyboards, mockups, and/or high fidelity prototypes.</li>\n</ul>",
    "title": "Lead Brand Designer, Brand Studio"
}