{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; Council Bluffs, IA, USA; The Dalles, OR 97058, USA; Lenoir, NC, USA; Moncks Corner, SC 29461, USA; New York, NY, USA; Pryor, OK 74361, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckejK83lfuODJZqul-3fY5LyiXJnrilKePS5imL6vmmMSOgCPMA3TY6cfOdaH61bXw1oEvnIiVADFUpDuu1VMEAExANIKoNU7dekFZ53FNXxUoTVzJClrrP7MFoY%3D_V2&jobTitle=Global+Security+Technology+Manager%2C+Global+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-05T16:01:51.206Z",
    "description": "<p>Security is at the core of Google&#39;s design and development process: it is built into the DNA of our products. The same is true of our offices. You&#39;re an expert who shares our seriousness about security and our commitment to confidentiality. You&#39;ll collaborate with our Facilities Management team to create innovative security strategies, investigate breaches and create risk assessment plans for the future. You believe that providing effective security doesn&#39;t come at the expense of customer service - you will be our bodyguard (and our long lost pal).</p><p>Google&#39;s Data Center (GDC) Security team is chartered with physically protecting the people and assets that operate and support Google&#39;s global critical infrastructure.</p><p>As a member of GDC Security you will help develop a culture where safety, security and resiliency are integrated into every facet of Google, including the creative process. You will help us continually identify, evaluate and monitor risks that could affect business activities and provide business leaders the information they need to make critical decisions. You&#39;ll collaborate with cross-functional teams to create innovative strategies and develop programs that drive sustainable effectiveness.</p><p>As the Global Security Technology Manager, you will lead the team responsible for the overall upkeep and improvements for a variety of different applications that keep Googler’s safe and secure. GDC Security uses data to drive business decisions and affect change. We are looking for a self starter with a passion for analyzing, organizing, and visualizing large amounts of data to join the GDC Security System’s team.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5757814622584832",
    "location": {
        "address_lines": [
            "Pryor, OK 74361, USA"
        ],
        "city": "Pryor",
        "country": "OK",
        "country_code": "US",
        "display": "Pryor, OK 74361, USA",
        "lat": 36.3084275,
        "lon": -95.31691359999999,
        "post_code": "74361"
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&size=1168x324&zoom=12&signature=wBSgk2TEZrwkDu4v0aywYosZY7M=",
        "large_2x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&scale=2&size=1024x324&zoom=12&signature=zieax8Z3lz-tZ087C-jxNAqGy6I=",
        "small_1x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&size=600x400&zoom=12&signature=fvxytqlJNSmyDQi8pUBBp0tqgMo=",
        "small_2x": "/maps/api/staticmap?center=Pryor%2C+OK+74361%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Pryor%2C+OK+74361%2C+USA&scale=2&size=600x400&zoom=12&signature=tWVweYC6BE6BymiC8gbffn6uwTU="
    },
    "modified": "2019-02-27T19:53:10.636Z",
    "publish_date": "2019-02-27T19:53:10.636Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree or equivalent practical experience.</li><li>7 years of experience managing security technology projects from evaluation to design and execution.</li><li>3 years of experience in managing teams that design and/or administer programs.</li><li>Experience managing technical and non-technical groups to drive business outcome.</li></ul><br><p>Preferred qualifications:</p><ul><li>Credentials from Board of Certified Safety Professionals or equivalent agency. Ability to travel up to 15%.</li><li>3 years of experience in technology strategy development and execution with demonstrable program management skills. Ability to advance large projects with vague/undefined scopes; influence and align multiple stakeholders with competing priorities and resources.</li><li>Ability to conduct business analysis with complex data to identify critical issues to the firm&#39;s strategic, organizational, and operational needs.</li><li>Ability to drive organizational change through informal authority, serve as a trusted consultant to internal customers, and represent users and customers in every thought and interaction.</li><li>Applied project management skills; ability to create workable project plans with project scope and execute on such plans.</li><li>Excellent analytical, communication, presentation, and interpersonal skills; ability to take initiative and build productive relationships.</li></ul>",
    "responsibilities": "<ul>\n<li>Lead a team of Security Systems Technology Program Managers within GDC Security while guiding peers, internal clients and cross-functional partners to develop technology strategies with a focus on scalable growth, automation, and best business outcomes.</li>\n<li>Leverage security industry knowledge and best practices to source, evaluate, develop and deliver technology solutions as part of a broader roadmap, and bring them to fruition via partnerships with internal engineering and/or third party technology providers.</li>\n<li>Lead build of technology solutions across a client area through execution cycle from strategic planning to tactical activities such as gathering requirements, developing user stories, creating project plans, and more.</li>\n<li>Monitor and anticipate technology-related risks; build and socialize business cases to drive leadership prioritization of technology projects/requests.</li>\n<li>Develop a technology strategy for a client group and create vision for specific systems and/or tools to support that strategy; take on product roadmap.</li>\n</ul>",
    "title": "Global Security Technology Manager, Global Data Centers"
}