{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRnvXsCv63BPb8OCDuCGqkpk-fR2HZ19HErhDPmTlqASOgCPMA3Tx4Vc83Ej36nkcj9FR74uQxbiLHrm2_PtVjANVr0Y_WEz1ThCo21pDwe54nFmsi3b7mpiVP0%3D_V2&jobTitle=Product+Marketing+Manager%2C+Gaming&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-19T12:01:36.229Z",
    "description": "Google continues to explore opportunities in the Gaming industry to build on the company’s strengths and suite of relevant brands. As a Product Marketing Manager for Gaming, you&#39;ll craft and build core marketing strategies and compelling marketing narratives and help bring our product stories to life with gamers. You will work cross-functionally with key stakeholders and internal/external developers to drive the full marketing mix. In addition to pushing internal stakeholders beyond their creative and strategic comfort zones, you will inspire agencies to do their best creative and strategic work.<p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6247007947784192",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:46:56.777Z",
    "publish_date": "2019-02-27T19:46:56.777Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>5 years of product or brand marketing experience in the gaming industry.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>7 years of product or brand marketing experience in the gaming industry.</li>\n<li>Experience working for gaming publishers/developers and managing a marketing budget.</li>\n<li>Knowledge of cultural marketing trends in creative media, digital and social along with a passion for the gaming landscape.</li>\n<li>Ability to think strategically; creating and implementing marketing plans and brand briefs.</li>\n<li>Ability to adhere to an expectation of complete confidentiality on all business matters.</li>\n<li>Excellent presentation and communication skills, with the ability to lead partners and a team toward common goals.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish the research strategy and framework, aimed at consumer segmentation, value props, positioning and testing marketing creative.</li>\n<li>Leverage research to formulate powerful insights and personally drive product positioning and value props, which will help inform and influence the execution of holistic marketing campaigns.</li>\n<li>Assist in the planning of Go-to-Market strategies and integrated marketing campaigns, including digital, social, Customer Relationship Management (CRM), search, promotions, retail/channels that drive commercial results and consumer conversation.</li>\n<li>Work closely with cross-functional teams and internal/external developers (e.g. Product, Go-To-Market, Business Development, Public Relations, UX Research) on Go-to-Market development and campaign launches. Report on campaign performance and make timely recommendations for optimization.</li>\n<li>Maintain strict confidentiality with privileged information and collaborate with multiple business owners and external partners.</li>\n</ul>",
    "title": "Product Marketing Manager, Gaming"
}