{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckW8x7SN2S7wYk3V89CrAmiK4nNdulXdAbnEvNkZ1xowSOgASYQ8wZl8mjE1Aixwam5PR1ugmbHaWkYS2VUL7HV3KNxpiH-MOXXOmMFsw8VDCNYtb2NK_bWjdf3U%3D_V2&jobTitle=Mobile+App+User+Growth+Strategist%2C+Google+Shopping+Transactions&loc=US",
    "categories": [
        "BUSINESS_STRATEGY",
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T20:01:56.841Z",
    "description": "<p>Google Shopping helps connect people with retailers at every moment of their shopping journey in and out of the store. With the launch of Shopping Actions, users now have an easy way to shop for products across Google Search, Assistant, and Shopping Express with a universal cart, whether they’re on mobile, desktop or even a Google Home device.</p>\n\n\n<p>Google Shopping builds great end-to-end user experiences for critical shopping journeys. Transactions is one of the key pillars to deliver on this goal. We recently launched Shopping Actions - Google’s vehicle to drive commerce by offering differentiated product and service for both our users and merchant partners. Shopping Actions gives users an easy way to shop products on the Google Assistant, Google Search, YouTube, and G Suite with a universal cart, whether they’re on mobile, desktop or even a Google Home device.\n</p>\n\n\n<p>The consumer shift to mobile has fundamentally changed how people discover, shop, and buy products. We are looking for a Mobile Growth Strategist to join our user growth team and help us grow Mobile adoption and engagement for shopping transactions.</p><p>Google’s Global Partnerships team powers extraordinary user experiences through meaningful partnerships. We build relationships that solve users’ needs, advance our partners’ goals, and further Google’s mission. Our team provides solutions for a range of partners — from helping publishers and developers grow their businesses through monetization solutions, to helping our long-term partners anticipate and navigate change in a way that delivers economic and reputational value. We build and distribute Google products through partnerships across a multitude of product areas, including Search, Assistant, Geo, News, Travel, and more. We collaborate across Google, ensuring a coordinated approach when engaging with our most complex and strategic partners.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/143243006619591366",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T15:31:52.295Z",
    "publish_date": "2019-03-18T15:31:52.295Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of experience in app user growth through marketing or product actions.</li>\n<li>Experience in project management.</li><li>Experience analyzing data to identify opportunities or provide strategic recommendations.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience and ability to work in a fast-paced, constantly evolving team environment.</li>\n<li>Ability to influence leadership and cross-functional partners.</li>\n<li>Ability to take initiate and enjoy challenging and continuous learning.</li>\n<li>Excellent written and verbal communication skills.</li>\n<li>Ability to demonstrate creative problem-solving.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead cross-functional teams on executing against the strategy to drive growth.</li>\n<li>Manage the key mobile app growth metrics and drive against goals.</li>\n<li>Lead cross-functional initiatives spanning paid marketing, business development, targeted push notifications, promotions, and product investments to enhance tools and improve the product.</li>\n<li>Leverage customer insights and best practices to identify opportunities. Collaborate with cross functional teams to execute against initiatives.</li>\n<li>Propose pipeline of tests, influence roadmap, analyze results, and guide team to focus on areas showing positive traction.</li>\n</ul>",
    "title": "Mobile App User Growth Strategist, Google Shopping Transactions"
}