{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckT_qs1adTZBxfg0d5gYhg7O4Oa0jyCdGwrh1_xqZBYQSOgASYQ8wAsXeXm0esRI8FtpOmwkg6n_PiqGPGomG4oZDJhGYXMOcdbZPqG80ScS69zg7NYHxBo7zRLQ%3D_V2&jobTitle=Global+Process+Manager%2C+Buying+at+Google&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-20T16:01:45.412Z",
    "description": "<p>The Supplier and Procurement Support Operations team strives for excellence in purchasing tools, systems, and processes. As a member of this team, you will help improve the buying process for Googlers and be responsible for transforming how purchases are made at Google by designing procurement processes for indirect goods and services within Marketing, Consulting, Temps/Vendors/Contractors (TVCs), and IT services. </p>\n\n\n<p>As a Global Process Manager, you will design buying, supplier selection, contracting, and purchase order (PO) creation processes. You will also work directly with businesses to achieve transactional efficiency and decrease end-to-end cycle times through centralized processes. Additionally, you will identify opportunities to provide centralized, outsourced support of the procurement process to business stakeholders, develop business requirements to ensure the procurement system transformation supports buying processes, and provide industry expertise and insights on procurement best practices, specifically category management, contracting, and buy channel optimization.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/130966940102337222",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:14.606Z",
    "publish_date": "2019-02-27T19:50:14.606Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Engineering, Operations or equivalent practical experience.</li>\n<li>Experience in indirect sourcing and procurement contracting processes.</li>\n<li>Experience in Finance ERP Systems with an emphasis on Procure to Pay systems/transformation and design.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or equivalent practical experience.</li>\n<li>8 years of relevant work experience.</li>\n<li>Experience in Google enterprise applications.</li>\n<li>Experience working cross-functionally with effective leadership skills and the ability to adapt quickly to changing priorities.</li>\n<li>Distinctive problem-solving and analytical skills, combined with effective business judgment.</li>\n<li>Effective written and verbal communication skills and the ability to break down technical concepts into simple terms to present to diverse, technical and non-technical audiences.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Represent, share, and influence our vision to cross-functional stakeholders within Finance, Legal, HR, and Engineering teams.</li>\n<li>Work closely with partners to ensure that all business requirements are delivered, helping the teams to prioritize and launch as necessary.</li>\n</ul>",
    "title": "Global Process Manager, Buying at Google"
}