{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTlgW7vNbPUjEKb5lrk_pJPHVQF2DixzAhs8m2KUG5kSOgASYQ8wzeAIJXS2KXLxKXi1OOUcA6VtWjORU2tiYSWBxRttMvTumAT4ZimRemLd7AAuODv5a0b_fwU%3D_V2&jobTitle=Product+Technology+Manager&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T20:02:06.208Z",
    "description": "<p>Google relies on gTech’s Velocity team (gV) to transform and improve people’s lives through big-bet products and services like Search, Google Assistant, and Actions on Google. Our mission is to activate, accelerate, and scale Google’s biggest bets by being trusted advisors to internal and external partners.</p>\n\n\n<p>As a Product Technology Manager for gVelocity System and Tools, you will be responsible for improving the performance of our worldwide product incubation, activation and scaling by establishing and executing on a long-term roadmap for systems and tools, including designing the next generation of tools to support our business needs and managing the lifecycle of our existing portfolio. At the strategic level, you will balance business and partner needs, prioritizing resources with engineering teams and partners, developing and executing on product requirements and streamlining communications across the stakeholder ecosystem. Entrepreneurial and detail-oriented, you are motivated by bringing Google products and technologies to market and to our partners.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/122176312023360198",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-14T20:02:06.208Z",
    "publish_date": "2019-03-14T20:02:06.208Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or related technical field (e.g., Mathematics, Natural Sciences, Engineering) or equivalent practical experience.</li>\n<li>4 years of relevant experience, including hands-on product management or technical management.</li>\n<li>2 years of experience managing cross-functional projects, global stakeholders and external development partners.</li>\n<li>Experience with web technologies such as HTML, CSS, JavaScript, and HTTP.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Computer Science/Engineering or equivalent practical experience.</li>\n<li>Experience with one or more general purpose programming languages including but not limited to: C/C++, Go, Python, JavaScript.</li>\n<li>Experience planning for and managing multiple large-scale, complex technical projects and coordinating with cross-functional project members to deliver quality results within the project deadlines.</li>\n<li>Excellent relationship building, collaboration, consultation and influencing skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design and drive roadmaps for systems and tools across multiple verticals. Provide expertise to scale product and partner support, feature launches and localizing products.</li>\n<li>Own the technical functionality and manage the lifecycle of existing and new key systems and tools to support growth.</li>\n<li>Partner with internal and external Engineering teams to write PRDs, design solutions and oversee technical delivery. Lead the requirements phase, RFP process and negotiations.</li>\n<li>Develop and manage short- and long-term strategic platform and infrastructure projects across cross-functional stakeholders to onboard new partners, improve the overall on-boarding process and support product launches globally.</li>\n<li>Define, establish, measure, and report on metrics to analyze the partner experience and internal efficiency, including customer service SLAs, and support volumes. Document, build and maintain familiarity with all workflow setups and make continuous refinements to meet business needs.</li>\n</ul>",
    "title": "Product Technology Manager"
}