{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTIuMIu-DR8ixmrkcaH9sILniNJ7rWCGxV1lC6i7vDkSOgASYQ8wSACHT_2xXCsEpULInuJCvrf7muw5Os9qcDflfJj-HJx-82W6jwDF9uvqS6XsSGEDVWIGpws%3D_V2&jobTitle=Technical+Program+Manager%2C+Meeting+Solutions&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-25T21:31:38.193Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n<p>The Workspace Hardware team develops, deploys, and manages video conferencing units at Google and for our enterprise customers.</p><p>The web is what you make of it and our team is helping the world make more of the web. From open-source pros to user-experience extraordinaires, we develop products that help users connect, communicate and collaborate with others. Our consumer products and cloud platforms are giving millions of users at homes, businesses, universities and nonprofits around the world the tools that shape their web experience -- and changing the way they think about computing.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6707305002336256",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-18T23:05:08.912Z",
    "publish_date": "2019-02-27T19:53:31.674Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>3 years of program management experience.</li>\n<li>3 years of experience within release management.</li>\n<li>Experience working with hardware teams and relying on hardware production lines.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>4 years of experience as a Technical Program Manager, managing complex technical projects.</li>\n<li>Experience with data analysis using SQL or scripting languages such as JavaScript, Apps Script, or Python.</li>\n<li>Experience using or creating scripts and tools to automate and scale processes.</li>\n<li>Experience with operating systems.</li>\n<li>Ability to speak and write in Mandarin fluently and idiomatically.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Drive release efforts for Chromebox for meetings and manage relationships with Product Management and other Engineering teams involved in product development.</li>\n<li>Own release processes, automation and opportunities to scale improve established processes. Coordinate with internal teams.</li>\n<li>Manage tracking and delivery of complex, multi-quarter technical projects spanning multiple teams and stakeholders.</li>\n<li>Build long term relationship with Chrome OS, Meet and Jam teams and stakeholders. Enable effective OKR intake and program management efforts.</li>\n<li>Partner with Product Managers and Engineers to oversee core areas of the program roadmaps.</li>\n</ul>",
    "title": "Technical Program Manager, Meeting Solutions"
}