{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckQ22av1IzQ8IIGWVkTrxWNRUfu2ocBHPHI9p7wbyaAcSOgASYQ8w2QyOuyzmClu2mHoBQbGjfSJwn8DQm1_V7qmJUWEfnXjZ6J5I8wqkWqq5_QxHumGQDa64BiA%3D_V2&jobTitle=Communications+Manager%2C+YouTube+Music&loc=US",
    "categories": [
        "MARKETING"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-14T22:01:43.572Z",
    "description": "<p>As a member of the Global Communications &amp; Public Affairs team, you will work cross-functionally to help communicate with journalists and other thought leaders; devise specific communications materials and campaigns based on understanding of journalists&#39; interests; engage in face-to-face meetings with commentators and other opinion formers; develop print and web-based material supporting these campaigns; and counter misinformation that might interfere with our business and ability to serve our users. We&#39;re looking for great communicators who can understand complex issues and explain them in person and also via well written, simple blog posts, FAQs, video scripts and more.<br><br>As a leader, you will keep your team on track with the overall strategy, giving them direction when it comes to specific product and business area decisions. You will also provide direct communications support for senior executives.</p>\n\n\n<p>As part of of the music communications team, you will help build the overall strategy for Music communications, including surfacing and telling artist stories, and highlighting popular and emerging artists on YouTube -- all while aligning your initiatives with overall goals of the business. You will also provide direct communications support for senior executives on our Music team and help manage the external communications around our ongoing music negotiations.</p><p>It&#39;s our job to help inform and educate users, advertisers, partners, opinion leaders--and our own employees--about the benefits of Google&#39;s products, our distinctive company culture/values, and our approach to the big public policy issues of the day. We are looking for quick-witted, entrepreneurial and intellectually curious people to join the team. To succeed here, you&#39;ll need to be able to combine creativity with the organizational skills to manage numerous different projects to tight deadlines simultaneously, as well as enjoy pitching to all kinds of journalists, bloggers and commentators (we find it hard too!), or producing internal communications and events for our employees. Things happen quickly at Google and to get stuff done here you need to be an enthusiastic team player - a self-starter who can work cross-functionally and isn&#39;t frightened to take risks or try out new ways of doing things.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/108305388723413702",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-14T22:01:43.572Z",
    "publish_date": "2019-03-14T22:01:43.572Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of relevant communications and publicity experience.</li>\n<li>Authorization to work in the United States.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience collaborating with marketing teams to bring multi faceted music campaigns to consumers.</li>\n<li>Understanding of the music and entertainment world, both at a high and granular level.</li>\n<li>Understanding of YouTube and tech policies and regional regulations both in the US and globally that impact music.</li>\n<li>Effective team player who can lead efforts across music; capable of working calmly and quickly in high-stress environments</li>\n<li>Persuasive when presenting to larger groups or in regular meetings, both internally and externally.</li>\n<li>Strong communication skills and decisive leadership.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with executives on our music product area and our global, music business organization to develop and deliver compelling messages related to the perception of YouTube in the music business.</li>\n<li>Develop creative stories to land in consumer and music industry publications, own and manage corporate and crisis communications around music, and executive public relations initiatives.</li>\n<li>Partner internally with YouTube marketing to shine a spotlight on great artist stories and interesting data insights.</li>\n<li>Build and rollout communication initiatives that relay our key messages and goals in the world of music.</li>\n<li>Own and manage our external relationships with the media and key music influencers, and cultivate partnerships with artists and music industry players.</li>\n</ul>",
    "title": "Communications Manager, YouTube Music"
}