{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYwRc0LVzTtoHDlQFeN4kx-ij_RqudtHVeXOXwdm0yYSOgASYQ8wTnMPMxbaj4GHuF9Yi5V640CjiIfcCQZfY5zSInbdfT76QCFxkVx5J5VYdvVoyOF4nHHS88A%3D_V2&jobTitle=Director%2C+Finance+Systems+and+Process+Implementations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T21:01:56.032Z",
    "description": "<p>As the Director of Finance Systems and Process Implementations, you will influence executive leaders and leverage your deep experience of Core Finance capabilities to create plans and implement initiatives across organization boundaries that support our future business growth and scalability. You will lead a broad scope of initiatives and project teams through the entire project lifecycle, working closely with Finance, Corporate Engineering teams and Professional Services Partners to deliver on commitments. You will also lead teams on complex, large impact programs in a matrix team structure - establishing overarching vision, strategy, goals and objectives, managing scope and requirements, ensuring holistic design of end-to-end business processes and data, structuring and implementing projects to deliver against business value case and communicating the right information at the right time to stakeholders.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/73413096019763910",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:48:17.862Z",
    "publish_date": "2019-02-27T19:48:17.862Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>15 years of experience in finance systems (ERP platforms), finance business processes and organization structure/operating models across core finance functions.</li>\n<li>Experience in front-to-back program/project management, Systems Development Life Cycle (SDLC), and Change Management leading cross-functional initiatives.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>CPA, CA, MBA, or similar advanced professional degree.</li>\n<li>Track record of success leading large scale finance transformation organizational efforts with teams inside and outside of finance.</li>\n<li>Ability to identify opportunities, resolve challenges and drive action in collaboration with internal and external cross-functional teams.</li>\n<li>Effective business design, organization design, process improvement and analytical skills.</li>\n<li>Effective written and verbal communication skills and excellent interpersonal, problem solving and analytical skills, combined with effective business judgment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Structure the Core Finance transformation program in collaboration with the project leadership team and stakeholders, by defining and executing a clear vision, strategy, guiding principles, scope, goals, objectives and success criteria. Drive key decisions with the appropriate governing bodies on project scope, budget, staffing, interdependencies and timing.</li>\n<li>Establish and lead effective programs and project teams demonstrating exceptional program/project management. Drive robust frameworks and methods to understand current state, identify gaps/propose improvements, evaluate solution alternatives, prioritize requirements, identify and design to-be future state, and drive consensus to achieve agreed set of requirements.</li>\n<li>Lead senior stakeholder management, engagement, alignment and active sponsorship critical for program success - including clearly communicating status, risks and remediation plans to executive stakeholders. Resolve issues that arise across projects, keeping in mind impacts to the program timelines and to other programs/projects.</li>\n<li>Partner with Finance leaders to define and deliver effective change management plans to ensure new capabilities are deployed effectively and adopted by the organization. Build a network of project leaders that build enthusiasm for the transformation with the organization.</li>\n<li>Define and manage key metrics in order to measure business impact initiatives and delivery against business value cases.</li>\n</ul>",
    "title": "Director, Finance Systems and Process Implementations"
}