{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Sunnyvale, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRnbT1EjgZosJxhrtgWkwUEHjpJE7nv2etb7nne2Z28SOgCPMA3T5BCv8yjH9WB6bCPd4fx5gPFekcjQtO9TX46GJXiWweHsYgANBu_eVWfHFFRHFBG7CBY7rg0%3D_V2&jobTitle=Program+Manager%2C+Event+Technology&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:34:25.642Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>Event Technology is a small team of Googlers providing support for medium to high profile events. We take a hands-on approach to supporting external events, bid-management, and other services related to event technology needs. Our mission is to provide industry-leading network and technology services for events that enable Google revenue creation, product adoption, education and awareness.\n</p>\n\n<p>As an Event Technology Program Manager, you will play a critical role in the ongoing support, planning and execution of Google’s highest priority external and internal events.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6237718939107328",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T22:53:09.194Z",
    "publish_date": "2019-02-27T19:45:20.341Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of demonstrated program management experience.</li>\n<li>Direct experience in live events, either in a production management or operations function.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Familiarity with AV, IT, and networking hardware and software concepts and their intersection.</li>\n<li>Ability to use cloud-based user productivity systems (Gmail, Hangouts, Drive, Sites, etc).</li>\n<li>Creativity in discovering actionable results and ability to succeed in a collaborative, fast-paced environment.</li>\n<li>Developed strategic consultation skills around service delivery and budget priorities. Effective interpersonal and relationship-building skills conducive to team development.</li>\n<li>Effective data analysis and problem solving skills.</li>\n<li>Ability to travel up to 40% of the time.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Collaborate with cross-functional teams in Brand Marketing, Product Marketing, Engineering, AV Engineering, Network Operations, Security, Real Estate and Workplace Services and Cloud as well as external agencies and vendors to drive all aspects of project delivery.</li>\n<li>Use technical judgment and previous operations experience to execute entire project life-cycle.</li>\n<li>Utilize reviews, challenge proposals, and build consensus via broad collaboration, clear communication and strong documentation.</li>\n<li>Oversee projects that include design and implementation of high-availability, resilient, portable network infrastructure and other IT/AV services.</li>\n<li>Coordinate troubleshooting and support of deployed Google infrastructure technology (e.g. live streaming, video conferencing, presentations, demos, etc).</li>\n</ul>",
    "title": "Program Manager, Event Technology"
}