{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: New York, NY, USA; Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYUAW44c9S46pa8dkNEQHnZWs1TViEYr48L-4d28sqgSOgASYQ8wXc5-HfRaRsbDj3BKghZoqoPTIxYOCt3E92FFwFVofVuF_tprGWpT3qBdBjJUkW4uUrtDS5g%3D_V2&jobTitle=Head+of+Business+Affairs+and+Contract+Operations%2C+Marketing&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-05T21:31:45.241Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>Google’s Marketing Operations team inspires and enables creative work. We lead programs focused on Agency Management, Production Operations, MarTech, and Business Affairs/Deal Desk. With extensive experience in partner management, marketing governance, and an understanding of the agency landscape and creative process, we ensure our Marketing teams have the resources and tools to be successful.\n</p>\n\n\n<p>As Head of Business Affairs and Contract Operations, you will be fluent in the fundamentals of business affairs and contract management. You have experience in both client and agency side and the ability to analyze and diagnose business challenges while formulating solutions and influencing teams towards effective decisions. You will work with cross-functional team across Marketing, Legal, Finance, Sourcing, Procurement, Corporate Communications, and more, to unlock new ways of working and enabling us to expand our work to support others.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/74943346830648006",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-05T21:31:45.241Z",
    "publish_date": "2019-03-05T21:31:45.241Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent experience.</li>\n<li>10 years of relevant work experience.</li>\n<li>8 years of experience in business affairs.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in business affairs and/or contract management on both the agency and client-side.</li>\n<li>Experienced in process design, contract operations, and change management.</li>\n<li>Experience working in an agency.</li>\n<li>Track record of successfully managing cross-functional teams and agencies.</li>\n<li>Knowledgeable of legal processes and frameworks related to talent, rights, and licensing, working with talent/music unions. Knowledge of how agencies function and how decisions are made.</li>\n<li>Ability to influence and communicate cross-functionally across all levels of management.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop strategy and improve key initiatives, informing the playbook for contract-drafting process. Manage business case development and ongoing resource planning for expanding scope of services and help transition the team from contract execution to end-to-end contracting support.</li>\n<li>Serve as key partner to legal, helping lend a creative lens across agreements and providing guidance on solutions.</li>\n<li>Enables design and implementation of process improvement opportunities and leverages data to uplevel relationships. Support agency review processes and bi-annual vendor business reviews by providing relevant metrics and insights.</li>\n<li>Serve as industry expert for contract management in Marketing and identifies opportunities and leverages insight to solve challenges that scale globally.</li>\n<li>Supports marketers on proactive agreement design, advise cross-functional stakeholders on marketing requirements, establish comprehensive and scalable processes for tracking satisfaction, hours saved, and speed/turnaround times.</li>\n</ul>",
    "title": "Head of Business Affairs and Contract Operations, Marketing"
}