{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ6et3S1h4eONTmhwSLBtJtAI5-lu_zgfAtunTm44A8SOgCPMA3TbPzqnOpUCscMQJAsXY1-l0opg6qaz5La7_80RxB_xYCEaDHHHTBsxzBOZmCpVsTzVIwccI0%3D_V2&jobTitle=Technical+Contracts+Manager&loc=US",
    "categories": [
        "TECHNICAL_SOLUTIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:49:45.474Z",
    "description": "<p>gTech’s Business and Outsourcing Strategy and Services team (gBOSS) provides consultative services to gTech, the Global Business Organization (GBO), and Google at large, enabling each part of our business by developing innovative, scalable, and compliant solutions that allow gTech to run efficient operations with the best vendor partners at optimal cost while minimizing risk.</p>\n\n<p>As a Technical Contracts Manager, you will be one of the technical representatives working closely with Product, Legal, and Business development teams. You&#39;ll have an insight into internet technology and a grasp of its impact on our agreements in order to adequately advise, legal, business development and technology teams.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4891725644234752",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:41:36.315Z",
    "publish_date": "2019-02-27T19:41:36.315Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Business, Computer Science or related technology field, or equivalent practical experience.</li>\n<li>3 years of contract negotiation experience in a technical environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, MS, JD or other advanced degree.</li>\n<li>2 years of experience working with internet products and technologies.</li>\n<li>Experience drafting, reviewing and approving agreements and/or statements of work.</li>\n<li>Expertise in analytical and structured problem-solving operations.</li>\n<li>Effective leadership, management and collaboration skills in a cross-functional team environment.</li>\n<li>Excellent communication skills and attention to detail, with the ability to operate in a fast-paced, dynamic environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Coordinate and facilitate between internal teams to gain feedback and insight into agreements and initiatives.</li>\n<li>Advise business development and technology management teams, as well as legal on risks around technical solutions and service level commitments.</li>\n<li>Work with key stakeholders to create, draft and communicate implementation standards to facilitate smoother operations and improve decision making.</li>\n<li>Review and approve technical agreement terms.</li>\n</ul>",
    "title": "Technical Contracts Manager"
}