{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckehE4Iyvg7yF2Rewyy5ZXu3ZnC9S83ZSVaXi2HKhAdQSOgASYQ8wiEZK638NkmKoEgAwGr3WoVwdAA9sDjsfEmnnBpPX1c6DklCiNdzuWlSuzIf8zYZfc5y0STo%3D_V2&jobTitle=Artist+Marketing+Manager%2C+YouTube&loc=US",
    "categories": [
        "MARKETING",
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-03-06T20:32:05.926Z",
    "description": "<p>Whether you&#39;re on a consumer product (like Gmail, Search, Maps, Chrome, Android) or a business product (Google Ads, AdSense, Google Marketing Platform, Analytics), you take part in a complete marketing experience as you lead every facet of the product&#39;s journey. From determining positioning, naming, competitive analysis, feature prioritization and external communications, you help shape the voice of the product and help it grow a consumer base. This means you work with a cross-functional team across Sales, corporate communications, legal, webmasters, product development, engineering and more. In this role, you&#39;ll be involved with product marketing strategy from beginning to end.</p>\n\n\n<p>YouTube Music delivers a premium music listening experience. We have built an Artist Marketing team to extend our value to artists and better serve the music industry.\n</p>\n\n\n<p>Artist Marketing Manager, you will lead our highest priority and investment artist marketing campaigns. You will be creative, organized, and motivated to craft and launch global artist marketing campaigns and lead strategy for our most important subset of artist partners: superstars and established acts. You will oversee the strategic development of our approach with our partners and the broader industry and execute our artist partnerships. You will work with our Product, Artist Relations, Programming, Brand and Creative, Press, Legal, Media, and Communications teams and externally with labels, artists, and managers.\n</p>\n\n\n<p>In this role, you will contribute experience in music business and strategic planning to manage promotional efforts and provide analytical insights into strategic music industry marketing initiatives. You will be the artist marketing lead for all of our partnerships and the industry partners who work with them.</p><p>Know the user. Know the magic. Connect the two. At its core, marketing at Google starts with technology and ends with the user, bringing both together in unconventional ways. Our job is to demonstrate how Google&#39;s products solve the world&#39;s problems--from the everyday to the epic, from the mundane to the monumental. And we approach marketing in a way that only Google can--changing the game, redefining the medium, making the user the priority, and ultimately, letting the technology speak for itself.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/138289156980646598",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-06T20:32:05.926Z",
    "publish_date": "2019-03-06T20:32:05.926Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience working in music/tech marketing, and/or digital marketing or strategy consulting.</li>\n<li>Experience in budget management and key performance indicator (KPI) tracking.</li>\n<li>Experience with spreadsheet software and text editors.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA.</li>\n<li>Experience in integrated marketing campaigns, leadership and go-to-market strategy.</li>\n<li>Experience in marketing, working with talent and management within the music industry.</li>\n<li>Ability to manage campaigns with large budgets. Ability to work on multiple projects simultaneously in a fast-paced environment.</li>\n<li>Ability to lead, communicate, and build collaborative partnerships with product partners and other cross-functional teams across all levels of management. Ability to present to leadership and external audiences.</li>\n<li>Excellent business judgment, problem-solving, and analytical, collaboration, and written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Provide leadership and concurrently manage the execution of multiple live global artist marketing campaigns.</li>\n<li>Work with cross-functionally with promotional owners to process and deliver. Work with our Creative and Brand team to ensure their vision is manifested threaded throughout campaign work.</li>\n<li>Track and measure of campaign success with regular quantitative-driven check-ins.</li>\n<li>Develop pitch materials, execution updates, and campaign recaps for music label executives, artists and their management teams, and Google and YouTube marketing and product leadership. Prepare presentations and clearly communicate findings from initiatives to management and to the broader organization.</li>\n<li>Work with our Artist and Label Relations teams to ensure the success of campaigns. Build an immersive partnerships with label marketing counterparts, managers, and artists.</li>\n</ul>",
    "title": "Artist Marketing Manager, YouTube"
}