{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckatZWlVoJKmp9P9vNEtLT-mZKIcUexGSoNurf91hWiwSOgCPMA3TR38QcHRi27ez-dtfRAPx6rkxbE39KXBher0WxrkglTK7IHWPYBhVeWmIiiYuO8aeOBM7hOU%3D_V2&jobTitle=Director+of+Product+Management%2C+Merchant+Payments&loc=US",
    "categories": [
        "PRODUCT_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-21T23:02:09.907Z",
    "description": "<p>As the Product Management Director of Merchant Payments, you will be responsible for setting and driving the strategy and business for the Merchant Payments group at Google. Merchants are critical constituents in our global Payments strategy, and our goal is to provide them better payments services and beyond.\n</p>\n\n<p>You will lead the charge to develop foundational payments capabilities for merchants and to take on critical merchant opportunities and services. Some of the interesting challenges that you will face include building out a cohesive payments experience for merchants across online and offline retail, providing an integrated merchant infrastructure and development experience, and developing high-value services and tools.\n</p><p>You will provide hands-on leadership that is based on a model of trust and inclusiveness. You will be a thought leader, working strategically with senior executives within the organization as well as cross-functionally with engineering and product teams to drive roadmap and deliver products to meet merchant needs.\n</p><p>The Payments team at Google has an ambitious goal: making payments fast, easy and safe around the world. This is the team within Google that creates and manages Google’s global billing and payments platform, consumer applications (including the Google Pay app) and merchant services.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4588626851856384",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T20:17:19.787Z",
    "publish_date": "2019-02-27T19:51:58.590Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree in a technical field, or equivalent practical experience.</li>\n<li>10 years of product management or related experience.</li>\n<li>Experience developing Internet products and technologies.</li>\n<li>Experience leading, mentoring and growing a team of product managers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>15 years of experience in product management; providing product vision and roadmaps, and leading end-to-end product development - from Product Requirement Documents to product launches.</li>\n<li>Experience developing high-growth technology platforms and services.</li>\n<li>Knowledge and understanding of current payments technologies and services.</li>\n<li>Demonstrated track record in balancing out product priorities against budget and timelines.</li>\n<li>Ability to set and drive the “big picture” strategy while also rolling up your sleeves and providing detailed guidance on individual projects.</li>\n<li>Demonstrated ability to work in a highly collaborative environment with heavy emphasis on teamwork.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Define product vision and strategy for Merchant Payments group. Work with engineers to deliver on vision and products.</li>\n<li>Design and lead ongoing delivery for a multi-year product roadmap, balancing short-and long-term goals and investments.</li>\n<li>Drive and define key growth goals for the business.</li>\n<li>Manage a team of product managers who set the future direction of our Merchant Payments group. Work closely with our Consumer Payments and Platform teams to build out an integrated global strategy.</li>\n<li>Partner closely across different product groups at Google to create a cohesive offering where the needs of the merchant as a business owner and developer are front and center.</li>\n</ul>",
    "title": "Director of Product Management, Merchant Payments"
}