{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Reston, VA, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYPC0In_DoLEdLuM83PR_kKs1h_uWlATszSjI1che08SOgASYQ8wXVtXbwaBQ1PFLoLV4To8Hh7_fbWVtRzuWTVkohC2DLqCB4L4SENk0jpnw4xFQ7WE_TBYQ30%3D_V2&jobTitle=Technical+Program+Manager%2C+Network+Campus+Infrastructure&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-08T14:31:38.965Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p>\n\n\n<p>Campus Infrastructure Engineering is responsible for the planning and deployment of Google&#39;s data center physical network infrastructure. You will be responsible for physical networking infrastructure from plan and design to overseeing implementation. This includes the continuing evolution of the physical networking plant in our data centers.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/103576719790613190",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:43:35.791Z",
    "publish_date": "2019-02-27T19:43:35.791Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Engineering, Mathematics, Statistics, a related field or equivalent practical experience.</li>\n<li>4 years of experience in program management, project management and/or technical partner management/operations.</li>\n<li>4 years of experience managing multi-group, multi-disciplinary projects.</li>\n<li>4 years of experience in creating fiber routing diagrams and build path records, capacity augment projects, and generating capacity plans and migrations based on the data.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>PMP certification.</li>\n<li>Registered Communications Distribution Designer (RCDD) credential holder.</li>\n<li>Experience in the project and change management of complex projects.</li>\n<li>Track record of making organizational change happen effectively and ensuring lasting benefits of change are achieved.</li>\n<li>Outstanding organizational, prioritization and multitasking skills, with demonstrated success in leading large, cross-functional teams from project inception to delivery.</li>\n<li>Excellent written and verbal communication skills, and a data-driven analytical approach to solving complex challenges.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage the fiber infrastructure planning, construction, and documentation process at Google’s large Data Center campuses. Maintain deployment schedules, monitor production, ensure adherence to specifications and completion of other deliverables.</li>\n<li>Review and thoroughly understand Google&#39;s Network Architecture and Passive Network Infrastructure. Communicate with internal business owners to collect drivers and deadlines for delivering network capacity.</li>\n<li>Evaluate alternatives and develop cost estimates for project-specific feasibility studies. Create standards and templates to streamline build processes. Create statement of works (SOWs) and design documents for network infrastructure and optical cabling for both ISP and OSP.</li>\n<li>Partner with data center and network architecture groups to ensure all designs and implementations balance the current requirements and potential future generations of networking technology. Enable effective deployment and ongoing operations of the infrastructure.</li>\n<li>Benchmark contractors, construction techniques, and designs. Be the expert in campus fiber construction on a truly immense scale. Prepare drawings, maps, scopes of work, and other materials to clearly describe projects to external vendors and internal stakeholders.</li>\n</ul>",
    "title": "Technical Program Manager, Network Campus Infrastructure"
}