{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckddSPLFoN2x4ayMOoUrpEXdW5-gWR4sh9Xk4VcDzpTASOgCPMA3T9vDXRnQo4lVxsidONtAXH6HDPxnA6xquntH4_ptPbcfHU-yrd3L3KHb9JT5Ip4z5AZE5edo%3D_V2&jobTitle=Program+Manager%2C+Legal+Works%2C+Corporate+Engineering&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:07:29.714Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus. As a Program Manager at Google, you lead complex, multi-disciplinary projects. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating goals to project stakeholders. Your projects often span offices, time zones and hemispheres, and it&#39;s your job to keep all the players coordinated on the project&#39;s progress and deadlines.</p>\n\n<p>The Legal Works team provides technology solutions to meet Google&#39;s unique needs in the Legal space with strategy, innovation and thought leadership. \n</p>\n\n<p>We are a product centric team that builds tools from the ground up as well as work with vendors on buy solutions. The part of our work that we can showcase more broadly has been recognized as both impactful and cutting edge by multiple industry awards and recognitions. \n</p>\n\n<p>You will be focused on Google&#39;s Contract Management initiative with cross-functional collaboration across Legal, Sales and Finance. You&#39;ll have the opportunity to work on all aspects of the program management process, from research to design to implementation and measuring success.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4913354214932480",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:47:16.929Z",
    "publish_date": "2019-02-27T19:44:55.560Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>5 years of program management experience (e.g. project and issue tracking, release/risk management, etc.)</li>\n<li>5 years of experience in one or more of the following disciplines: hardware/software project management, work in technical infrastructure and operations planning, product management, large-scale distributed systems.</li>\n<li>Business process and project management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>4 years of relevant work experience managing large-scale and dynamic operational projects, with competing resources, priorities and changing workflows</li>\n<li>Excellent Business Intelligence skills (SQL proficiency, experience with Dremel, F1, Mantra or similar.)</li>\n<li>Strong analytical and structured problem solving capabilities.</li>\n<li>Ability to effectively influence, communicate and drive change (often cross-functionally) with multiple stakeholders at all levels of management.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage programs across multiple Engineering, Product Area and vendor teams.</li>\n<li>Work cross-functionally to develop an enterprise wide rollout plan and on-boarding.</li>\n<li>Manage multiple and simultaneous rollouts and on-boardings.</li>\n<li>Resolve highly critical issues within matrix organization while maintaining rigorous adherence to project timelines and costs.</li>\n</ul>",
    "title": "Program Manager, Legal Works, Corporate Engineering"
}