{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckT8SDIVXszOI84kobptA_VmAkUFDwW3q32CkI3nOY8kSOgASYQ8wlUyZWrq0wdVfDL85BVdGTRy82ZUNo1z7uYxXA2sjzOeKBwITrL3o8-yVsL7R__kvGHfOjdY%3D_V2&jobTitle=Strategic+Partner+Manager%2C+Creator+and+Artist+Development%2C+YouTube+%28French%29&loc=US",
    "categories": [
        "PARTNERSHIPS",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2019-02-13T20:01:47.910Z",
    "description": "<p>The YouTube Partner Program engages millions of content creators — a group that’s growing quickly, and will grow even faster in the coming years. Many of these creators are responsible for “what is original” on YouTube, and are building the media companies of the future. Fast-paced, dynamic, and proactive, the Online Partnerships and Development (OPD) team makes sure that YouTube&#39;s creators around the world have a great experience and achieve success on the platform.</p><p>As a Strategic Partner Manager on the Creator and Artist Development team, you will manage a portfolio of creators to assess their unique needs and goals, craft a plan to grow their channel, and deliver insights and strategy to enable their success on YouTube. Your role will be external and internal as you support many cross-functional initiatives. You will optimize creator channels and develop relationships to ensure your portfolio of YouTube Creators take full advantage of our ever-growing suite of offerings.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/93227175215276742",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-06T23:02:00.938Z",
    "publish_date": "2019-03-06T23:02:00.938Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in account management, customer service, or sales.</li>\n<li>Ability to speak and write English and French fluently and idiomatically.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in the video, media, and/or entertainment industry.</li>\n<li>Experience as a YouTube creator, with a passion for finding, developing, and managing YouTube creators.</li>\n<li>Ability to develop a vision and a strategy.</li>\n<li>Excellent time management skills and attention to detail.</li>\n<li>Exceptional verbal and written communication skills, including presentation writing and delivery.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a portfolio of YouTube creators and develop customized analytical strategies.</li>\n<li>Identify key metrics to evaluate data quantitatively and qualitatively using internal analytics tools.</li>\n<li>Streamline operational workflow and process improvements by identifying and eliminating bottlenecks.</li>\n<li>Act as a liaison between creators and our cross-functional teams, serving as a consultant as needed.</li>\n<li>Project manage initiatives to grow emerging creators, including workshops, events, and other scaled initiatives.</li>\n</ul>",
    "title": "Strategic Partner Manager, Creator and Artist Development, YouTube (French)"
}