{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSDoIPi658TLwhwcdWXRoi4LcL7_52yzGmcrUMWkbnQSOgCPMA3TorBPjSv6jXNJaQ9CaWGozblUB9x-cdwA682ybGo_P-t_8uAUBtg3I3GS4PWTmiz4ExzUicI%3D_V2&jobTitle=Director%2C+Customer+Engineering%2C+Google+Cloud&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-04T18:01:47.716Z",
    "description": "<p>The Director of Customer Engineering, Google Cloud for the North Central Region is a highly visible leadership role in a fast-growing, quick-moving area of Google’s business. As a Director, you will bring excellent leadership skills to the company to lead and manage teams and drive growth within Google Cloud. The Google Cloud team helps customers transform and evolve their business through the use of Google’s global data center and software products. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of how technology is used in the workplace. \n</p>\n\n\n<p>You will utilize your leadership and communication skills to serve as a trusted advisor to help customers and clients realize optimal business potential from Google Cloud. You&#39;ll solve key technical challenges for our customers while liaising with Sales, Product Engineering, Technical Infrastructure, Marketing, Channels and other cross-functional teams. You will be the lead technical executive in the North Central Region to drive transformation for customers while continually staying on top of industry trends and working with Product Engineering to devise enhancements for Google Cloud products based on customer demand.\n</p>\n\n\n<p>In addition, you will lead an organization of Customer Engineers who engage with customers to understand and assess customer requirements, prepare and present demonstrations of Google’s Cloud technologies, design future-state technical architectures, address and overcome technical challenges that arise throughout the sales process and manage implementation and operations.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5132374433923072",
    "location": {
        "address_lines": [
            "Chicago, IL, USA"
        ],
        "city": "Chicago",
        "country": "IL",
        "country_code": "US",
        "display": "Chicago, IL, USA",
        "lat": 41.8781136,
        "lon": -87.6297982
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=1168x324&zoom=12&signature=gIOxZ7dGhwr2LpHWKXkFIvPRMTc=",
        "large_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=1024x324&zoom=12&signature=rKP_A-4nJuEU4qbWPyESRqYx2vk=",
        "small_1x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&size=600x400&zoom=12&signature=ol3MCzT12A291E1FDNtdLB3cK5M=",
        "small_2x": "/maps/api/staticmap?center=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=320+N+Morgan+St+%23600%2C+Chicago%2C+IL+60607%2C+USA&scale=2&size=600x400&zoom=12&signature=MQ1gJIGd_vtm2oDAQWiFTlRbRaM="
    },
    "modified": "2019-02-27T19:47:21.525Z",
    "publish_date": "2019-02-27T19:47:21.525Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science or equivalent practical experience.</li>\n<li>10 years of experience in a Technical Sales Engineering role in a cloud computing environment or equivalent experience in a customer facing technical/engineering role.</li>\n<li>Experience in managing teams of over 150 people and experience in leading managers.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or Master&#39;s degree in Computer Science.</li>\n<li>10 years of experience in selling complex IT solutions within region with a demonstrated clear progression to leadership roles.</li>\n<li>Established market reputation and actionable list of network contacts along with knowledge of solution architecture within web and mobile environments.</li>\n<li>Experience in working with web/internet related technologies, architecture across Software-as-a-Service, Platform-as-a-Service, Infrastructure-as-a-Service (SaaS, PaaS, IaaS) and cloud productivity suites.</li>\n<li>Demonstrated ability to engage and influence both technical and non-technical audiences - from developer to CEO, and the ability to lead with enthusiasm and flexibility in a fast-paced, constantly evolving team environment.</li>\n<li>Demonstrated ability to learn, understand and work with new emerging technologies, methodologies and solutions in the Cloud/IT Technology space.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage a large organization of Customer Engineers to meet quarterly and annual bookings objectives for the region by targeting enterprise companies with a constant march up-market. Recruit talent and coach the team with a focus on providing actionable, forthright feedback.</li>\n<li>Meet with customers/prospects and participate directly in the key agreements and accounts within the region. Work directly with customers to ensure optimized use of Google Cloud. Create activities and develop strategies to resolve technical impediments.</li>\n<li>Continue to implement operational rigor into the organization, opportunities and growth can be “manufactured” with the correct processes and supporting activities, e.g. regular team technical reviews and knowing when to involve other groups (e.g. Sales, Channels, Marketing, Support, Google Ads Sales teams, etc.).</li>\n<li>Drive the Customer Engineering organization to lead all technical sales activities and manage customer deployment and operations. Be responsible for technical aspects of solutions to include such activities as managing product and solution briefings, proof-of-concept work and the coordination of supporting technical resources. Enable and grow channel partners for technical sales and customer deployment and operations.</li>\n<li>Prepare and deliver product messaging to highlight Google Cloud Platform value proposition using various communication techniques. Make recommendations on integration strategies, enterprise architectures, platforms and application infrastructure to implement a complete solution providing best practice advice to customers to optimize Google Cloud Platform effectiveness.</li>\n</ul>",
    "title": "Director, Customer Engineering, Google Cloud"
}