{
    "application_instruction": "<div><div><b>This role will be transitioning from Mountain View to our campus in Redwood City.</b></div><div><br></div></div><br><br><b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; New York, NY, USA; Ann Arbor, MI, USA; Redwood City, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeSJ6lzM29Nr85QsLNZT1Wz6UKv9JsxTbKGLfE_YNyYSOgCPMA3T2Naz_QIxF4p0iZ1ia4gHjngCTm2aratP7fi16sYLeYGI32ZdnEE8Bf8Mo7yjgyvzBDO4Gxs%3D_V2&jobTitle=Account+Executive%2C+New+Business+Sales&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-10-23T22:38:55.945Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>Google’s New Business Sales Team is a group of highly-skilled professionals whose focus is on engaging and obtaining high potential advertisers, and subsequently persuading them to incorporate Google&#39;s range of marketing products (YouTube, Google Ads and the Google Display Network) into their current Marketing strategies. This global and dedicated team is the engine behind Google’s continued growth.</p><p>When our millions of advertisers and publishers are happy, so are we! Our team of entrepreneurial, enthusiastic and client-focused team members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for every type of businesses.<br></p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6350628160602112",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:41:14.846Z",
    "publish_date": "2019-02-27T19:41:14.846Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>2 years of experience in full life-cycle sales.</li>\n<li>Experience in developing relationships with new customers and serving as a consultant.</li>\n<li>Developed sales experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in building a book of business, ensuring the management and fulfillment of strategic targets, and in developing associated agreements.</li>\n<li>Experience in educating new advertisers on the benefits of transitioning from traditional media to digital marketing strategies.</li>\n<li>A proven track record of exceeding quota attainment.</li>\n<li>Demonstrated understanding of the online advertising industry.</li>\n<li>Independent self-starter, comfortable with ambiguity, and with the ability to thrive in a team environment.</li>\n<li>Effective communication skills, with the ability to provide comprehensive advertising solutions to prospective clients.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage your business pipeline and develop a strategy for long-term sustained success.</li>\n<li>Secure new Google Ads clients by presenting marketing solutions, and create relevant ad campaigns that maximize their returns.</li>\n<li>Develop business strategies that optimize the market potential.</li>\n<li>Understand customer needs and requirements.</li>\n</ul>",
    "title": "Account Executive, New Business Sales"
}