{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Atlanta, GA, USA; Pittsburgh, PA, USA; Reston, VA, USA; Washington, DC, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVyqnImbcNEeidaCHwPU5r4AwldepAJKgIfBR4yt4WgSOgASYQ8wIGDSzyJXAkkHCb0-NM7TIaJIKvG-FemEE-8BWGt8lyN9vR4cm60rbkal846zCgXwAhf7Tzk%3D_V2&jobTitle=Enterprise+Field+Sales+Representative%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T16:01:51.949Z",
    "description": "<p><b>Remote locations may be available in the following states: Pennsylvania</b></p><p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As an Enterprise Field Sales Representative, you will be working with top enterprise accounts, leveraging existing relationships with C-level executives, developing new relationships, and acting as a trusted business partner to understand their unique company challenges and goals. You lead the innovative power of our products to make organizations more productive, collaborative, and mobile. Using your passion for Google products, you help spread the magic of Google to organizations around the world.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/116687021964960454",
    "location": {
        "address_lines": [
            "Reston, VA, USA"
        ],
        "city": "Reston",
        "country": "VA",
        "country_code": "US",
        "display": "Reston, VA, USA",
        "lat": 38.9586307,
        "lon": -77.35700279999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=1168x324&zoom=12&signature=FO3u6hazHD_hOatnJgsqGlsYqYU=",
        "large_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=1024x324&zoom=12&signature=T_f2pdXeKWBJBlJdgF_Wq3sTKiQ=",
        "small_1x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&size=600x400&zoom=12&signature=F1k9qg3kFctxjjTJiTEaXPyuZ9A=",
        "small_2x": "/maps/api/staticmap?center=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1875+Explorer+St%2C+Reston%2C+VA+20190%2C+USA&scale=2&size=600x400&zoom=12&signature=A4XKQ5Fj_IRHI4dc1byXLoZICWU="
    },
    "modified": "2019-03-06T16:01:51.949Z",
    "publish_date": "2019-03-06T16:01:51.949Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Computer Science, Business, Marketing, Communication or equivalent practical experience.</li>\n<li>10 years of experience in quota carrying software sales and account management at an enterprise B2B software company selling to global accounts.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience selling infrastructure software, databases, analytic tools, or applications software.</li>\n<li>Experience leveraging C-level relationships with CIO, CMO, CEO, CFO executives.</li>\n<li>Demonstrated success with large, complex commercial and legal negotiations working with procurement, legal, and business teams.</li>\n<li>Track record in working with and managing partners in implementation projects, including global system integrators and packaged software vendors.</li>\n<li>Deep understanding of a specific industry.</li>\n<li>Ability to work with sales engineers and customer’s technical leads to inventory existing software estate, define migration plans, and build business cases for migrations.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build and deepen executive relationships with enterprise customers. Influence long-term strategic direction and serve as a business partner.</li>\n<li>Negotiate and manage entire cycle, often presenting to C-level executives in corporate and global customers.</li>\n<li>Lead account strategy in generating and developing business growth opportunities, working collaboratively with Customer Engineers, and Google Partners.</li>\n<li>Understand each customer’s technology footprint, strategic growth plans and business drivers, technology strategy, and competitive landscape.</li>\n<li>Drive business development, forecast accurately, and achieve strategic goals by leading customers through the entire business cycle.</li>\n</ul>",
    "title": "Enterprise Field Sales Representative, Google Cloud"
}