{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckRGOzEnQB__fr6Rd37rc-Qk2TcgNuEdSmOi37xYhc7oSOgCPMA3TqJIxPHROhwj-oRN4OmVqhbmF3tb3ZJMgt1HOIIZdkBqMI5bBTHaRAAIKbfZdoIHCya02m_0%3D_V2&jobTitle=Marketing+and+Communications+Manager%2C+Real+Estate+and+Workplace+Services&loc=US",
    "categories": [
        "MARKETING",
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:02:32.023Z",
    "description": "<p>As a Marketing and Communications Manager, you will be supporting the Real Estate and Workplace Services (REWS) team and will devise and implement creative, inspiring and integrated communications and marketing solutions to help leaders communicate effectively with their global teams, internal clients and Googlers. You’ll directly lead marketing and communications for multiple complex projects and change initiatives that help bring our iconic REWS brand to life and convey the intentionality behind our spaces and services, ensuring they are implemented successfully. You’ll craft narratives that stick and make the complex easy to understand for a variety of audiences and channels (email, presentations, videos, talking points, articles, websites, social media and other Google channels). You’ll be the driver for communications strategies that keep the global organization connected and focused on our mission and key priorities. For all your work, you’ll track the effectiveness of your plans, using what you&#39;ve learned to make the process more effective and efficient for future projects. \n</p>\n\n<p>This is a highly collaborative role that requires you to influence at all levels, take feedback with grace and incorporate it quickly and be willing to pitch in on projects outside of your core role to help advance the team’s goals.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4973288570945536",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T20:51:13.266Z",
    "publish_date": "2019-02-27T19:45:53.933Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>7 years of experience in internal communications, executive communications, marketing or a related field (e.g., PR, journalism, government, political or nonprofit settings).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience collaborating with and influencing senior leaders and cross-functional partners through relationships, expertise and data.</li>\n<li>Experience developing and deploying marketing and communications strategies across a global organization and with change management (e.g., developing integrated strategies and plans around changes that affect people, process and/or technology).</li>\n<li>Demonstrated ability to work calmly and collaboratively in fast-paced and ambiguous environments, maintain good judgment and escalate appropriately.</li>\n<li>Creative problem-solver, with the ability to think, plan and execute on multiple projects autonomously and in an organized fashion, balancing the long-term and urgent needs of the team.</li>\n<li>Effective written and verbal communication skills, with the ability to write in the Google voice and with tact and diplomacy.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Lead the internal communications and marketing strategy and associated implementation for multiple initiatives from beginning to end. Assess needs, develop plans that break the mold, bringing creativity and innovation in strategy and tactics.</li>\n<li>Create high quality, compelling communications and marketing materials, at the organizational and Google-wide levels, for a variety of channels (email, presentations, live events, videos, websites, social media, etc). Take a lead role on managing issues, demonstrating speed and sound judgment.</li>\n<li>Be a trusted advisor and strategic thought partner to leaders, internal clients and vendor partners. Set the direction for internal communications and marketing efforts, build consensus across stakeholders from cross-functional teams and influence decision making with senior-level audiences to achieve business objectives.</li>\n<li>Manage multiple, complex operational and strategic projects and initiatives, from conception to post mortem, leading cross-functional, global teams to get work done. Prioritize across multiple projects, drawing on sound business judgement and a robust understanding of context and business goals and drive impact and execution by activating and influencing a global network of partners.</li>\n<li>Track effectiveness of campaigns and manage feedback channels, using associated information and insights to make recommendations in order to improve our strategies. Foster buy-in for the plans and lead cross-functional, global teams to get work done.</li>\n</ul>",
    "title": "Marketing and Communications Manager, Real Estate and Workplace Services"
}