{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckexJx03Tp48ssc-bnIrcGvRIzIolfwKiUilcO43ZeZgSOgASYQ8wdVh0YHIQMuFTuZAST8H5Nl0-n60nxMpsxm8Lz9EkS7Yz8ho-zvmeAoEZrJtv2NxKbVnfROk%3D_V2&jobTitle=Facilities+Manager&loc=US",
    "categories": [
        "REAL_ESTATE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-28T17:31:38.901Z",
    "description": "<p>As a Facilities Manager, you have previous experience in real estate, work space planning, and facilities management experience who can take responsibility of facility operations for a large, fast growing site/region.\n</p>\n\n<p>This role will include engagement with cross-functional teams to validate, project and plan for headcount growth to align with the Real Estate growth strategies and facilities operations in the region. With a strong focus on proactive planning, you will partner with the business, other Facilities Managers, and our vendor team to develop and maintain strategic occupancy plans. You will need to demonstrate core organization, data visualization, and management skills to perform all aspects of the role.\n</p>\n\n<p>You&#39;re comfortable in a fast-paced, agile environment with the highest standards of excellence. You have fun with your job, and bring an enthusiasm, dedication and a collaborative spirit to support the fast-paced growth of teams who are working on cutting edge innovation.</p><p>The Real Estate and Workplace Services (REWS) team creates inspiring spaces and innovative services that bring Google’s culture and values to life. We build and maintain all aspects of what keeps our Googley workspaces operating seamlessly across multiple cities and regions globally. We also manage the industry-leading services that help make Google a great place to work -- from how we design healthy and collaborative workspaces, create energizing food experiences, provide convenient transportation and fitness options, to delivering inclusive environments where Google and our employees can thrive.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4650212504141824",
    "location": {
        "address_lines": [
            "Kirkland, WA, USA"
        ],
        "city": "Kirkland",
        "country": "WA",
        "country_code": "US",
        "display": "Kirkland, WA, USA",
        "lat": 47.6768927,
        "lon": -122.2059833
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=1168x324&zoom=12&signature=BUakpYMrt4PcA_BkD8TEXxwl5yE=",
        "large_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=1024x324&zoom=12&signature=zdt0AODknQHKKtlab5UzXYjjwOU=",
        "small_1x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&size=600x400&zoom=12&signature=77Xz0BHyJOhV95ydWoFgQ5UMRoc=",
        "small_2x": "/maps/api/staticmap?center=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=747+6th+St+S%2C+Kirkland%2C+WA+98033%2C+USA&scale=2&size=600x400&zoom=12&signature=djRWF_5sVRDgCFnaqcEvXvug7iU="
    },
    "modified": "2019-03-18T20:22:31.340Z",
    "publish_date": "2019-03-01T02:31:54.165Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in and ability to run projects, such as long term planning, short term moves, in order to meet the business needs of a site/region.</li>\n<li>5 years of occupancy planning and facilities experience with an emphasis on planning, facilities, hospitality, corporate services, property management or equivalent office management experience.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience developing and managing occupancy plans and scenario planning with strong data visualization, presentation and negotiation skills</li><li>Experience developing and managing budgets (including capital budget justification) with strong financial, contract management and purchasing skills.</li><li>Ability to suggest and implement creative, innovative solutions to existing and future issues; Strategic, analytical, operational and services experience, including the ability to work in a collaborative environment.</li><li>Presentation skills.</li><li>Excellent communication skills, both written and verbal, with the ability to influence at all levels. </li></ul>",
    "responsibilities": "<ul>\n<li>Provide a pivotal role in facility service operations throughout the region including new office builds and expansions, move coordination, capacity and space planning, implementation of new processes and procedures.</li>\n<li>Serve as a key occupancy planning point of contact as a part of the facility service operations team for the site/region.</li>\n<li>Maintain relationship with the business to understand needs and drivers, collaborating with the vendor partner occupancy planners to track and document the program requirements to develop well informed plans.</li>\n<li>Manage and analyze data from various systems in partnership with the vendor partner occupancy planners to develop and communicate occupancy scenarios that drive optimal performance and workflow of the business.</li>\n<li>Collaborate with REWS partners to develop analytical frameworks, processes and strategies for occupancy planning in the facilities organization.</li>\n</ul>",
    "title": "Facilities Manager"
}