{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckWithRfmHj-P0It8MaQ9kcYwqRGOP3IBWxKCsBEfqOwSOgASYQ8w7rlr5X7vxFAD18NfQQ3N2JDo6BM2sr9FUolCKf3g19CnEoIUN6rGzP2kfn-ERWciypiVtnE%3D_V2&jobTitle=Associate+Product+Counsel%2C+Google+Cloud&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-23T20:01:33.500Z",
    "description": "<p>As Associate Product Counsel at Google, you work on the most exciting legal issues as disruptive technological innovations require creative and proactive legal guidance. You&#39;re part of a whip-smart group of in-house lawyers and the projects and cases you take on challenge you to think big and differently. You are collaborative -- ready to partner in initiatives that influence all aspects of the business and work with Googlers from all over the company. As an integrated part of the team, you proactively assess legal risks and advise on products that will not only move information into the 21st century, but move information law forward as well.</p>\n\n<p>Google Cloud helps organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the Cloud. As a product counsel supporting Google Cloud, you will advise on products and infrastructure designed for both consumer and enterprise use cases.</p><p>20th century laws don&#39;t always solve 21st century problems, and Google Legal crafts innovative approaches for handling some of the toughest legal challenges of the information age. Whether you&#39;re a patent attorney, an intellectual property expert or an engineer headed to law school, Google Legal lets you take on unanswered legal quandaries and create new precedents. Our innovative services raise challenging questions that demand creative and practical answers. We provide those answers by working at the crossroads of the law and new technology, helping Google build innovative and important products for users around the world.</p>",
    "education_levels": [
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5215840498647040",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T21:08:35.761Z",
    "publish_date": "2019-02-27T19:54:43.096Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Juris Doctorate degree or equivalent practical experience.</li>\n<li>Admitted to the bar and in good standing or otherwise authorized to practice law in California.</li>\n<li>1 year of experience as an in-house attorney at a technology company, working with Product and Engineering teams.</li>\n<li>3 years of experience as an attorney.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of experience as an in-house attorney at a technology company working on privacy matters.</li>\n<li>Experience advising clients in all aspects of product development, including privacy, technology, security, IP, and consumer protection matters.</li>\n<li>Experience with cloud services, enterprise product issues, or machine learning.</li>\n<li>Ability to manage several simultaneous projects and meet deadlines, demonstrating excellent organizational skills.</li>\n<li>Ability to speak and write in English fluently and idiomatically.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Ensure compliance with U.S. and international laws and regulations dealing with privacy, intellectual property, content regulation, consumer protection, regulatory compliance.</li>\n<li>Advise cross-functional teams on legal issues and risks and internal policies and procedures from the initial stages of product development to, and beyond, launch.</li>\n<li>Respond promptly to a wide range of requests from Legal and Business colleagues, including Law Enforcement, Security, Engineering, Product Management, Marketing, Communications, Compliance, Policy, and other groups.</li>\n<li>Manage a diverse and challenging workload with competing priorities and stakeholders.</li>\n</ul>",
    "title": "Associate Product Counsel, Google Cloud"
}