{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUxdIuQZ9LF5VfboQRk1KFd2Vrs47tW2ZpecMFD6-IwSOgASYQ8ww973_Ms--OK6fctqHFugQWh9EUNt-tkgLQ9K4b8_yJSH7CRKWuqCnMNZoxxE-oTTjETMKHo%3D_V2&jobTitle=Enterprise+Field+Sales+Representative%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-06T16:01:51.854Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As an Enterprise Field Sales Representative, you&#39;ll be selling to our enterprise accounts. You’ll leverage existing relationships with C-level executives, develop new relationships and act as a trusted business partner to understand their unique company challenges and goals. You will advocate the innovative power of our products to make organizations more productive, collaborative, and mobile. Using your passion for Google products, you help spread the magic of Google to organizations around the world.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/111409692569150150",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-03-06T16:01:51.854Z",
    "publish_date": "2019-03-06T16:01:51.854Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in Computer Science, Business, Marketing or Communication, or equivalent practical experience.</li>\n<li>10 years of experience focused on quota carrying software sales. strategic account management at an enterprise B2B software company focused on global accounts.</li>\n<li>Experience in strategic account management at an enterprise B2B software company focused on global accounts.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>10 years of experience selling infrastructure software, databases, analytic tools, or applications software with a demonstrated track record working towards strategic business goals.</li>\n<li>Experience with large complex commercial and legal negotiations working with procurement, legal, and business teams.</li>\n<li>Strong track record in working with and managing partners in complex implementation projects including global system integrators and packaged software vendors.</li>\n<li>Excellent at leveraging C-level relationships with executives to sell software.</li>\n<li>Ability to work with sales engineers and customer’s technical leads to inventory existing software estate, define migration plans, and build business cases for migrations.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build and deepen executive relationships with enterprise customers, and bring to Google your mature cross-organization relationships to help us grow into new organizations. Influence long-term strategic direction, and serve as a business partner.</li>\n<li>Manage entire complex sales-cycles, often presenting to C-level executives in corporate and global customers.</li>\n<li>Lead account strategy in generating and developing business growth opportunities, working collaboratively with Customer Engineers, and Google Partners - all to maximize business results in territory and open up opportunities with large enterprise customers.</li>\n<li>Actively understand each customer’s technology footprint, strategic growth plans and business drivers, technology strategy and external landscape.</li>\n<li>Drive business development, forecast accurately and achieve strategic goals by leading customers through the entire business cycle.</li>\n</ul>",
    "title": "Enterprise Field Sales Representative, Google Cloud"
}