{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fcka0dgZuOQsZhuHxqZAJYS7b1xSWvkpkTnxFRuBq4_dYSOgASYQ8wiQGt4ZxwTbjjF33qpf5krJJthrqaroBU9VgmX9Ex6KluzpfswuL_WUctzo_Sx6B4ZhAlie8%3D_V2&jobTitle=Network+Engineer%2C+Corporate+Network+Implementation&loc=US",
    "categories": [
        "NETWORK_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-29T17:31:45.308Z",
    "description": "<p>Google is proud to boast a network that provides service to millions of Internet users around the world. The Network Engineering team is responsible for operating that network reliably and at scale. As a member of the team, you have a direct impact on design and feature enhancements to keep our systems running smoothly. You also ensure that network operations are safe and efficient by monitoring network performance, coordinating planned maintenance, adjusting hardware components and responding to network connectivity issues. Google&#39;s complex network generates a constant stream of challenges which require you to continually be innovative with an evolving set of technologies. Keeping the network reliable ensures that our users stay connected with our suite of applications, products and services.</p>\n\n<p>Our experience has always been core to all we do in Corporate Network. We aspire to provide a predictable experience for Googlers with connectivity, mobility, security, privacy, and performance everywhere. At the same time, we want to support Partner Technical Infrastructure Teams’ objectives and policies as well as serve Product Area and Alphabet requests. We also make our Corporate Network a platform to enable new services and experiences for Googlers.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/88829722214965958",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:54:56.624Z",
    "publish_date": "2019-02-27T19:54:56.624Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Experience with access network protocols, 802.1ad, PIM / IGMP, and QoS.</li>\n<li>Experience with TCP/IP fundamentals and network protocols (such as MPLS, IPv6, Multicast, OSPF, BGP, IS-IS).</li>\n<li>Experience with CCNA/JNCIA.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>2 years of hands-on experience deploying and operating a large enterprise network.</li>\n<li>Understanding of IP networks, layer 2/3. he operation of IP networks.</li>\n<li>Familiarity with test equipment such as OTDR, OSA, BERT and/or other network analysis tools.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Engage in and improve the lifecycle of services—from inception and design, through deployment, operation and refinement.</li>\n<li>Design and build reusable designs and systems that promote scale, reliability, security and efficiency.</li>\n<li>Support the Corp Network, the software and systems that manage the network, and function as technical, engineering and operational subject matter expert.</li>\n<li>Work with partner teams to build/re-use open source or common systems wherever possible to accelerate development and delivery of the platform.</li>\n<li>Participate in on call schedule with other members of the team providing third-tier support, and solving complex issues.</li>\n</ul>",
    "title": "Network Engineer, Corporate Network Implementation"
}