{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYIWd6lz5i3ynj0xUyk_-0_t8HELC1j9FBgt_1tO0ZUSOQCPMA3TNYcx81vfY3kibLrCA05PqXYbOLEA2obYEmgDOnsWrZfmxuULTpMTKPLeX-ExxAwHNS5ZDg%3D%3D_V2&jobTitle=Energy+Strategic+Negotiator%2C+Data+Centers&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-17T10:01:35.195Z",
    "description": "<p>Google&#39;s infrastructure needs go far beyond server computers. As Google&#39;s products and services scale the globe, the Strategic Negotiation team works behind the scenes to secure infrastructure for Google&#39;s future -- everything from underwater cables to physical data center space. As a Strategic Negotiator, you combine your deep market knowledge of a given sector with tech industry savvy to negotiate cost-effective solutions to support Google&#39;s infrastructure growth. You&#39;ll work with specific project teams on negotiating deals, managing vendor and partner relationships and presenting deal recommendations to our Tech leadership. Your successful negotiations have the potential to save Google millions of dollars in operating costs and impact every part of the business.</p><p>As an Energy Strategic Negotiator, you will lead the management of Google’s global portfolio of renewable energy and electricity supply contracts for Google’s global fleet of data centers. You will help to drive the team&#39;s overall energy-related strategy development and execution, lead individual strategic initiatives and projects, and work with teams across the company in support of Google&#39;s data center energy portfolio.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5356268413714432",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-18T21:15:56.955Z",
    "publish_date": "2019-02-27T19:45:07.326Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree in technology, engineering, science or economics, or equivalent practical experience.</li>\n<li>10 years of experience in a energy procurement related role, with demonstrated track record of managing a large portfolio of energy contracts, managing portfolio risk, reducing costs and improving efficiencies.</li>\n<li>Experience with quantitative modeling and forecasting for commodity markets, portfolio risk management, energy supply contract negotiation and prospective deal valuation.</li>\n<li>Experience maintaining relationships with a variety of counterparties.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in corporate energy procurement.</li>\n<li>Experience in data center energy procurement.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Build and execute an energy portfolio management strategy to support Google&#39;s global fleet of data centers and related assets and contracts, including over 3GW of existing renewable energy contracts.</li>\n<li>Work with leadership and the team to identify, define and pursue new strategic energy-related projects and initiatives necessary to meet Google&#39;s future power supply needs.</li>\n<li>Develop and maintain open position reports, recommendations on forward purchases of energy products, risk management transactions, and collaboration with internal stakeholders to execute trades to manage the portfolio to the company’s standards.</li>\n<li>Collaborate within Google to build broad strategies across teams, especially those working on energy and risk management (e.g. Finance, Accounting, Tax functions).</li>\n</ul>",
    "title": "Energy Strategic Negotiator, Data Centers"
}