{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckdv4sNjknEBf35KKqBv04svWb7w7BVRMONqrZ4Gajx8SOQCPMA3T88KhBcpLk5-9OE-0LQ354V23nYjfyTZ_k3dgV3OZLplIXZ5J36bhaLs_r8tW6tz-XmHj7A%3D%3D_V2&jobTitle=Software+Engineer%2C+Hardware%2FSoftware+Co-Design&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:03:20.505Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br><br>With your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n<p>At Google, you will have the opportunity to find the perfect blend of software design practices and hardware development complexity. In this role, you will use your software engineering expertise to help solve complex problems including but not limited to hardware acceleration, performance bottlenecks, computer architecture, verifying digital design chips, automation, and machine learning. Whether your strength is in software coding, with a good understanding of hardware, or you are a hardware engineer with software proficiency, this balanced role will let you shine in both disciplines at the same time. </p><p>Platforms Engineering performs research, design and development for the hardware, software and networking technologies that power all of Google&#39;s products and services (including Google Cloud Platform, Tensor Processing Units, Android, Chrome, VR, Gmail, Maps and more). We constantly work on solutions to counter the slowing of Moore’s Law. Platforms offers impactful projects at every level of the technology stack, from the chip level to massive distributed systems design and software development.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4815596833406976",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:40:26.314Z",
    "publish_date": "2019-02-27T19:40:26.314Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BS degree in Computer Science or Electrical Engineering, or equivalent practical experience.</li>\n<li>Experience in C/C++, Scripting. Experience with computer architecture and new hardware design, including memory/storage systems.</li>\n<li>Experience with system and/or low level software.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MS/PhD in Computer Engineering, Electrical Engineering, or Computer Science.</li>\n<li>Experience with computer architecture, non-x86 microarchitectures including low level performance analysis and memory/storage systems. Experience with large-scale distributed systems, networking, and related software infrastructure. Experience with silicon architecture and design with the ability to root cause performance bottlenecks.</li>\n<li>Experience in hardware design. Experience with hardware structures and how they are composed to create chips. Experience in hardware bring up, Linux kernels, application software, and RTL design.</li>\n<li>Good exposure and familiarity to hardware design, with ability to write and understand Verilog Register Transfer Level code. Knowledge of and experience with interfacing to industry-standard HDL simulators.</li>\n<li>Familiarity with Verilog and hardware EDA tools and knowledge of language compilers.</li>\n<li>Proficiency in Python, with good understanding of Object Oriented Programming and Functional Programming.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Design, develop, test, deploy, maintain and improve software.</li>\n<li>Manage individual project priorities, deadlines and deliverables.</li>\n</ul>",
    "title": "Software Engineer, Hardware/Software Co-Design"
}