{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckarJv4udOpErnpvkhgOrq6txuA_J6OX5w2e5E-HGTQ8SOgASYQ8w2Pp_TTQ3gqbDL53FTnORt-h20RH70oLvFqosPYOWunkhQaR2r28XZB3YjyOx7aNKXzRygPY%3D_V2&jobTitle=Quality+Lead+Analyst%2C+Vendor+Operations&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-26T12:01:50.597Z",
    "description": "<p>Trust and Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p>\n\n<p>Trust and Safety Vendor operations focuses on managing a large and growing contingent workforce across 10+ Trust &amp; Safety sites. The Trust and Safety Vendor operations team is responsible for the strategy, governance, and operations across the Temp, Vendor and Contractor (TVC) population. We partner with teams across; Legal, Security, XWS, REWS, Trust and Safety Engineering and external Vendor partners to bring innovation and technology via operations. Vendor Operations team members have the opportunity to create, develop and implement some of the most complex operations around the world.</p><p>At Google we work hard to earn our users’ trust every day. Trust &amp; Safety is Google’s team of abuse fighting and user trust experts working daily to make the internet a safer place. We partner with teams across Google to deliver bold solutions in abuse areas such as malware, spam and account hijacking. A diverse team of Analysts, Policy Specialists, Engineers, and Program Managers, we work to reduce risk and fight abuse across all of Google’s products, protecting our users, advertisers, and publishers across the globe in over 40 languages.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/127809557574361798",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:11.927Z",
    "publish_date": "2019-02-27T19:50:11.927Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in a technical field or equivalent practical experience.</li>\n<li>4 years of experience working in a quality management role or related field with a focus on content moderation.</li>\n<li>Program management experience.</li>\n<li>Experience with SQL, Dremel, Plx, developing Chrome script/extensions, other reporting tools and techniques and data analysis for data driven decision making.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, MS degree, or similar advanced degree.</li>\n<li>PMP and/or Six Sigma Certification.</li>\n<li>Experience working in a consulting organization or quality practice.</li>\n<li>Excellent analytical skills with knowledge of quality assurance and experience with data analysis and problem solving.</li>\n<li>Demonstrated ability to lead and influence without direct authority and drive change at all levels within an organization, including engineering and business executives.</li>\n<li>Excellent communication and presentation skills, with the ability to write clearly and succinctly in technical and non-technical formats and to operate with energy and flexibility in a fast-paced, constantly evolving and collaborative environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop, pilot and scale quality programs; act as advocate for quality and independently manage projects from concept to launch.</li>\n<li>Monitor, measure and communicate project progress, potential risks/delays and performance as well as identifying quality process gaps and lead continuous improvement cycles.</li>\n<li>Conduct root cause analysis, segmentation of errors, trend and other data analysis and conceptualize and develop tools and frameworks needed for the smooth and scalable execution of the programs.</li>\n<li>Report, analyze, and provide insights on our quality performance and programs.</li>\n<li>Ensure the program management of the quality programs and provide feedback and conduct coaching sessions for team members.</li>\n</ul>",
    "title": "Quality Lead Analyst, Vendor Operations"
}