{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX3sPXukFeELeJsL1LEA-rnLGomVVaSF4TH_IV96VhYSOgASYQ8wuDcPwYoFgohPn2ZWeU5SqiF0MKuYLZf5_cYB079xy8zVkcwZVFh1-I4X2v0VcOpIC4J7RO8%3D_V2&jobTitle=Director%2C+Global+Policy+and+Political+Campaigns&loc=US",
    "categories": [
        "LEGAL"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-19T15:31:52.642Z",
    "description": "<p>As a member of Google’s Government Affairs and Public Policy team, you&#39;ll be part of a diverse global government affairs team, working across regions, product areas, and functions. You’ll combine creativity and intellectual rigor with the organizational skills to manage various campaigns, projects and initiatives. In this role, you’ll advocate for Google to bring external perspectives back into the company to inform our perception and direction. You&#39;re passionate about the opportunity to shape the future of how we use and build technology for everyone.</p>\n\n\n<p>As a Director of Global Policy and Political Campaigns, you&#39;ll help shape Google&#39;s policy efforts, including managing strategic outreach initiatives and policy campaigns to advance the values and interests of the Google community. You&#39;ll coordinate with members of the globally distributed Public Policy team, the Business and Product organizations, and key cross-functional partners in Marketing, Legal, and PR to develop our external narrative and strategy for key policy challenges and advise Product teams through the public policy lens. \n</p>\n\n\n<p>In this role you will develop, organize, manage, and communicate critical plans, initiatives, and strategy to advance public policy goals in support of Google’s business. The role will lean heavily toward project management to support key strategic and operational priorities of Google and the policy organization.</p><p>Google takes its responsibilities seriously, including engaging with government and other stakeholders on important public policy challenges. The Government Affairs and Public Policy (GAPP) team leads the company’s engagement with executive branch officials, legislators, regulators and third-parties in the formation of public policy. Working closely with Google leaders, GAPP seeks to identify key policy issues, listen carefully to others’ views and opinions, and distill and share the company’s perspective on those issues with external stakeholders. While we focus on challenges affecting the internet, our issue areas are increasingly broad and encompass many areas where public policy, business, and technology intersect.<br></p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/143740395239416518",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-19T15:31:52.642Z",
    "publish_date": "2019-03-19T15:31:52.642Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor’s degree or equivalent practical experience.</li>\n<li>13 years of work experience, including experience managing policy campaigns and outreach with stakeholders.</li>\n<li>3 years of experience in people management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience within the technology industry, and familiarity with internet technologies, new media, content moderation, and the surrounding policy environments.</li>\n<li>Project management experience.</li>\n<li>Experience working across an international organization.</li>\n<li>Exceptional written and verbal communication skills, with a track record of executing cross-functional projects.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Develop and deploy strategic outreach and policy campaigns on targeted policy issues that have been identified as major priorities for the business.</li>\n<li>Design campaigns with a broad audience of stakeholders in mind, including policymakers, trade associations, industry partners, key opinion formers, non-profit groups, and others. Help create and maintain a user-focused online environment and an open internet.</li>\n<li>Build strategic external relationships to help shape public and political dialogue. Monitor and research current and relevant emerging public policy issues and thought leaders.</li>\n<li>Manage policy projects on a host of issues and work cross-functionally to develop policy positions for review by Google’s Policy, Legal, and Management teams. Draft plans and other written communications to support strategic goals.</li>\n<li>Execute our policy strategy for issues including media regulation, copyright, and net neutrality in collaboration with global public policy colleagues.</li>\n</ul>",
    "title": "Director, Global Policy and Political Campaigns"
}