{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Cambridge, MA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckb111eXzaN0lXoMLf_i7oooZrK83ctj5l6JvAInqwXYSOQASYQ8wgPrMrboWG5vEdxJK7HhqDl6l4XZsPOMhnXSZA_Xrx4cZrZKV4pM9tucm88sv1ZxOdbR3ag%3D%3D_V2&jobTitle=Cloud+Consultant%2C+Healthcare+and+Life+Sciences%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-19T14:01:42.671Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n\n<p>As a Cloud Consultant, you will work directly with Google’s most strategic customers on critical projects to help them transform their businesses. You will provide management, consulting and technical support to customer engagements while working with client executives and key technical leaders to deploy solutions via Google’s Cloud Platform.\n</p>\n\n\n<p>You will also work closely with key Google partners currently servicing top accounts to manage programs, deliver consulting services, and provide technical guidance and best practice expertise.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/76896731377083078",
    "location": {
        "address_lines": [
            "Cambridge, MA, USA"
        ],
        "city": "Cambridge",
        "country": "MA",
        "country_code": "US",
        "display": "Cambridge, MA, USA",
        "lat": 42.3736158,
        "lon": -71.10973349999999
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=1168x324&zoom=12&signature=JaO6-ZwWrNFtKn3WQm2SRjf9ZbE=",
        "large_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=1024x324&zoom=12&signature=ztO_GFdS-eUPL9b-BGZvaDyVm3I=",
        "small_1x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&size=600x400&zoom=12&signature=6Okll-qvZ7t3C6x3-kMPp_P58Yc=",
        "small_2x": "/maps/api/staticmap?center=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=355+Main+Street%2C+Cambridge%2C+MA+02142%2C+USA&scale=2&size=600x400&zoom=12&signature=vS95FBFswniXfAJTkSOvWzAjgvg="
    },
    "modified": "2019-02-27T19:56:20.531Z",
    "publish_date": "2019-02-27T19:56:20.531Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>5 years of experience reading software code in one or more languages such as Java, Javascript, Python. Experience creating architectures and developing or maintaining cloud solutions in virtualized environments.</li>\n<li>5 years of customer-facing experience in healthcare and/or life science IT infrastructure.</li>\n<li>Experience with computing infrastructure, including virtualization, hosted services, multi-tenant cloud infrastructures, storage systems, and content delivery networks.</li>\n<li>Experience with Cloud security, networking, and operations.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>5 years of experience in cross-functional project management, communications, and stakeholder management.</li>\n<li>Experience with detailed networking infrastructures and system design of load balancers, firewalls, and VPN in the deployment of virtual machines and containerized applications.</li>\n<li>Experience designing and deploying large scale distributed data processing systems with one or more technologies such as MySQL, Cassandra, HBase, Redis, MongoDB, Hadoop, Spark, fluentd.</li>\n<li>Experience in systems design with the ability to create architecture or explain complex systems interactions including data flows, common interfaces, APIs, and methods available.</li>\n<li>Ability to travel up to 40% of the time.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Interact with Sales/Partner Leads and technical stakeholders to translate complex customer requirements into recommendations for appropriate solution architectures and consulting services.</li>\n<li>Provide a point of escalation for customer inquiries and serve as the first point of contact to Google for consulting services.</li>\n<li>Work with customer technical leads, client executives, and partners to manage and deliver successful migrations to cloud solutions.</li>\n<li>Work closely with practice areas, Product, and Engineering to package best practices and lessons learned into thought leadership, methodologies, and published assets.</li>\n<li>Understand customer needs and help shape Google’s long-term product strategy. Be an advocate of Google’s product innovation.</li>\n</ul>",
    "title": "Cloud Consultant, Healthcare and Life Sciences, Google Cloud"
}