{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2Fckczz8xcL7u_JE-KeuP79hYxGIZSTBf2hN2ZOMMB0JxcSOgASYQ8wtvleCUxMAusOzleUVvRNDs2HoII6lbHDh-ki196_8L62zFY7fsMjhiT75b2RlyrAIfTAaLw%3D_V2&jobTitle=Technical+Program+Manager%2C+Machine+Maintenance%2C+Hardware+Operations&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT",
        "TECHNICAL_INFRASTRUCTURE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-14T14:31:49.596Z",
    "description": "<p>Google&#39;s projects, like our users, span the globe and require managers to keep the big picture in focus while being able to dive into the unique engineering challenges we face daily. As a Technical Program Manager at Google, you lead complex, multi-disciplinary engineering projects using your engineering expertise. You plan requirements with internal customers and usher projects through the entire project lifecycle. This includes managing project schedules, identifying risks and clearly communicating them to project stakeholders. You&#39;re equally at home explaining your team&#39;s analyses and recommendations to executives as you are discussing the technical trade-offs in product development with engineers.</p><p>As a Machine Maintenance Technical Program Manager, you will drive sustainability and maintenance globally across Hardware Operations (machines/networks/data security) deployment at Google&#39;s data centers.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/112604599447102150",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-14T14:31:49.596Z",
    "publish_date": "2019-03-14T14:31:49.596Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in Engineering, Computer Science or other Quantitative field (e.g. Physics, Mathematics, Chemistry, Statistics), or equivalent practical experience.</li><li>7 years of experience in software and/or hardware development/integration and technical program management.</li><li>Experience supporting or driving programs in a technical organization.</li><li>Experience defining system and/or process requirements for large-scale systems.</li></ul><br><p>Preferred qualifications:</p><ul><li>Masters degree in Computer Science, Engineering or Mathematics.</li><li>Experience in leading teams of highly talented, independent individuals with a track record of quickly earning credibility based on your knowledge and accomplishments.</li><li>Experience in delivering solutions and completing complex hardware/software or infrastructure projects in data center environments.</li><li>Experience in software programming and scripting.</li><li>Demonstrated experience with machine learning.</li><li>Ability to develop and validate complex models for quantifying machine fleet health.</li></ul>",
    "responsibilities": "<ul><li>Lead several technical programs for ​hardware fleet management,​ including several machine learning platforms, setting priorities for ​various cross-functional partners, ​leading cross-functional teams to ​execute on projects​​ critical to Google data center fleet scalability.</li><li>Work closely with ​various Product Areas (PAs), Site Reliability Engineers (SREs), Product Area Research Managers (PARMs) and distill their machine fleet needs and execute them cross-functionally in an efficient and scalable fashion.</li><li>Guide other fleet maintenance Technical Program Managers spread geographically in successfully executing fleet scalability and repair process standardization.</li><li>Provide hands-on project management, cross-functional coordination, ​manage release schedules, milestones, stakeholders and inter/intra team communications.</li><li>Execute operational service level agreements/objectives (SLA/SLO) by partnering with data centers, data center software (DCSW) teams, supply chain, logistics, operational decision support (ODS) and fleet deployment and planning organizations.</li></ul>",
    "title": "Technical Program Manager, Machine Maintenance, Hardware Operations"
}