{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Chicago, IL, USA; San Francisco, CA, USA; New York, NY, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTsQbYSdPW64XIcMMUcsyNxRItVjnHo08YM1O_AoLAUSOgCPMA3T5OS1dZ0Xd6jwH5pZrZDxG37onAXrVPGyzVzBBn40qK1DIOZ6oVFysQxLgr84GUyiQiiH3VY%3D_V2&jobTitle=Programmatic+Account+Strategist%2C+gTech+Professional+Services+%28gPS%29&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-11T20:01:40.264Z",
    "description": "<p>gTech’s Professional Services team takes a creative, collaborative, and customer-centric approach to provide foundational services and forward-looking business solutions to top advertiser and publisher customers. Through technical implementation, optimization, and key solutions, gTech Professional Services helps customers attain their business goals while building long-term capabilities.</p>\n\n<p>The gTech Ads team is a solutions-generating team that helps our advertisers reach their goals. Our mission is to make it easy to run ads with Google. \n</p>\n\n<p>As a Programmatic Account Strategist, you work closely with our sales team to understand our most strategic advertisers’ performance goals and help them meet their digital marketing campaign objectives. You leverage your analytical skills, technical aptitude and digital advertising experience to closely monitor and optimize campaigns, providing our clients with valuable insights and recommendations. You will also collaborate with global stakeholders in sales, product, engineering, and vendors to help bring these solutions to life.</p><p>Google creates products and services that make the world a better place, and gTech’s role is to help bring them to life. Our teams of solution-oriented trusted advisors support millions of customers globally. Our solutions are rooted in our technical skill, product expertise, and a thorough understanding of our customers’ complex needs. Whether the answer is a bespoke solution to solve a unique problem, or a new tool that can scale across Google, everything we do aims to ensure our customers benefit from the full potential of Google products.<br><br>To learn more about gTech, check out our <a href=\"https://www.youtube.com/watch?v=HcjR6ZngQcw\">video</a>.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5028460286377984",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T20:55:08.282Z",
    "publish_date": "2019-02-27T19:51:53.440Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>BA/BS degree or equivalent practical experience.</li>\n<li>4 years of experience in managing digital advertising campaigns for large, complex clients.</li>\n<li>Experience in online measurement, operations, ad networks, DSPs, digital video and programmatic platforms.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or other advanced degree.</li>\n<li>Experience of developing strong relationships, being highly accountable and meeting objectives.</li>\n<li>Ability to manage auction-based display campaigns across Google Marketing Platform and Google Ads for large, complex clients focused on performance goals.</li>\n<li>Effective analytical capabilities with the ability to see granular as well as big picture issues.</li>\n<li>Developed business acumen, problem solving and project management skills.</li>\n<li>Effective communicator, detail oriented, analytical mindset, technical aptitude, with an understanding of the digital display marketplace.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Manage account growth through implementing campaign solutions: developing campaign strategy, building campaigns, and monitoring and optimizing for spend and performance to meet and exceed customer marketing Key Performance Indicators (KPIs).</li>\n<li>Use advanced optimization techniques across Google, Mobile and Video to optimize marketers’ display spend. Analyze trends and develop bid strategies, manage creative assets and make budget allocation decisions across the book of business.</li>\n<li>Identify and seize opportunities in an account. Create and support multi-product solution promotions and collaborate with the in-market sales team to create a growth strategy for potential advertisers.</li>\n<li>Collaborate effectively with vendors and in-market sales team to drive growth plans of our advertisers. Develop and apply knowledge of market and competitive environment for vertical and sub-verticals in solutions offered.</li>\n<li>Contribute to global scaled solutions efforts, including documenting best practice guides, socialize scenarios that adversely impact performance and follow process guidelines, vendorize solutions, build BRDs to help influence product development and optimization automation.</li>\n</ul>",
    "title": "Programmatic Account Strategist, gTech Professional Services (gPS)"
}