{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckfHBvPAiLiXMe2q8FTkyUs9Os4ZVT4vU8zSwEtW8t2MSOgCPMA3TVXZlO-ZcJeGFprVUPkJC7kIPLirAzZ90yzUcFcU3aum2eFM05eLE3JAyaH_2mTRroKJ3GxE%3D_V2&jobTitle=Revenue+Accounting+Systems+Analyst&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:33:52.208Z",
    "description": "<p>Google accountants are a savvy bunch who handle the core accounting responsibilities at Google. As a member of this team, you know your accounting principles and the full accounting process end to end. You&#39;ll advise on financial reports required by governmental regulations, and you&#39;ll review, analyze, and interpret financial and budgetary reports -- and all this sounds like fun to you. Every day is a new challenge, and you&#39;re continually looking for ways to help our team get better at what we do, in the most efficient way possible. A team player at heart, you collaborate with our global team, advocate best practices and roll up your sleeves to pitch in when it&#39;s all hands on deck. You move fast while keeping your attention to detail, and you tap into your problem-solving skills to support Google&#39;s business objectives.</p>\n\n\n<p>As the Revenue Accounting Systems Analyst, you will be a key contributor with a track record working with global, high tech companies. You will leverage your technical and project management skills to participate in cross-functional initiatives to enhance existing systems, scope and design new financial systems, and drive efficiency improvements in partnership experiences. Analysts on the Global Revenue Systems team collaborate with multiple teams to ensure that we have robust, scalable accounting, and reporting processes to support our accounting operations and deliver on external data requests.\n</p>\n\n\n<p>In this role, you will focus on executing our code based monthly accounting operations and implementing opportunities to optimize our operations through programmatic automations. You will bring excellent attention to detail with the ability to work well with other teams, provide outstanding customer service, and deliver on timelines. Additionally, you will partner with our accounting operations to provide timely reports and develop scalable automations for accounting and reporting processes. You will also work closely with other teams, such as Engineering, Tax, Compliance, and Statutory Reporting to manage financial risk, ensuring that partners can adhere to regulatory requirements.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/4774710758014976",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:52:23.456Z",
    "publish_date": "2019-02-27T19:52:23.456Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Finance, Accounting, or equivalent practical experience.</li>\n<li>Experience with databases, including experience with SQL queries across standard commercial databases or equivalent experience in other programming languages.</li>\n<li>Experience developing controlled automated processes in scope for SOX testing.</li>\n<li>Experience executing accounting processes.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Understanding of accounting principles.</li>\n<li>Knowledge of standard finance systems (e.g., Hyperion, OBIEE).</li>\n<li>Knowledge of core finance processes.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work with cross-functional departments including Accounting, Tax, Compliance, Legal, Engineering, Statutory Reporting, on reporting related activities and system initiatives.</li>\n<li>Use SQL to provide financial data for internal and external financial reporting.</li>\n<li>Evaluate data gathered from multiple sources, identify gaps, reconcile conflicts, and translate high-level information into details to drive decision-making.</li>\n<li>Partner with internal teams to define and implement solutions that improve accounting and reporting processes.</li>\n</ul>",
    "title": "Revenue Accounting Systems Analyst"
}