{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Mountain View, CA, USA; Los Angeles, CA, USA; San Francisco, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckU6LsOmR2X9SC8ff1Q8g8hitbEZdGZrdTMs_lgtA_98SOgCPMA3T5HOsiO5SEtxqgcPC8E9kh-6rNX2958aOgi4JWpBdzRuOUkcfCPVA4KPXjAwFY4taQBp9opQ%3D_V2&jobTitle=Global+Program+Manager%2C+Global+Productivity+and+Sales+Tools&loc=US",
    "categories": [
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:52.341Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n<p>The Go-to-Market Operations (GtM) team enables the Global Business Organization to drive customer success by setting the path for the future. Experts in driving process improvements and consistency, team members are analytical and strategic with a pragmatic sense of getting things done. As part of GtM, the Global Productivity and Sales Tools (GPST) team is responsible for leading sales tools efforts to support GBO, partnering with Sales, Global Solutions, Go to Market, PM, Engineering etc.\n</p>\n\n<p>You&#39;ll be involved in high-impact projects and will provide GBO with a holistic, complementary set of automated assets (Slides, Spreadsheets, Data Studio dashboards), thoughtfully integrated into internal systems and recommendation engines.\n</p>\n\n<p>As a Global Program Manager, you’ll you’ll manage an impressive portfolio of content initiatives and continuously seek out promising material to automate. Acting as content producer, you’ll oversee the end-to-end ideation, design, development and distribution of new content. You’ll partner with business leads and designers to edit storylines and formatting for decks, dashboards and reports, sourcing feedback from sellers to help shape the final product. \n</p>\n\n<p>You’ll be responsible for prioritizing and crystallizing content/data requirements (in some cases designing the data model and negotiating access with owners). You’ll guide a team of scripters who implement the product, facilitate testing, make editing decisions and ultimately activate and distribute content to sellers across the organization. In addition, you’ll lead cross-cutting, strategic and operational initiatives to improve quality and accelerate content automation.</p><p>The Go-to-Market Operations (GtM) team ensures Google&#39;s complex and ever-evolving Ads business runs smoothly. We are instrumental in setting go-to-market strategy, and ensuring flawless execution and operations against the strategy. We have teams embedded in each of the major Ads business areas as well as global teams that work across the business areas. Team members are analytical and strategic, with a pragmatic sense of how to get things done.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT",
        "DOCTORAL_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5366769515692032",
    "location": {
        "address_lines": [
            "San Francisco, CA, USA"
        ],
        "city": "San Francisco",
        "country": "CA",
        "country_code": "US",
        "display": "San Francisco, CA, USA",
        "lat": 37.7749295,
        "lon": -122.4194155
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=1168x324&zoom=12&signature=7D_r7MDDAE3Q6outSM5SkiKVuZA=",
        "large_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=1024x324&zoom=12&signature=2Azp4lFFzXFWmJ0ynpFZBbYcURI=",
        "small_1x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&size=600x400&zoom=12&signature=v-7jznRAGYDMrKQFchYANnwRrbY=",
        "small_2x": "/maps/api/staticmap?center=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=345+Spear+Street%2C+San+Francisco%2C+CA+94105%2C+USA&scale=2&size=600x400&zoom=12&signature=pAHq6glNrErnZsweeP50SkCxkOQ="
    },
    "modified": "2019-03-18T21:16:24.983Z",
    "publish_date": "2019-02-27T19:44:55.492Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>Experience in Product Development, Solutions, and Execution.</li>\n<li>Experience in project management.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or graduate degree in a management, technical or engineering field</li>\n<li>Large-scale, high-profile program management experience</li>\n<li>Front-line sales experience with Google Ads and brand selling.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Partner with cross-functional stakeholders to identify and prioritize opportunities to automate content</li>\n<li>Crystalize and articulate the content and data requirements for project groups (PM/Engineering, scripters, designers, et al.)</li>\n<li>Manage and oversee the lifecycle for content automation including deployment and ongoing improvements</li>\n<li>Lead strategic and operational efficiency projects, communicating proposals and updates to senior leadership</li>\n<li>Advocate the values of the content and platform with end users and stakeholders</li>\n</ul>",
    "title": "Global Program Manager, Global Productivity and Sales Tools"
}