{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckYBUZeaYoKq5b_YyU6ctqmswFBQfmfLMe62T2Rl1NBUSOgCPMA3TwtUpxlb32uD3pij-xcu-GooG3UZ5O6mTOg_AbLU5XHbTRxvA20lHPqO_M567_QYy33I_0ZU%3D_V2&jobTitle=Strategy+and+Operations+Analyst%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "BUSINESS_STRATEGY"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-11-02T14:31:47.425Z",
    "description": "<p>The Business Strategy &amp; Operations organization provides business critical insights using analytics, ensures cross functional alignment of goals and execution, and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with strong day-to-day operations, and help evolve early stage ideas into future-growth initiatives.</p>\n\n\n<p>The Acquisitions Strategy and Operations team (ACA) is part of the the Revenue Strategy and Operations organization within Google Customer Solutions. The broader Revenue Strategy and Operations organization provides business critical insights using analytics, ensures cross-functional alignment of goals and execution and helps teams drive strategic partnerships and new initiatives forward. We stay focused on aligning the highest-level company priorities with effective day-to-day operations and help evolve early stage ideas into future-growth initiatives.\n</p>\n\n\n<p>As a Strategy and Operations Analyst, you will become an expert on the data behind the sales business and conduct deep dive analyses to identify and solve ambiguous and highly visible business challenges. You will work closely with outbound Program Managers to provide insights to optimize the business and assess the execution and impact of programs and initiatives. In addition, you will be responsible for surfacing key business insights in executive-level business reviews.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. Together, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5907603770900480",
    "location": {
        "address_lines": [
            "Redwood City, CA, USA"
        ],
        "city": "Redwood City",
        "country": "CA",
        "country_code": "US",
        "display": "Redwood City, CA, USA",
        "lat": 37.48521520000001,
        "lon": -122.2363548
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=1168x324&zoom=12&signature=qMd_c5mmqxWSefkzRvq5u3HXeX8=",
        "large_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=1024x324&zoom=12&signature=QI9LkVYQ-IlH0lZ6MENCZ2TRJPQ=",
        "small_1x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&size=600x400&zoom=12&signature=sGZIA9O0g6zpsi2BMerq7kWkMSo=",
        "small_2x": "/maps/api/staticmap?center=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Seaport+Boulevard%2C+Redwood+City%2C+CA+94063&scale=2&size=600x400&zoom=12&signature=ZaSXyTdqAKk9FmiP1ehW8vV8TuI="
    },
    "modified": "2019-02-27T19:44:45.089Z",
    "publish_date": "2019-02-27T19:44:45.089Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree with quantitative focus (Economics, Computer Science, Mathematics, Physics, Statistics or Accounting) or equivalent practical experience.</li>\n<li>4 years of analytical work experience in marketing and sales, management consulting, or in a business operations and analytics environment.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA, MS degree or other advanced degree.</li>\n<li>Experience presenting to executives and analyzing large quantities of data with strong spreadsheet and database query experience (e.g. SQL).</li>\n<li>Track record of thought leadership in applying data-driven models that have had a tangible impact on sales and marketing operations across international markets.</li>\n<li>Ability to strategically analyze and synthesize data in order to develop useful formats and actionable insights.</li>\n<li>Ability to consistently deliver quality outputs in a fast-paced environment, with an ability to work to tight deadlines. Extremely well-organized and capable of handling multiple projects and ad-hoc requests simultaneously.</li>\n<li>Ability to work in and contribute to a fun, fast-paced, high impact and dynamic environment.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify key growth and optimization opportunities.</li>\n<li>Provide insight on the strategy and operating performance of the acquisitions businesses for executive business reviews and strategy summits.</li>\n<li>Conduct sophisticated analysis and modeling that translates data into actionable insights and supports business development.</li>\n<li>Research and analyze key business drivers, trends and operating metrics.</li>\n<li>Collaborate cross-functionally with Program Managers and other analysts across business areas to drive strategic initiatives forward.</li>\n</ul>",
    "title": "Strategy and Operations Analyst, Google Customer Solutions"
}