{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Boulder, CO, USA; Austin, TX, USA; Sunnyvale, CA, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckXwph7zdMMOF5n2Q2JjmfX_uVRxHBvuP-HVlKJpuzJsSOgCPMA3T6GtzrH90PRSfottwoW-4idWllZeedp4y0yXb_-vk5ofkpjZtOB_XPA-1HI_qGb4iJHAe6Yw%3D_V2&jobTitle=Technical+Account+Manager%2C+Google+Cloud&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:32:06.368Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p>\n\n<p>As a Technical Account Manager (TAM), you will develop strong relationships, both internally and externally, and connect with senior customer, executives and IT stakeholders to develop a strong understanding of their business requirements and goals. Building on this knowledge, you will develop a strategic roadmap and facilitate customers’ digital transformation and migration to Google Cloud Platform and G Suite solutions. With your technical expertise, project management and leadership skills, you will establish deep and lasting customer relationships by staying aligned to customers’ larger mission objectives. As the primary contact, you will also manage ongoing transformation activities and ensure the long-term success of our customers.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6238906665336832",
    "location": {
        "address_lines": [
            "Austin, TX, USA"
        ],
        "city": "Austin",
        "country": "TX",
        "country_code": "US",
        "display": "Austin, TX, USA",
        "lat": 30.267153,
        "lon": -97.7430608
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=1168x324&zoom=12&signature=UTSmzhT1GwaqAFOlXiNqYeEp1js=",
        "large_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=1024x324&zoom=12&signature=ojF7AFQovSAd42Cxo1IUj70UZ4s=",
        "small_1x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&size=600x400&zoom=12&signature=y_wUhfimj7y5il9HxUh_cxg3Bwk=",
        "small_2x": "/maps/api/staticmap?center=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=500+West+2nd+Street+Austin%2C+TX+78701%2C+USA&scale=2&size=600x400&zoom=12&signature=SwUrs381CxcDbwPJMemUHah_AOk="
    },
    "modified": "2019-02-27T19:42:49.603Z",
    "publish_date": "2019-02-27T19:42:49.603Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelors Degree or equivalent practical experience.</li>\n<li>3 years of experience with creating and executing on physical-to-virtual (P2V) and vehicle-to-vehicle (V2V) solution architectures or enterprise infrastructure migration plans.</li>\n<li>Experience in working with a cross-functional team, delivering technical solutions to public sector customers.</li>\n<li>Ability to travel domestically and internationally up to 30% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA or a graduate degree in a management, technical or engineering field.</li>\n<li>Experience in account management, client service and/or management consulting.</li>\n<li>Experience in application and workload migration to Google Cloud Platform or other cloud technologies.</li>\n<li>Experience working with channel partners, systems integrators and third party developers to deliver successful solutions.</li>\n<li>Proven ability to present technical materials effectively to diverse stakeholder groups and to engage effectively with senior executives of large enterprises on both technical and non-technical matters.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Establish and maintain a position as key strategic advisor to customer executives and IT stakeholders for Google Cloud Platform and G Suite accounts, ensuring their mission priorities are met using Google Cloud Platform solutions.</li>\n<li>Work with customer technical leads, client executives and partners to manage and deliver successful migrations to Google Cloud Platform solutions.</li>\n<li>Become a trusted expert in Google Cloud Platform and G Suite solutions to provide effective operational and technical advice around these technologies.</li>\n<li>Channel customers’ feedback to Google Product Management and Engineering teams to ensure the best possible in-production experience, and assist in prioritizing product requirements by communicating customer needs and impact. Drive operational improvements at Google, based on customer insights.</li>\n<li>Develop best practice recommendations for Google Cloud Platform partners based on the experience gained during customer engagements.</li>\n</ul>",
    "title": "Technical Account Manager, Google Cloud"
}