{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSKoeR1xtt9rMpyez9-LsqnI-qR5iQ1kw3h87t27ljsSOgCPMA3TUSA-pTiAIUy_gNU-BYIM0oe8zeDD-OpDSeOjSrapp5AbDzOk3-KmLZvOvNkLHXwi4stKBSo%3D_V2&jobTitle=Researcher%2C+Leadership+Recruiting&loc=US",
    "categories": [
        "PEOPLEOPS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-21T23:33:30.276Z",
    "description": "<p>Being a Researcher at Google means finding people in hard-to-reach places. Like finding needles in a haystack, our team of sourcers are responsible for discovering the most talented people in the world. As a Researcher on one of our functional staffing teams, you play the role of detective -- tapping into all kinds of tools and resources to uncover the best untapped talent out there. Once spotted, you engage with these passive candidates, learn about their aspirations and interests and help them connect with roles, projects and opportunities at Google. You are both scrappy and resourceful, are able to listen to what candidates have to say and then and connect them with the Google magic.</p>\n\n<p>As a Researcher on our Leadership Recruiting team, you will be tasked with building robust research strategies to identify and engage candidates. You are an analytical and resourceful individual with a passion for research and developing relationships, and have the ability to listen and understand the goals of candidates and our hiring teams.</p><p>Great just isn&#39;t good enough for our People Operations team (you probably know us better as &quot;Human Resources&quot;). Made up of equal parts HR professionals, former consultants and analysts, we&#39;re the advocates of Google&#39;s colorful culture. In People Ops, we &quot;find them, grow them, and keep them&quot; - we bring the world&#39;s most innovative people to Google and provide the programs that help them thrive. Whether recruiting the next great Googler, refining our core programs, developing talent or simply looking for ways to inject some more fun into the lives of our Googlers, we bring a data-driven approach that is reinventing the human resources field.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5848657413996544",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-08T18:02:47.198Z",
    "publish_date": "2019-03-08T18:02:47.198Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>3 years of experience in an executive recruiting and/or sourcing role.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Recruiting experience in an executive search firm or corporate environment, executing a variety of searches with an emphasis on an individualized candidate experience.</li>\n<li>Expert at independently owning and driving the search strategy. Able to thoughtfully set out the target company universe and prioritize effectively based on key market insights.</li>\n<li>Executive presence and excellent consultative skills. Domain expertise to build productive partnerships with leaders and exceed their expectations.</li>\n<li>Ability to get up to speed quickly on new markets and to run a thorough search process, including leadership candidate research, outreach, engagement, evaluation and presentation.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Create and execute leadership search strategies across a variety of product areas and functions, either focused on Technology or Sales, General &amp; Administrative (SG&amp;A) leadership roles at Google.</li>\n<li>Identify, assess and present leadership talent to senior management across Google.</li>\n<li>Build relationships with leadership talent in the marketplace.</li>\n<li>Leverage strategic thinking, influencing and coaching skills in order to run a successful search process and help hire exceptional talent.</li>\n<li>Source passive candidates through research, internal and external networking and direct outreach.</li>\n</ul>",
    "title": "Researcher, Leadership Recruiting"
}