{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckSvYrAYHWdqedznFHXpcxUXxBPtlpmQblVxXCAyyjAQSOgCPMA3T3tgCQBVqr5cJTdWDaDBez2lXpe1Tcm_paX5HiyMvMxqnzpyPr3bn8vsbd5V0Tjlw1D137d4%3D_V2&jobTitle=Security+Operations+Analyst%2C+Finance+Systems+and+Integrations&loc=US",
    "categories": [
        "FINANCE"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-11T21:31:53.643Z",
    "description": "<p>Finance Project Managers drive critical priorities for Google by leading and assisting in projects of all sizes. Drawing from your strong financial background, you work with a diverse team to manage projects from concept to implementation and keep Google-wide stakeholders informed as you go. You get down into the details of complex analyses without losing sight of the overall objective. When working on multiple projects at once, you intuitively know which issues to highlight and can bring key decision makers together to come up with effective solutions. Once a project is completed, you&#39;re able to clearly communicate the results and draw the key learnings for senior management. You are efficient and organized, making the most of everyone&#39;s abilities and holding the team to a high standard.<br><br>As a Security Operations Analyst, you will work to define and launch strategic and operational initiatives to help the business scale globally, collaborate with Google teams, and embed an external market point-of view into the strategic direction of the group and company. You will own and manage projects or parts of larger initiatives, both on an on-going basis and on an ad-hoc basis, successfully supporting strategic decision-making through analysis and presentation of findings to senior management and the broader organization. You have mastered the cycle of project planning to delivery and associated techniques, and use this knowledge to develop team work plans and manage workloads and deadlines.</p>\n\n<p>In this role, you will contribute to the development and execution of a business systems roadmap for Finance that enables Finance to scale to support the company. You will help shape and execute on a multi-year transformation that has high impact on the business, contributing to Finance’s future system strategy and working closely with Finance leaders to transform Finance processes. Additionally, you will be responsible for developing and streamlining Finance data security processes, data governance, and policy development.\n</p>\n\n<p>You will play a critical role in developing and executing a plan for overall data security, data quality, and data governance. You are a highly quantitative, motivated, and creative person with a passion for operational excellence and introducing cutting-edge technology to enable seamless and robust processes. You continuously identifying opportunities to enhance operational performance, mitigate risks, and lead large-scale initiatives to ensure a highly-controlled financial data platform is delivered.</p><p>The name Google came from &quot;googol,&quot; a mathematical term for the number 1 followed by 100 zeros. And nobody at Google loves big numbers like the Finance team when providing in depth analysis on all manner of strategic decisions across Google products. From developing forward-thinking analysis to generating management reports to scaling our automated financial processes, the Finance organization is an important partner and advisor to the business.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6668183138402304",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:53:20.453Z",
    "publish_date": "2019-02-27T19:53:20.453Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Experience in Finance policies, procedures for data security, and data access control.</li>\n<li>Experience designing and developing scalable prototypes of data security processes.</li>\n<li>Experience establishing oversight protocols to ensure compliance with statutory regulations.</li>\n<li>Experience driving data quality analyses, reporting, and monitoring financial processes and data assets.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in SQL, spreadsheet software, Python, R, and/or an object oriented programming language.</li>\n<li>Experience in data security, auditing, data quality, GDPR compliance, risk management, and reporting and analytics.</li>\n<li>Ability to break down complex problems and projects into manageable goals and align data initiatives with Finance strategy.</li>\n<li>Ability to influence across all levels of the organization and to partner effectively with cross-functional teams.</li>\n<li>Ability to work as part of a team with excellent technical skills.</li>\n<li>Excellent written and verbal communication skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Work closely with Finance leads as well as Product and Corporate Engineering to execute on the data security strategy.</li>\n</ul>",
    "title": "Security Operations Analyst, Finance Systems and Integrations"
}