{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTiw4TdGY-gxTuN8jm72JTRfHzPqk9amn_8P2DW1SMsSOgCPMA3Tj2NNDcETt6AaYQGr63vigJdZgTdGj7WoySCNnf9-6NiZS3vwhzqGCFSD5y35_onsMJv1dFM%3D_V2&jobTitle=Incident+Manager%2C+Google+Play&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-18T17:01:36.886Z",
    "description": "<p>The Abuse Operations team protects the Google Play ecosystem by fighting spam, fraud and abuse and protecting user privacy in the Play store’s application vertical. We ensure policy compliance for Google’s expanding base of developers, advertisers, publishers and users.</p>\n\n<p>As an Incident Manager, you’ll work to ensure that sensitive incidents related to Play Apps abuse are managed effectively, with the least amount of impact on our business, users or brand. You’ll support various apps abuse fighting teams throughout the entire incident response process - from identification to escalation, through to communications, resolution and follow up. You’ll manage the response to incidents globally and use a variety of incident management tools, communications and facilitation methods to ensure issues are identified and the right stakeholders are involved in resolution. You’ll ensure learnings are gathered and mitigations put in place. In addition, you’ll also be looking into the data around incidents and searching for trends, impact and possible improvements. \n</p>\n\n<p>You are comfortable analyzing and understanding complex, non-standard situations and providing solutions and recommendations. As part of this role you’ll help test new processes, systems and infrastructure to manage incidents and have input into where we put our efforts next.</p><p>Google Play offers music, movies, books, apps and games for your devices, powered by the cloud. It’s a Google approach to entertainment, syncing magically across your devices and on the web. As part of the Android and Mobile team, Googlers working on Google Play do everything from engineering our backend systems, to shaping the product strategy, to forming great content partnerships. They make it possible for people to do things like buy an ebook or song on their Android phone, then have it instantly available on their laptop. The Google Play team helps strengthen the overall Android ecosystem by giving developers and partners a premium store where they can reach millions of users.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6175381210202112",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-02-27T19:53:26.522Z",
    "publish_date": "2019-02-27T19:53:26.522Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business, Operations, related field or equivalent practical experience.</li>\n<li>3 years of experience in operations management, policy enforcement and project management.</li>\n<li>Experience in working cross-functionally with technical and non-technical groups across all organizational levels.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with Google’s developer platforms (Google Play, Cloud Platform, Chrome Web Store, etc.).</li>\n<li>Ability to manage multiple competing priorities in a fast-paced, constantly changing environment.</li>\n<li>Ability to function well in high-pressure situations and take the lead if necessary.</li>\n<li>Ability to work successfully in cross-functional teams, including with senior stakeholders and executives.</li>\n<li>Excellent communication, interpersonal and documentation skills.</li>\n<li>Ability to work nonstandard work hours as needed.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify opportunities to improve incident management and drive these improvements forward.</li>\n<li>Ensure that all incidents are triaged, tracked, investigated, resolved and communicated accurately using internal incident management tools and systems.</li>\n<li>Conduct trend analysis on past incidents to understand any gaps in coverage and help identify possible incidents before they occur.</li>\n<li>Share insights and analysis by creating and delivering effective presentations and documentation for broad range of stakeholders.</li>\n<li>Communicate effectively at all levels, tailoring materials to the audience.</li>\n</ul>",
    "title": "Incident Manager, Google Play"
}