{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckUj-zv8qPVOIPhvCjjRQYPID5riGDyzNbWCO5CaR3ZwSOgCPMA3T6g_la0_9C5SgMcf2HjpuoKWaRLfsxBNHmCdT-B88tnrWTYaTUqxiYEMvu0kakoneRc-Y_Us%3D_V2&jobTitle=Policy+Enforcement+Manager%2C+YouTube+Trust+and+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ad872500-709d-4a93-97e3-76be227f77a1",
    "company_name": "YouTube",
    "created": "2018-12-16T22:05:45.895Z",
    "description": "<p>Fast-paced, dynamic, and proactive, YouTube’s Trust &amp; Safety team is dedicated to making YouTube a safe place for users, viewers, and content creators around the world to belong, create, and express themselves. Whether understanding and solving their online content concerns, navigating within global legal frameworks, or writing and enforcing worldwide policy, the Trust &amp; Safety team is on the frontlines of enhancing the YouTube experience, building internet safety, and protecting free speech in our ever-evolving digital world.</p>\n\n<p>As part of YouTube Trust and Safety, you will be directly responsible for making the internet safer, protecting free speech and defending our brand. You are passionate about cutting-edge policy developments and applications in a digital age, and you want to help define how people around the world communicate with one another and express their points of view through YouTube. You thrive in a fast-paced, dynamic, demanding environment where no two days are ever the same. YouTube Trust and Safety is dedicated to ensuring that YouTube is a place for users, viewers and creators around the world to belong, create and express themselves.\n</p>\n\n<p>As a Policy Enforcement Manager, you will be responsible for working with a global team from Policy, Enforcement, Product, Engineering, Tools, Legal and others to prevent violative content from appearing on the site. You will work with tools and technology to detect and action violative content, and you research the latest trends and suspicious activities on the site and develop creative solutions to address these issues. You&#39;ll evaluate potential abuse and complex signals on the platform and make decisions about the appropriateness of different content including considerations of cultural and political sensitivities.</p><p>At YouTube, we believe that everyone deserves to have a voice, and that the world is a better place when we listen, share, and build community through our stories. We work together to give everyone the power to share their story, explore what they love, and connect with one another in the process. Working at the intersection of cutting-edge technology and boundless creativity, we move at the speed of culture with a shared goal to show people the world. We explore new ideas, solve real problems, and have fun — and we do it all together.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5113678716403712",
    "location": {
        "address_lines": [
            "San Bruno, CA, USA"
        ],
        "city": "San Bruno",
        "country": "CA",
        "country_code": "US",
        "display": "San Bruno, CA, USA",
        "lat": 37.6304904,
        "lon": -122.4110835
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=1168x324&zoom=12&signature=8kTssaOIezLC995xz1jzX_ZsmEY=",
        "large_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=1024x324&zoom=12&signature=qd1d-lHbtksAR7tvbMxtF6isGS4=",
        "small_1x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&size=600x400&zoom=12&signature=muZNYVJol8PMclT8mtEQc7rdogE=",
        "small_2x": "/maps/api/staticmap?center=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=901+Cherry+Ave%2C+San+Bruno%2C+CA+94066%2C+USA&scale=2&size=600x400&zoom=12&signature=CPaUJbMpoSOqDb7VXdK1SJbE0EI="
    },
    "modified": "2019-03-07T01:32:00.144Z",
    "publish_date": "2019-03-07T01:32:00.144Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience identifying abuse trends or working in news or policy.</li>\n<li>Ability to work non-standard hours including weekends on a rotational basis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience in content policy, anti-abuse and reviewing online content.</li>\n<li>Experience with SQL and programming. Comfortable working with different tools and software.</li>\n<li>Passion for international issues including freedom of expression, online controversial content, misinformation, cyber crime, etc.</li>\n<li>Excellent business judgment and outstanding influencing and communication skills with an ability to build relationships with cross-functional partners.</li>\n<li>Excellent analytical skills including using data to drive strategy and business action.</li>\n<li>Fluency in English and an additional language.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Research and stay up-to-date on key trends and suspicious patterns in your policy area.</li>\n<li>Review controversial and sometimes offensive video content in line with YouTube’s Community Guidelines.</li>\n<li>Handle escalations with a fast turn-around time to define and deliver the best action plan.</li>\n<li>Work cross-functionally, think strategically and keep our users safe while protecting free speech.</li>\n<li>Work on-call on weekends on a rotational basis as required to handle policy escalations, which require immediate resolution, from both internal and external stakeholders.</li>\n</ul>",
    "title": "Policy Enforcement Manager, YouTube Trust and Safety"
}