{
    "application_instruction": "<b>Note: By applying to this position your application is automatically submitted to the following locations: Detroit, MI, USA; Chicago, IL, USA; New York, NY, USA; San Francisco, CA, USA; Mountain View, CA, USA; Washington, DC, USA</b>",
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckTDsZnVOLgJ1owKfXYfM_62Nkqnfkjv3rNiXCVVmPv8SOgASYQ8wlzRoVxkibWxCEEfej3-ibc-bZutTm3mSMBRqRpnYMS8ho8m9qXX0--qfSlmiU1j0jEvW6-E%3D_V2&jobTitle=Measurement+Lead%2C+Consumer+Goods+and+Entertainment&loc=US",
    "categories": [
        "PRODUCT_SUPPORT",
        "SALES_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-01T19:31:57.312Z",
    "description": "<p>Businesses that partner with Google come in all shapes, sizes and market caps, and no one Google advertising solution works for all. Your knowledge of online media combined with your communication skills and analytical abilities shapes how new and existing business grow. Using your influencing and relationship-building skills, you provide Google-caliber client service, research and market analysis. You anticipate how decisions are made, persistently explore and uncover the business needs of Google&#39;s key clients and understand how our range of product offerings can grow their business. Working with them, you set the vision and the strategy for how their advertising can reach thousands of users.</p>\n\n<p>As a Measurement Lead, you&#39;ll lead the Services and Distributions Solutions Sector and verticals efforts in order to drive business growth and client business outcomes by improving clients’ measurement maturity models. You will build and execute go-to-market plans and partner with analytical leads to accelerate adoption of measurement priorities.</p><p>Our Large Customer Sales teams partner closely with many of the world’s biggest advertisers and agencies to develop digital solutions that build businesses and brands. We enjoy a bird’s eye view on the massive transformation occurring as advertising shifts to mobile and online platforms. We&#39;re uniquely situated to help shape how companies grow their businesses in the digital age. We advise clients on Google&#39;s broad range of products across search, video and mobile to help them connect instantly and seamlessly with their audiences.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/90989972653253318",
    "location": {
        "address_lines": [
            "Washington, DC, USA"
        ],
        "city": "Washington",
        "country": "DC",
        "country_code": "US",
        "display": "Washington, DC, USA",
        "lat": 38.9071923,
        "lon": -77.0368707
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&size=1168x324&zoom=12&signature=INQ2tYfa33uh4YB3KdYOzWGIRgE=",
        "large_2x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&scale=2&size=1024x324&zoom=12&signature=F02zb3nllEVVQPDVulGaHeF2OnY=",
        "small_1x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&size=600x400&zoom=12&signature=Leq_NLtAoHWBM4BdqTNjtYrRsFQ=",
        "small_2x": "/maps/api/staticmap?center=Washington%2C+DC%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Washington%2C+DC%2C+USA&scale=2&size=600x400&zoom=12&signature=KeifREUolWXC01FFllmzO3_ZwWo="
    },
    "modified": "2019-02-27T19:49:08.443Z",
    "publish_date": "2019-02-27T19:49:08.443Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>4 years of experience with analytics, marketing technology, advertising sales, digital media and marketing, consulting, or financial analysis.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with third-party measurement and attribution solutions.</li>\n<li>Experience with data integration.</li>\n<li>Experience in consulting, including configuration and design of attribution solutions.</li>\n<li>Experience in pitching data-driven attribution/non-last click attribution, Google Analytics, Google Ads conversion tracking, and data integrations.</li>\n<li>Ability to gather and share market and customer feedback.</li>\n<li>Excellent presentation, written and verbal communication, and interpersonal skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Consult with advertisers and agency partners to understand their measurement goals and assess how Google measurement products can effectively address their needs.</li>\n<li>Collaborate with internal teams, including Sales, Display, YouTube, Google Ad Manager, and 360 teams to analyze and develop cross-channel insights to present to advertisers.</li>\n<li>Lead the incremental testing framework by using Geo experiments and Google’s conversion lift products.</li>\n<li>Lead in-app events to align media activation to business customer outcomes. Be the subject matter expert on Google’s App measurement tool (i.e., Firebase) and other App measurement solutions.</li>\n<li>Help clients onboard and make decisions based on offline conversion data (e.g., Store Sales Direct, Ad Manager Offline Conversion API, etc.). Manage the feedback loop for App client feedback and product requests to Global Trade Management and Global Product Lead teams.</li>\n</ul>",
    "title": "Measurement Lead, Consumer Goods and Entertainment"
}