{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeXwjjdQVLFflLAWze7Oyv2IduInPR2rv7EF3IUtjuISOACPMA3T5ar9AbqvR-V0MEWBnwlvxVS8V6vJgW93TOA-FZR1V38KHVgxmCnD6_Ifd_xUM2LRllV-_V2&jobTitle=Risk+and+Abuse+Analyst%2C+Trust+%26+Safety&loc=US",
    "categories": [
        "PRODUCT_SUPPORT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-01-07T17:01:47.032Z",
    "description": "<p>Trust &amp; Safety team members are tasked with identifying and taking on the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, user insights, and proactive communication to protect users and our partners from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You work globally and cross-functionally with Google engineers and product managers to identify and fight abuse and fraud cases at Google speed - with urgency. And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p><p>Trust and Safety Analysts are tasked with identifying and addressing the biggest problems that challenge the safety and integrity of our products. They use technical know-how, excellent problem-solving skills, and a deep empathy for our users to protect them from abuse across Google products like Search, Maps, Gmail, and Google Ads. On this team, you&#39;re a big-picture thinker and strategic team-player with a passion for doing what’s right. You&#39;ll work globally and cross-functionally with Google developers and product managers to identify and fight abuse and fraud cases at Google speed (read: fast!). And you take pride in knowing that every day you are working hard to promote trust in Google and ensuring the highest levels of user safety.</p><p>At Google we work hard to earn our users’ trust every day. Gaining and retaining this trust is critically important to Google’s success. We defend Google&#39;s integrity by fighting spam, fraud and abuse, and develop and communicate state-of-the-art product policies. The Trust and Safety team reduces risk and protects the experience of our users and business partners in more than 40 languages and across Google&#39;s expanding base of products. We work with a variety of teams from Engineering to Legal, Public Policy and Sales Engineering to set policies and combat fraud and abuse in a scalable way, often with an eye to finding industry-wide solutions. Trust and Safety team members are motivated to find innovative solutions, and use technical know-how, user insights and proactive communication to pursue the highest possible quality and safety standards for users across Google products.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5987406648377344",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-03-16T05:01:46.068Z",
    "publish_date": "2019-03-16T05:01:46.068Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>2 years of experience in data analysis, working with databases and querying (e.g., SQL, MySQL, MapReduce).</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Engineering, Mathematics, Statistics, Economics or equivalent practical experience.</li>\n<li>Experience in one or more of the following areas: Coding (e.g., C/C++, Python, Java), Databases and querying (e.g., SQL, MySQL, MapReduce, Hadoop), Front end development (e.g., HTML, JavaScript, CSS) or Statistical analysis (e.g., R, Stata, SPSS, SAS).</li>\n<li>Experience with digital abuse fighting, working in a security and/or privacy team on data protection and user trust.</li>\n<li>Understanding of how the internet works at a technical level.</li>\n<li>Demonstrated problem-solving, critical thinking, and analytical skills, and effective communication skills with a track record of working successfully in teams.</li></ul>",
    "responsibilities": "<ul>\n<li>Perform complex data analyses to derive insights that help to identify and fight abuse across our products.</li>\n<li>Collaborate with cross-functional groups such as Engineering, Sales and Legal to update product policies, and provide a better digital experience for our users.</li>\n<li>Enhance our operational workflows via process improvements and identification of automation opportunities.</li>\n<li>Improve tools through data analysis, technical expertise, and presentations to key stakeholders.</li>\n<li>Conduct investigations, enforce our product policies, and identify product vulnerabilities (may occasionally be exposed to disturbing or offensive content during the process).</li>\n</ul>",
    "title": "Risk and Abuse Analyst, Trust & Safety"
}