{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckZ4b3nRw5biH86ufnubR9Q3KLts9SmxgO0_e9zyYUJgSOgASYQ8w5CJvBhX9WNA3BDQs5A9cllMn1E4kuwIoWaED0InGd41rDP6b7CvoApU32MhQwxj-tU9CiZs%3D_V2&jobTitle=Program+Manager%2C+Community+Support%2C+G+Suite&loc=US",
    "categories": [
        "PROGRAM_MANAGEMENT"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-01T15:31:34.408Z",
    "description": "<p>Google Cloud teams work with schools, companies, and government agencies to make them more productive, mobile and collaborative. You will oversee all aspects of the Google Cloud sales process, improving it with your insightful data analysis, troubleshooting, and seamless cross-functional teamwork. Your strategies ensure that companies new to Google products get the highest quality customer support and that the Google Cloud program overall is kept on the cutting edge.</p><p>The G Suite Support team is devoted to continuously finding relevant support service solutions that meet our customers’ needs. In order to serve the continuously changing support service needs of our customers, G Suite works closely to enable vendors to deliver customer support services to our customer base.</p><p>As a Program Manager, you&#39;ll work on the Cloud Support team. You&#39;ll develop relationships with internal stakeholders and drive operational performance by a high-performing vendor operations team to allow for Google to get the most value and continue to invest in its new products. </p><p>You&#39;ll have experience in analytics, quantitative metric analysis, people/performance management and call center management. You&#39;re an excellent performer who will quickly adapt and respond to changes and internal initiatives, and you thrive in an ever-changing, fast-growing operational environment. You&#39;re operationally savvy, have a &#39;get it done&#39; personality, have the ability to make smart, independent decisions, and have the willingness to manage deliverables across teams/priorities.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/125168125843776198",
    "location": {
        "address_lines": [
            "New York, NY, USA"
        ],
        "city": "New York",
        "country": "NY",
        "country_code": "US",
        "display": "New York, NY, USA",
        "lat": 40.7127753,
        "lon": -74.0059728
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=1168x324&zoom=12&signature=uaqHzwtJYAD-aWuE4O2qk33R6WM=",
        "large_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=1024x324&zoom=12&signature=RVjtjtGYTtuDsOJbAwq12PaHrko=",
        "small_1x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&size=600x400&zoom=12&signature=_ZffjzQ_CtP8s70XmEwyG7drd2U=",
        "small_2x": "/maps/api/staticmap?center=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=111+8th+Avenue%2C+New+York%2C+NY+10011%2C+USA&scale=2&size=600x400&zoom=12&signature=JfaTV6vL_8FgGoy_2fZPlFDUy6g="
    },
    "modified": "2019-03-01T15:31:34.408Z",
    "publish_date": "2019-03-01T15:31:34.408Z",
    "qualifications": "<p>Minimum qualifications:</p><ul><li>Bachelor&#39;s degree in a technical or quantitative/business-oriented field or equivalent practical experience.</li><li>5 years of relevant work experience.</li><li>Experience in business or service operations, customer support operations, internet/online media.</li></ul><br><p>Preferred qualifications:</p><ul><li>Experience executing strategic and operational initiatives. Excellent problem-solving and project management skills.</li><li>Experience in management consulting, investment banking, organizational design, corporate strategy, or project management experience in a technology/media company.</li><li>Experience in strategy and change management in a demanding, fast-paced environment requiring deadline-driven focus and productivity.</li><li>Knowledge of SQL and experience building complex dashboards.</li><li>Proficient with structuring analysis and storylines using spreadsheet and presentation software to facilitate communication with senior stakeholders.</li><li>Ability to work with team members to design processes and implement projects to solve problems.</li></ul>",
    "responsibilities": "<ul><li>Define, launch and drive strategic and analytical initiatives to improve internal and external facing processes and operations, working closely with cross-functional teams and senior leadership.</li><li>Lead cross-functional projects and teams by working with business stakeholders across the organization to develop and manage project trackers, project communication to stakeholders, timelines, and lead cross-functional groups to synthesize feedback and deliver on project objectives.</li><li>Identify gaps and propose changes to existing policy, systems and process frameworks. Develop scalable solutions, work to manage risks across the organization, and develop best practices to benefit the organization.</li><li>Create presentations with compelling messages effectively tailored to different audience levels, including executives.</li><li>Drive recommendations through to implementation and results.</li></ul>",
    "title": "Program Manager, Community Support, G Suite"
}