{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckX4N1efUBQSh-2ibrqureFxVd15OnEB3iaaOZBCZtSQSOgCPMA3T6BsAJ4sRauXInrEdBVOaiL3ddlZgDpZ78loz_0Rei-rmmIEVmpt59nKEaV8QZRB7l00ZnR4%3D_V2&jobTitle=Data+Center+Facilities+Technician&loc=US",
    "categories": [
        "DATA_CENTER_OPERATIONS"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:31:59.570Z",
    "description": "<p>The Data Center team designs and operates some of the most sophisticated electrical engineering, mechanical engineering and HVAC systems in the world. Facilities Technicians at Google data centers operate, monitor and support physical facilities conditions. Some of these duties will include heating and cooling of air and water, power supply, generators, UPS systems, electrical distribution and control and monitoring systems. You regularly help inspect, maintain and repair various data center systems such as piping and non-critical electrical or mechanical system components). You provide daily assistance to senior technicians as you read blueprints/schematics, conduct tours of systems and assess their working order.<br><br>As a master of best-in-class practices, you develop creative approaches to reducing operational costs while improving overall data center efficiency. You ensure that environmental and safety standards are consistently met, identifying problems and making repairs quickly In emergency situations or abnormal conditions, you manage data center performance issues and outages to minimize the recovery time from failures.</p><p>Behind everything our users see online is the architecture built by the Technical Infrastructure team to keep it running. From developing and maintaining our data centers to building the next generation of Google platforms, we make Google&#39;s product portfolio possible. We&#39;re proud to be our engineers&#39; engineers and love voiding warranties by taking things apart so we can rebuild them. We&#39;re always on call to keep our networks up and running, ensuring our users have the best and fastest experience possible.</p>",
    "education_levels": [
        "ASSOCIATES_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/6072421717311488",
    "location": {
        "address_lines": [
            "Moncks Corner, SC 29461, USA"
        ],
        "city": "Moncks Corner",
        "country": "SC",
        "country_code": "US",
        "display": "Moncks Corner, SC 29461, USA",
        "lat": 33.1960027,
        "lon": -80.01313739999999,
        "post_code": "29461"
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=Moncks+Corner%2C+SC+29461%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Moncks+Corner%2C+SC+29461%2C+USA&size=1168x324&zoom=12&signature=9UHQFYdAGKxZFRkqg6qibQ1I6ic=",
        "large_2x": "/maps/api/staticmap?center=Moncks+Corner%2C+SC+29461%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Moncks+Corner%2C+SC+29461%2C+USA&scale=2&size=1024x324&zoom=12&signature=TwuhUK7gVczspQ6QKP_qVTfrBsw=",
        "small_1x": "/maps/api/staticmap?center=Moncks+Corner%2C+SC+29461%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Moncks+Corner%2C+SC+29461%2C+USA&size=600x400&zoom=12&signature=Gx4zhGXlAxifyETdVr2-IP4WXd4=",
        "small_2x": "/maps/api/staticmap?center=Moncks+Corner%2C+SC+29461%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=Moncks+Corner%2C+SC+29461%2C+USA&scale=2&size=600x400&zoom=12&signature=k2724QdjeGC8hkCLD7Fsscmk0Vs="
    },
    "modified": "2019-02-27T19:42:31.255Z",
    "publish_date": "2019-02-27T19:42:31.255Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>2 years experience at journeyman or technician level in a critical environment, or 2 years in mechanical/HVAC, electrical, or a combination of both.</li>\n<li>Ability to lift and move 50 lbs of equipment and work on platforms, ladders and under raised floors.</li>\n<li>Ability to work on weekends and holidays.</li>\n</ul><br><p>Preferred qualifications:</p><ul><li>Experience with data center, hospital or power plant.</li><li>Knowledge of the electrical and mechanical systems used in a data center environment, including Feeders, Transformers, Generators, Switchgear, UPS systems, ATS/STS units, PDU/PMM units, Chillers, Air handling units and CRAC units.</li><li>Ability to communicate effectively with contractors who perform maintenance or upgrade work on the systems.</li><li>Ability to learn quickly and address issues as they arise during normal working hours or when on-call.</li></ul>",
    "responsibilities": "<ul><li>Operate, monitor, maintain, and respond to abnormal conditions in facilities systems. Areas include Electrical, Mechanical, Building Monitoring and Control.</li><li>Track and trend operational characteristics.</li></ul>",
    "title": "Data Center Facilities Technician"
}