{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckeG2hrTESB-oAcEfkKIfzGJ2kLRu6c74kCiQfIs_CV8SOgCPMA3T9zhdZ0sBNqYjYA91IucM1G9m6G5qSUa_x2hki1caUCqlzv115ohDXx0E6l8bz9iyK3tOJnA%3D_V2&jobTitle=Software+Engineer%2C+Firmware%2C+Consumer+Hardware&loc=US",
    "categories": [
        "SOFTWARE_ENGINEERING"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2018-12-16T22:02:59.722Z",
    "description": "<p>Google&#39;s software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We&#39;re looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br><br>With your technical expertise you manage individual projects priorities, deadlines and deliverables. You design, develop, test, deploy, maintain, and enhance software solutions.</p>\n\n<p>You will be a member of the silicon team for a microcontroller project critical to Google products and infrastructure. You will participate in writing code for features within the microcontroller, full circle (embedded OS APIs, embedded OS applications, Android kernel drivers, and Android applications). You will work with the silicon and product teams to help define the embedded operating system requirements necessary to expose product features. You will work with manufacturing and product teams to help implement manufacturing and product test features, and you will work with silicon validation engineers to help develop functional silicon prior to manufacturing.</p><p>Google&#39;s mission is to organize the world&#39;s information and make it universally accessible and useful. Only one thing consistently stands in the way between our users and the world&#39;s information - hardware. Our Hardware team researches, designs, and develops new technologies and hardware to make our user&#39;s interaction with computing faster, more powerful, and seamless. Whether finding new ways to capture and sense the world around us, advancing form factors, or improving interaction methods, our Hardware team is making people&#39;s lives better through technology.</p>",
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/5629355663491072",
    "location": {
        "address_lines": [
            "Mountain View, CA, USA"
        ],
        "city": "Mountain View",
        "country": "CA",
        "country_code": "US",
        "display": "Mountain View, CA, USA",
        "lat": 37.3860517,
        "lon": -122.0838511
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=1168x324&zoom=12&signature=nOjBoEKy2iXaSdgxvJJiRrXaHIg=",
        "large_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=1024x324&zoom=12&signature=04Z2rGp1pz3gtMv10lrp8FEbaBk=",
        "small_1x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&size=600x400&zoom=12&signature=dJ4DN-yGe_9huoJ7hno5vmimJbY=",
        "small_2x": "/maps/api/staticmap?center=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=1600+Amphitheatre+Parkway%2C+Mountain+View%2C+CA+94043%2C+USA&scale=2&size=600x400&zoom=12&signature=IC_lxzGA7kxhJAbGXiu2coRRmKM="
    },
    "modified": "2019-03-18T21:29:23.785Z",
    "publish_date": "2019-02-27T19:40:59.333Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>4 years of embedded system programming experience, and experience with C programming language.</li>\n<li>2 years of experience with open source tooling (i.e., GCC, GDB, Binutils)</li>\n<li>2 years of experience with Python, Perl or other scripting languages.</li>\n<li>Experience with peripherals such as USB, UART, I2C, SPI, etc.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Experience with silicon design and verification languages: SystemVerilog and UVM.</li>\n<li>Experience with Linux/Android kernel development.</li>\n<li>Experience with the silicon flow, design verification, design emulation/validation, silicon bringup.</li><li>Experience with Consumer Electronics or Software Development related to Consumer Hardware. </li>\n<li>Familiarity with hardware issues such as processor boot, real-time operating systems, manufacturing, provisioning, etc.\n</li>\n<li>Familiarity with secure hardware issues such as secure boot, secure manufacturing, cryptography, key storage, and physical silicon defense.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Participate in owning the embedded operating system of the microcontroller, working on areas such as boot, offload compute engines and more.</li>\n<li>Consolidate requests from design, validation, manufacturing and product teams.</li>\n<li>Work with validation environment and product teams to assist in pre-silicon testing.</li>\n<li>Complete all firmware elements in timely manner, with an eye toward reusability in emulation, bringup and product environments.</li>\n</ul>",
    "title": "Software Engineer, Firmware, Consumer Hardware"
}