{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckdSduez76BxR_B7SX3DyCZVpFnjfcwt1sWN8golO6GYSOgASYQ8wWIJIIvJWL_U7Rhgz_R3ZbYYThB6m86JFWUyVCMRCiR27t6uCn3oa3f845576h5Dykejg4UE%3D_V2&jobTitle=Sales+Agency+Lead%2C+Google+Customer+Solutions&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-03-05T19:01:31.304Z",
    "description": "<p>With a rapidly growing array of sales teams, it&#39;s important to have knowledgeable, charismatic leaders to guide our client sales teams. As an Agency Lead, you&#39;ll lead and coach high-performing account teams that use consultative sales skills to understand our advertisers&#39; needs and deliver measurable solutions that grow their businesses. You will also work with the sales leadership team to set strategic objectives and run the day-to-day operations for the business. Agency Leads willingly help their teams and roll up their sleeves to partner directly with clients to provide comprehensive service. You are an excellent communicator with a proven ability to train and motivate a large team, and you take an analytical approach to sales management.</p>\n\n<p>Google Customer Solutions (GCS) sales teams are trusted advisors and competitive sellers who maintain a relentless focus on customer success by bringing the best Google has to offer. As a GCS Sales Agency Lead, you&#39;ll manage client relationships and lead the business engagement with agencies in the market. You will enable your team to always reach for ambitious performance goals. You and your team will also work with a wide variety of top GCS agencies to deliver the optimal advertising solution for every partner and their clients.</p><p>When our millions of advertisers and publishers are happy, so are we! Our Google Customer Solutions (GCS) team of entrepreneurial, enthusiastic and client-focused members are the &quot;human face&quot; of Google, helping entrepreneurs both individually and broadly build their online presence and grow their businesses. We are dedicated to growing the unique needs of advertising companies. Our teams of strategists, analysts, advisers and support specialists collaborate closely to spot and analyze customer needs and trends. In collaboration, we create and implement business plans broadly for all types of businesses.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/135444841732416198",
    "location": {
        "address_lines": [
            "Ann Arbor, MI, USA"
        ],
        "city": "Ann Arbor",
        "country": "MI",
        "country_code": "US",
        "display": "Ann Arbor, MI, USA",
        "lat": 42.2808256,
        "lon": -83.7430378
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=1168x324&zoom=12&signature=8LnraDVYxGhIHyKG7b7PRQ5sHnc=",
        "large_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=1024x324&zoom=12&signature=v7eA4ssEZFb7guDMZdU5UX8H-cM=",
        "small_1x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&size=600x400&zoom=12&signature=oFhX4JnYJqwRVThGPXhNJsUnacM=",
        "small_2x": "/maps/api/staticmap?center=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=2300+Traverwood+Dr%2C+Ann+Arbor%2C+MI+48105%2C+USA&scale=2&size=600x400&zoom=12&signature=VKXQIvW8QoK0VuXz2iHxr-9Alno="
    },
    "modified": "2019-03-05T19:01:31.304Z",
    "publish_date": "2019-03-05T19:01:31.304Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree or equivalent practical experience.</li>\n<li>10 years of sales experience in technology, advertising and/or internet, experience growing a market </li>\n<li>4 years of experience leading a sales team, including coaching, mentoring and team development. Experience developing client relationships and accounts.</li>\n<li>Ability to travel up to 20% of the time.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>MBA degree.</li>\n<li>Sales leadership experience. Experience successfully owning sales team operations: portfolio management, team building, KPI measurement, execution.</li>\n<li>Ability to model and coach sales behaviors including, C-level engagement, effective questioning, objection handling, competitive selling, building pipeline.</li>\n<li>Thought leadership, as demonstrated by industry experience, ability to influence, high executive functioning.</li>\n<li>Proven ability to develop and deliver business strategies and relationships sustainable in the short- and long-term.</li>\n<li>Strong analytical skills to assess performance. Ability to develop actionable insights to capture opportunities.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Deliver business growth, engagement and client satisfaction for a portfolio of GCS-managed agencies in an assigned market. Manage and strengthen executive-level agency relations through key meetings, business reviews and speaking engagements.</li>\n<li>Recruit, retain, and lead the team of GCS Sales Development Managers and Account Strategists to ensure improved Same-store growth, high agency satisfaction, and enhanced portfolio health.</li>\n<li>Lead and coach a sales team and help them engage with stakeholders in GCS agencies and customers. Build and actively manage an effective long-term agency planning process.</li>\n<li>Define the future of agency management and help to develop the necessary infrastructure and processes. Initiate and run strategic initiatives to further develop new and existing GCS agency businesses.</li>\n</ul>",
    "title": "Sales Agency Lead, Google Customer Solutions"
}