{
    "apply_url": "https://www.google.com/about/careers/applications/signin?jobId=CiQAL2FckVDDUVX6QwNaR4Nz7dqbi2LLCpNOi0jgj5oV0PI6JWQSOgASYQ8wCtBWk2gg7IJkyBbJGAVUO7fKnhRDJTRHRnII4PWP-opHvX-GSN_oEupYEYbkrUN_DY7-NxM%3D_V2&jobTitle=Ecosystem+Business+Development+Manager%2C+Global+Alliances%2C+Google+Cloud&loc=US",
    "categories": [
        "SALES"
    ],
    "company_id": "companies/ebbbf0d1-8121-483c-8f99-ee92597591fc",
    "company_name": "Google",
    "created": "2019-02-22T01:01:51.126Z",
    "description": "<p>The Google Cloud Platform team helps customers transform and evolve their business through the use of Google’s global network, web-scale data centers and software infrastructure. As part of an entrepreneurial team in this rapidly growing business, you will help shape the future of businesses of all sizes use technology to connect with customers, employees and partners.</p>\n\n<p>As an Ecosystems Business Development Manager, you will identify new market opportunities and design programs or initiatives to grow the Google Cloud business in a global capacity. You will develop and manage a portfolio of Partners with a partner coverage model and best practices tools to drive go-to-market strategies. Through engaging with partners, you will bring awareness of Google Cloud’s applications into future partners’ products, while driving joint innovation and business opportunities. To enhance Google Cloud’s presence with strategic emerging partners and large global technology players, such as social, supply chain, blockchain, conversational bots, next generation UI, drones and machine learning, you will advise and provide recommendations to the leadership team.\n</p>\n\n<p>You will collaborate with key stakeholders to bring insights from direct engagement in the partner, industry, market and competitive landscape to generate compelling business strategies for new investment decisions. You will organize complex project work streams and implement status-tracking methods to ensure complete transparency to all stakeholders. You will work with partners and internal stakeholders to lead negotiations for partner agreements and drive Google Cloud executive approval process.</p><p>Google Cloud helps millions of employees and organizations empower their employees, serve their customers, and build what’s next for their business — all with technology built in the cloud. Our products are engineered for security, reliability and scalability, running the full stack from infrastructure to applications to devices and hardware. And our teams are dedicated to helping our customers — developers, small and large businesses, educational institutions and government agencies — see the benefits of our technology come to life.</p>",
    "education_levels": [
        "BACHELORS_OR_EQUIVALENT",
        "MASTERS_OR_EQUIVALENT"
    ],
    "eeo": "At Google, we don’t just accept difference—we celebrate it, we support it, and we thrive on it for the benefit of our employees, our products and our community. Google is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also <a href=\"https://support.google.com/mygoogle/answer/3246856?hl=en&amp;ref_topic=3285868\">Google's EEO Policy</a> and <a href=\"/jobs/dist/legal/OFCCP_EEO_Post.pdf\">EEO is the Law.</a>  If you have a disability or special need that requires accommodation, please let us know by completing <a href=\"https://goo.gl/forms/aBt6Pu71i1kzpLHe2\">this form</a>.",
    "id": "jobs/107671600129548998",
    "location": {
        "address_lines": [
            "Sunnyvale, CA, USA"
        ],
        "city": "Sunnyvale",
        "country": "CA",
        "country_code": "US",
        "display": "Sunnyvale, CA, USA",
        "lat": 37.36883,
        "lon": -122.0363496
    },
    "map_urls": {
        "large_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=1168x324&zoom=12&signature=tFv-l7wkDC0IJp0BaM8PgdJo2Eg=",
        "large_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=1024x324&zoom=12&signature=ZplXV6q543GaWATd7sWI1W-wlFA=",
        "small_1x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&size=600x400&zoom=12&signature=05L6QVrps7g9lWWUMb02NMGdR6s=",
        "small_2x": "/maps/api/staticmap?center=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&key=AIzaSyBt7dRu-48vSk1eg6v4bZbTNs43pOKiS40&maptype=roadmap&markers=803+11th+Avenue%2C+Sunnyvale%2C+CA+94089%2C+USA&scale=2&size=600x400&zoom=12&signature=ArMoeYp0Gwm6veOW7sS9qw0hPZc="
    },
    "modified": "2019-02-27T19:50:19.835Z",
    "publish_date": "2019-02-27T19:50:19.835Z",
    "qualifications": "<p>Minimum qualifications:</p><ul>\n<li>Bachelor&#39;s degree in Business Administration, Engineering, Computer Science, or equivalent practical experience.</li>\n<li>5 years of experience in strategic planning, business development or corporate development.</li>\n<li>Experience with public cloud solutions across Software-as-a-Service (SaaS), Platform-as-a-Service (PaaS), Infrastructure-as-a-Service (IaaS) or enterprise applications business.</li>\n<li>Experience in evaluating, incubating, and launching new business development opportunities.</li>\n</ul><br><p>Preferred qualifications:</p><ul>\n<li>Master&#39;s degree or equivalent practical experience.</li>\n<li>Experience in investment banking or management consulting.</li>\n<li>Experience in driving business strategies and initiatives with senior stakeholders.</li>\n<li>Excellent problem-solving and analytical skills with impeccable business judgment, thought leadership, and innovation.</li>\n<li>Comfortable operating in a rapidly changing industry.</li>\n<li>Strong modeling, communication, and presentation skills.</li>\n</ul>",
    "responsibilities": "<ul>\n<li>Identify and evaluate new business opportunities and manage relationships with external partners.</li>\n<li>Utilize data insights to define measures of success with each partner relationship; predict and manage the evolution of partner relationships.</li>\n<li>Generate holistic (product and GTM) compelling business cases, think strategically and act on ideas, and effectively sell these ideas to the leadership team.</li>\n<li>Work effectively in a team environment and develop creative alternatives.</li>\n<li>Lead meetings on negotiating agreements and execute partnership plans.</li>\n</ul>",
    "title": "Ecosystem Business Development Manager, Global Alliances, Google Cloud"
}